[
  {
    "featureName": "Sense Arcana",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You may use your senses to reach out into your immediate surroundings in order to perceive the presence or absence of magical forces.",
    "featureBenDesc": "You may detect arcane magic with your Physical action roll for Perception.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Awareness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may determine if arcane magic is present and its relative strength only."
  },
  {
    "featureName": "Arcane Knowledge",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have been introduced to the strange studies of Arcane Lore.",
    "featureBenDesc": "Add +1d4 to all Mental Activity and Skill check rolls related to Arcane Lore.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Intelligence"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Novice Binder",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to capture Arcane Energy and bind it for your use.",
    "featureBenDesc": "Through the use of certain Arcane actions you can use Fundamental Arcane Bindings to bind Arcane Energy to physical matter in order to accomplish magical feats. You gain a Magic Use/Attack modifier die of +1d4 to Use Magic rolls when attempting to use Arcane Magic. You gain a Total Daily Magic User Modifier (Charge counter). The result is your Charge value and represents the number of times you may attempt to use Arcane Magic. Once your counter is depleted, you will not be able to use Arcane Magic again without penalties until you have completed at least 6 hours of uninterrupted Complete Rest (e.g. sleep) and 1 full hour of focused meditation. Without this feat, characters may attempt to use Arcane Magic only 1d4 times each day. During a combat round, you must reduce your Ticker value by one each time that you also decrease your Charge value. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sense Arcana", "Arcane Knowledge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Un-Bind Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to release Arcane Energy from a binding and cancel its effect.",
    "featureBenDesc": "Through the use of certain Arcane actions you can unravel the binding that holds Arcane Energy to physical matter. You may attempt to cancel a manifested Arcane Binding, Power, or Spell by making an opposed Magic Use check against the original caster, or against some modifier determined by the Storyteller.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Arcane Glyph",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to bind Arcane Energy to a person, place, or object for an extended period of time.",
    "featureBenDesc": "By using Binder’s Chalk or Binder’s Ink you can inscribe a Glyph on an object or surface with which you can bind and store an Arcane effect of some sort. If the Glyph is touched, crossed, broken, or actively ‘Sensed’ (your choice), the bound Arcane effect will manifest for its normal duration target on the area, object, or creature that unbound it. Used this way, the Glyph will stay in place until it is triggered for up to one full day. You may also use this Feature to Mark an item.  Marking an item means that you have placed a personal Glyph that represents you in some essential way. This Mark can be used in various other bindings. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Feature will decrease your current Charge value by 1, along with any Charges used to create the desired Arcane effect."
  },
  {
    "featureName": "Obscure Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to hide the existence and the nature of your arcana.",
    "featureBenDesc": "By using the correct Gestures and using an additional Charge while creating an Arcane effect, you may attempt to disguise or hide the chosen effect form all ‘Sense Arcana’ checks. Anyone attempting to sense your arcana will have to succeed at an opposed Magic Use roll against you in order to do so. Alternately, you can disguise an Arcane Glyph so that it gains an opposed Check Value equal to your Use Magic roll against all Sense Arcana attempts made toward your Glyph. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Un-Bind Arcana", "Arcane Glyph"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Feature will decrease you Charge value by one."
  },
  {
    "featureName": "Linked Arcana",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You are able to share your control of Arcane Energy with other Arcanists.",
    "featureBenDesc": "You may join with up to 12 other Arcanists in an Arcane Link and provide the Master of the Link with additional power. As a Linked Arcanist, you no longer have the ability to control your magic. The Link’s Master gains a +2 bonus to Magic Use for each member of the Link and has complete access to your current Charge value. Only a Link’s Master can release a Link once it has been joined. As a member of the Link, your power is bound to the Link as long as you are within 30’ the leader. If you move beyond this limit while still linked, you break the link and immediately become Exhausted.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Find",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to help find an object or creature.",
    "featureBenDesc": "You can bind Arcane Energy into an item that you hold. As long as your target is in the same Realm, you can then use that item as a tracker to locate an object or creature that has some connection to your tracker. The stronger the connection, the more accurate the tracker. If there is only a weak connection, (i.e. similar items, items recently came into contact, were made in the same place or by the same person, etc.) you only have a 5% chance +1% x your Magic Use roll. If there is a moderate connection (i.e. possession or ownership, contains shared material, where once part of a larger set, etc.), you have a 25% chance + 1% x your Magic Use roll. If there is a strong connection (i.e. organic material, a piece of the sought item, etc.), you have a 50% chance +1% x your Magic Use roll. Once used, this binding will cause the tracker to orient itself in some way toward the sought after creature or item. It will continue to function in this way for up to one hour for each Charge spent or until you are within sight of your target. If the object or creature that you wish to Find is Marked with your personal Glyph, you do not need to bind a tracker.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Bad Touch",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to harm and damage a creature or object.",
    "featureBenDesc": "You may bind a field pure Arcane Energy around your dominant hand. If you touch an opponent or object as a standard touch attack action and decrease your current Charge value by one, you may transfer the manifested energy into your target as lethal damage.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Your touch is considered to be a Magic Attack action wherein the opponent makes an Unarmored Physical Defense roll against your Magic Use/Attack roll. If your Attack roll his higher, you deal the difference in damage + all allowed additional damage."
  },
  {
    "featureName": "Ward",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to defend yourself against harm.",
    "featureBenDesc": "You may bind a field pure Arcane Energy around your body that helps to deflect attacks. You may decrease your current Charge value by one in order to attempt your Use Magic roll in place of your Physical Ability roll to resolve Combat checks.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Glimlight",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to conjure and shape light.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy to manifest an orb of shimmering silver-blue light. This light lasts for up to one hour for each Charge spent and may illuminate an area with a 15’ radius. The light appears near you and will follow you as you move. As a free action, you may adjust the light’s brightness as you wish:  from a dim glow to its full intensity. As a standard action, you may absorb an already manifested Glimlight into yourself. If you do so, the Glimlight disappears and you glow with a soft, silver-blue light while adding 1d4+1 to your current Ticker value.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This effect is cancelled by and cancels out Darkmist."
  },
  {
    "featureName": "Slowfall",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use arcane power to slow the rate of fall for yourself or another touched individual or object.",
    "featureBenDesc": "As a move action, you may bind Arcane Energy into a field of physical force that you may use to slow the descent of yourself or a touched subject against gravity. The effect slows your fall for up to (1d4+1) x 10’ for each Charge spent. .  If the end of the fall is within this distance, the target suffers no falling damage. If the fall is farther than this, the effect’s distance will be subtracted from the calculations when determining distance for normal falling damage.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Stiff",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to affect the actions of a nearby creature.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy to cause a creature within 30’ of you to become encased in a field of Arcane Force that limits the target’s ability to function. If the creature fails at a Physical Defense roll against your Magic Attack roll, the creature will be effected for 2d4+2 rounds per Charge spent. While effected by this binding, the target can only take the equivalent of one move action each round will suffer a -2d4 to all rolls. If the creature succeeds with its Defense roll, it suffers a -1d4 penalty to all rolls until your next Turn.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Veil",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to hide.",
    "featureBenDesc": "As a standard action, you may bind a field of pure Arcane Energy around your body that causes you to blend in with your surroundings. Decrease your Charge value by one each 2d4+2 rounds of use in order to substitute your Use Magic roll in place of all Stealth checks. This applies against all Perception checks to notice you. A successful Search or Perception check will find you. You gain 75% Concealment with this effect. Signs of your passage are not hidden by this effect. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This effect is cancelled if you take any action other than a move action."
  },
  {
    "featureName": "Daze",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to affect the perceptions of a nearby creature.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy to overwhelm the perceptions of a creature within 15’ of you. If the creature fails at a Spiritual Defense roll against your Magic Attack roll, the creature will suffer a -1d4 penalty to all rolls and is allowed to take only one standard action each Turn for 2d4+2 rounds per Charge spent. If the creature succeeds with its Defense roll, it still suffers a -2 penalty to all rolls until the target’s next Turn.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Hush",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use arcane power to dampen and effect sound.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy to create a 30’ area of space around you to lower the ambient noise. Anyone inside the area of effect experiences all sounds from outside the effect as a blend of low whispering. Alternately, this effect may instead be cast so that anyone outside the area of effect must succeed at an opposed roll against your Use Magic for all Perception checks to hear any sound from within the affected area. The effect is centered on a targeted location within sight of the caster and remains stationary for 2d4+2 rounds per Charge spent and may be cancelled as a free action by the caster.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Darkmist",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to create a shadowy area.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy into a shadowy mist. This mist lasts for one hour per Charge spent and dims all natural light in a 15’ radius area. The mist surrounds you and will follow you as you move. As a free action, you may adjust the mist’s ability to darken an area as you wish from slightly shadowed to complete darkness. As a standard action, you may absorb an already manifested Darkmist into yourself. If you do, the Darkmist disappears and you become a shadowy image of yourself while you gain a +1d4 Spectral Bonus to all Combat check rolls for the next 1d4+1 rounds.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This effect is cancelled by and cancels out Glimlight."
  },
  {
    "featureName": "Image",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to create a temporary illusion.",
    "featureBenDesc": "As a standard action, you may bind a field pure Arcane Energy to a spot within 15’ of your location and use that energy to manifest an illusionary image that will last for up to one hour per Charge spent. The Image may be up to two Sizes larger than you, but cannot move and is silent. It will remain in place for its duration even if you leave the area. A Mental Defense roll against your Magic Use roll is required in order to disbelieve without interaction. Any creature that physically interacts with your ‘Image’ will immediately recognize that it is illusory.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Change",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to affect a temporary change in the appearance of a creature or object that you can touch.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy into the surface of a touched creature or object. You can use this binding to change any qualities possessed by the target that are related only to color, texture, and scent. Unless removed in some way, changes will last only for one hour per Charge spent. Unwilling creatures are allowed a Spiritual Defense roll in order to negate this effect.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Freshen",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to clean and straiten your personal appearance.",
    "featureBenDesc": "As a standard action, by decreasing your Charge value by one, you may remove surface dust and dirt from yourself and carried possessions. This will also detangle and arrange hair and remove wrinkles form clothing.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Sense Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You may use your perceptions and knowledge to investigate the various properties contained within the Arcane Energies that you can Sense.",
    "featureBenDesc": "You may use your Mental activity Recall Knowledge check for Arcane Lore to determine certain facts about an Arcane emanation that you have Sensed. Studying the nature of an Arcane Energy requires you to Sense the energy for a consecutive number of rounds while making a new Recall roll each round. On the first round you must succeed against a check of 3d6. Each following round the Check Value increased by +1d6. As long as you make successful Recall checks, you will gain an important piece of information each round in the order listed below. If you fail once, you can no longer gain additional information from a Recall check on that particular emanation until after you have rolled for your next Charge value. You can learn the following each round from investigating an instance of Arcane magic:  1st round – Age. How long ago was this magic manifested? (The stronger the magic, the longer it will leave a signature.) 2nd round – Type. What type of magic was used? (Elemental, Destructive, Investigative, Protective, etc.)  3rd round – Effect. What was the specific use of Energy and its general parameters? (The specific Arcane effect description.)  4th round – Method. What type of Arcanist bound this energy? (Sorcerer, Mage, Arcanist, Artificer, etc.)  5th round – Cultural. What cultural type of magic was this? (Elvish, Human, Goblyn, etc.)  6th round – Individual. What is the individual style or signature of the Arcanist in question? (If you have discovered this signature before, you can compare and recognize it now.  If this is a new signature, you will be able to recognize it again later if you find it again.)",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Linked Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Arcane Knowledge",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have improved your knowledge of Arcane Lore.",
    "featureBenDesc": "Your Arcane Knowledge ability bonus check die increases to +1d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Linked Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Binder",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have improved your ability to capture Arcane Energy and bind it into more complicated forms.",
    "featureBenDesc": "Through the use of certain Arcane Words and Gestures you can use Standard Arcane Bindings to bind Arcane Energy to physical matter in order to accomplish additional magical feats. Your Use Magic base modifier increases to 1d6 when using Arcane Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Linked Arcana", "Improved Sense Arcana", "Improved Arcane Knowledge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Increase Charge",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have strengthened your ability to control Arcane energy.",
    "featureBenDesc": "Add +1d4 to the Daily Magic Use roll that determines your Charge value.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Disrupt Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your control of Arcane Energy in an attempt to stop another Arcanist from creating an Arcane Effect.",
    "featureBenDesc": "As an Immediate action, you may spend one Charge and then make an opposed Use Magic roll against an Arcanist within 30’ of you who is attempting to manifest some type of Arcane Effect. If you succeed, the Effect is Disrupted and will not manifest. In addition, the targeted Arcanist still loses 1 Charge.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Magic Bullet",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "You can bind Arcane Energy as solid force in order to deal lethal damage.",
    "featureBenDesc": "As a standard action you may decrease your Charge value by one to conjure a silvery blue projectile that will immediately streak directly toward an intended target within 30’. As a Magic Attack action, you make a Magic Attack/Use roll against your opponent’s Armored Defense. If you are successful, your opponent suffers the difference as lethal Arcane Energy damage. This attack circumvents intervening objects and ignores all Block and Cover bonuses.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bad Touch", "Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Energy Blast",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding, you can bind additional Arcane Energy to your attacks.",
    "featureBenDesc": "For the next 10 rounds per Charge spent, all damage that you deal by any attack is now also counted as Arcane Energy damage. As long as this Binding is in effect, you may deal 1d6 points of additional Arcane Energy damage for each successful Melee, Ranged, or Magic Attack that you make. You may create this Binding as a Move Action.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Magic Bullet"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Shield",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "You can bind Arcane Energy into a solid force in order to defend against lethal damage.",
    "featureBenDesc": "This Binding is an improved version of Ward. When used, Ward is manifested and increased by 1d4+1. In addition to Ward, a silvery blue field of translucent force is conjured. This force is the size of a small shield and will provide 10% x 1d4 Cover against any single Melee or Ranged Attack from a specified opponent when placed between you and that opponent. You may only use this Cover against only one opponent each round. As long as you are Conscious and not attempting to create a magical effect, you may reposition your shield as a Free Action once per round while your Ward is manifested.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Ward", "Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Energy Ward",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "You can bind Arcane Energy into a solid force in order to defend against lethal damage.",
    "featureBenDesc": "You can bind a field of Arcane Energy around you in order to resist some damage from a chosen type of Energy. As a standard action, for the next 10 full rounds per Charge spent, you can withstand the first 1d6+4 points dealt by each separate attack that deals lethal damage from an energy Type of your choice. You may choose one of the following: Acid, Arcane, Electricity, Flame, Force, Frost, Shadow, or Sonic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Shield"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Levitate",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding you may use arcane power to affect and move targets without touching them.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy into a field of physical force that you may use to move yourself or any one other target in space. You may Levitate yourself or any one target that is no larger than you at your normal movement Speed up or down in vertical space for up to 10 full rounds per Charge spent. If you or your target are suspended in vertical space, you may cause movement in any one direction that you choose. You can change direction once per round at any time as free action. It takes your full concentration to cause movement, you can perform no other actions during a round that you or your target are moving. If you stop concentrating, you or your target will remain in place until you restart movement or until the effect ends. Anyone effected by this binding who remains aloft at the end of the effect may suffer from normal falling damage. As long as the binding is in effect, as a move action, you may spend an additional Charge to extend the duration by +10 full rounds.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Slowfall", "Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Unwilling creatures are allowed a Spiritual Defense roll to negate the effects of this binding."
  },
  {
    "featureName": "Push",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding you may use arcane power to affect and move targets without touching them.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy into a field of physical force that you may use to push or pull objects and creatures that are your size category or smaller. You may move such items and creatures in a single direction horizontally along a surface for a number of feet equal to your Magic Use/Attack roll. Distance moved is modified by the size difference between yourself and the subject. For smaller targets, the distance is multiplied by the number of size categories in difference. For larger targets, the distance is halved by each size category in difference. Creatures targeted by this effect are allowed an Unarmored Physical Defense roll to reduce distance by ½. The target must be in line of sight while Push is being used. Movement is stopped by any substantial object along the path of trajectory and the target will suffer 1 point of damage for each foot “Pushed” upon hitting an obstacle.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Stiff", "Levitate"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Image",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to create a good, temporary illusion.",
    "featureBenDesc": "As a standard action, you may bind a field pure Arcane Energy to a spot within 30’ of your location and use that energy to manifest an illusionary image that will last for up to one hour per Charge spent. The Image may be up to 4 Sizes larger than you, will appear to move within a 30’ radius, and it will perform a predetermined set of actions accompanied by an auditory effect both of which will vary each round for up to 10 rounds and can be set to repeat every 10 rounds. It will remain within its radius performing a set of actions for up to 1 hour even if you leave the area. You may spend 1 extra Charge for each additional hour that you wish to extend the illusion. A Mental Defense roll against your Magic Use roll is required in order to disbelieve without interaction. Any creature that physically interacts with your Image will immediately recognize that it is illusory.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Image", "Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Arcane Diagram",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore and Glyphs to strongly bind Arcane Energy to a person, place, or object for a specific purpose. By using Binder’s Chalk or Binder’s Ink as a full round action, you can inscribe a Diagram of lines and Glyphs into a circle on the ground around yourself in order to create an Arcane Circle.",
    "featureBenDesc": "As long as you remain within the inscribed Arcane Circle, you cannot be touched by creatures summoned from another Realm. For each round that you remain within the unbroken Circle, you can choose to focus your Power. If you choose to do this for up to 20 rounds and then purposefully “break” the Circle, you gain a bonus equal to +1 for each round spent in focus (up to +20). This bonus must be used to modify any one Use Magic roll of your choice within the same round that the Circle is broken or else it is lost. If you spend more than 20 rounds focusing within a Circle, the contained Energy will rupture the Circle on its own and deal 10+1d10 points of Arcane damage to you and anything within 20’ of the Circle.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each Arcane Circle that you create will decrease your Charge value by one. The Circle’s effectiveness will last for up to one hour unless it is “broken” or disrupted in some way."
  },
  {
    "featureName": "View",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding you may look into places hidden from your physical senses.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a special diagram. If you enter this diagram, you can attempt a Use Magic roll to perceive and briefly survey a location blocked to you by physical obstructions and distance. For the next 2d4+2 rounds, your senses no longer register your immediate location, but will instead reveal to you a remote 30’ diameter location somewhere of your choice within 1 mi x your Use Magic roll result. While this effect is active, you may make additional normal Perception and Search checks within the Viewed area.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Perceive", "Arcane Diagram"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Locate",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to help determine the exact current location of a creature or object.",
    "featureBenDesc": "You can draw a Diagram onto a flat surface. Once drawn, place a map into that Diagram. As long as the target is in the same Realm, the binding will place a lighted, ephemeral Glyph at the current location on the map where your target is located. You may now place a tiny mundane object such as a coin, stone, or knife onto the map. The object will absorb the Glyph and become a tracker. Once used, this binding will cause the tracker to orient itself in some way toward the sought after creature or item. Unless somehow blocked, it will continue to function in this way without fail for up to one full day per Charge spent or until you are within sight of your target. If the target you wish to Locate is Marked with your personal Glyph, you do not need to use a tracker.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Find", "View"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Conjure Item",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding, you can temporarily create a useful item.",
    "featureBenDesc": "As a full round action, this binding brings into existence any type of mundane item of Large item size or smaller. As a part of the Binding, you must decrease your Charge value by one and draw a special Diagram onto a sheet of vellum that will become the item. The conjured item may be a tool, weapon, shield, piece of furniture, or any other mundane item that you desire and will last for up to one hour per Charge spent. The item is of no value and has no magical properties, but is of Standard Quality and may be described however you choose. Once conjured, you may choose to spend one additional Charge for each extra hour that you wish to Maintain the item.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Arcane Diagram"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Alter Item",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to make a real but temporary change in the nature of an object.",
    "featureBenDesc": "As a full round action, you may bind Arcane Energy into a touched object by tracing a special Diagram on its surface. You can use this binding to change certain qualities possessed by the target. You can change its general size and weight by one degree up or down. Although you cannot change its material state, you may change the composition of material within that state. While solids and liquids must remain as such, you may change wood to metal and water to oil. The binding will not affect gaseous mater. You may Alter an item that is your Size or smaller. Unless removed in some way, changes will last only for one hour per Charge spent. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Change", "Conjure Item"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The targeted item must be in your possession at the time this binding is made."
  },
  {
    "featureName": "Mend Object",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to fix a broken or otherwise damage object.",
    "featureBenDesc": "By using a full round action to draw a special Diagram on a flat surface, you can decrease your Charge value by one to place a damaged mundane object into the Diagram and cause it to be mended. Objects to be mended must be non-magical in nature and no larger than you can hold easily in two hands. As an exception, any magical item that you have already Marked before damage was dealt may be mended in this way.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Alter Item"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Alter Creature",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to make a real but temporary change in the nature of an object.",
    "featureBenDesc": "As a full round action, you may bind Arcane Energy into a touched creature. You can use this binding to change certain qualities possessed by the target. You can change its general size and weight by one degree up or down. Although you cannot change its Creature Type, you may change its Race or Species within that Type. While Humanoids and Beasts must remain as such, you may change Human to Elf and the like. The binding will only change the appearance of your Target and will not provide any special or racial abilities possessed by creatures born to that form. You may Alter a creature that is your Size or smaller. Unless removed in some way, changes will last for one hour per Charge spent.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Alter Item"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Unwilling creatures are allowed a Spiritual Defense roll in order to negate this effect."
  },
  {
    "featureName": "Mend Creature",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to help heal a damaged creature.",
    "featureBenDesc": "By using a full round action to draw a special Diagram on a flat surface, you can place a damaged creature into the Diagram to return the same number of hit points that the creature would gain through one Complete Rest. Creatures to be mended must be no larger than you. No creature may benefit from this Binding more than once per day.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Mend Object", "Alter Creature"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You can only use this Feature on other creatures, you cannot use it to heal yourself."
  },
  {
    "featureName": "Conjure Twyt",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding, you conjure a simple Automaton to serve as a temporary personal messenger.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a tiny, fairy-like creature. This Tiny sized creature, called a Twyt, is an Automaton that is specifically designed to carry a message of no more than 160 characters scribed onto its body to any one recipient that you know anywhere within the same Realm. As a part of the Binding, you must inscribe a special Diagram into a wax tablet that will become the Twyt. Once the message is delivered, it leaves the Twyt’s body. The recipient may then inscribe a return message for the Twyt to carry back to you. Once the Twyt has returned to you, its function is over and will dissolve back into wax.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Alter Creature"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Although you may have more than one Twyt in existence concurrently, you are only able to control a total number of conjured and summoned creatures per day equal to your maximum Spiritual Ability Die roll."
  },
  {
    "featureName": "Conjure Chyt",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding, you conjure a simple Automaton to serve as a temporary personal assistant.",
    "featureBenDesc": "As a full round action, you may create a tiny, goblyn-like creature. A Chyt is a Tiny sized Automaton that appears to be a thin, simple featured cross between a monkey and a cat. The Chyt is no larger than 2’ and has hairless, blue-gray skin the texture of clay speckled with iridescent glitter. The creature has a large head with big ears and large opalescent eyes, but no mouth. As a part of the Binding, you must inscribe a special Diagram into a lump of clay that will become the Chyt. A Chyt’s main function is to hunt and remove vermin from an area delineated by you. A Chyt may also be directed to retrieve objects that are small enough for it to safely carry. Chyts can attack and defend themselves or others as directed by you. A Chyt has no Melee or Ranged attack modifiers, but has a Natural Weapon bonus for Claw of +1d4. Also, the Chyt’s Physical Ability modifier die is 1d4 . The creature has only 10 hit points and will decompose if it is reduced to 0. A Chyt must always stay within 30’ of you for up to one hour per Charge spent. Once conjured, you may choose to spend one additional Charge for each extra hour that you wish to Maintain the Chyt. When this binding ends, the Chyt disappears and leaves behind the original lump of clay.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Conjure Twyt"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have more than one Chyt in existence at a time.  You are only able to control a total number of conjured and summoned creatures per day equal to your maximum Spiritual Ability Die roll."
  }
]