[
  {
    "featureName": "Sense Arcana",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You may use your senses to reach out into your immediate surroundings in order to perceive the presence or absence of magical forces.",
    "featureBenDesc": "You may detect arcane magic with your Physical action roll for Perception.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Awareness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may determine if arcane magic is present and its relative strength only."
  },
  {
    "featureName": "Arcane Knowledge",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have been introduced to the strange studies of Arcane Lore.",
    "featureBenDesc": "Add +1d4 to all Mental Activity and Skill check rolls related to Arcane Lore.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Intelligence"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Bind Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to capture Arcane Energy and bind it for your use.",
    "featureBenDesc": "Through the use of certain Arcane actions you can use Fundamental Arcane Bindings to bind Arcane Energy to physical matter in order to accomplish magical feats. You gain a Magic Use/Attack modifier die of +1d4 to Use Magic rolls when attempting to use Arcane Magic. You gain a Total Daily Magic User Modifier (Charge counter). The result is your Charge value and represents the number of times you may attempt to use Arcane Magic. Once your counter is depleted, you will not be able to use Arcane Magic again without penalties until you have completed at least 6 hours of uninterrupted Complete Rest (e.g. sleep) and 1 full hour of focused meditation. Without this feat, characters may attempt to use Arcane Magic only 1d4 times each day. During a combat round, you must reduce your Ticker value by one each time that you also decrease your Charge value. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sense Arcana", "Arcane Knowledge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Un-Bind Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to release Arcane Energy from a binding and cancel its effect.",
    "featureBenDesc": "Through the use of certain Arcane actions you can unravel the binding that holds Arcane Energy to physical matter. You may attempt to cancel a manifested Arcane Binding, Power, or Spell by making an opposed Magic Use check against the original caster, or against some modifier determined by the Storyteller.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Arcane Glyph",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to bind Arcane Energy to a person, place, or object for an extended period of time.",
    "featureBenDesc": "By using Binder’s Chalk or Binder’s Ink you can inscribe a Glyph on an object or surface with which you can bind and store an Arcane effect of some sort. If the Glyph is touched, crossed, broken, or actively ‘Sensed’ (your choice), the bound Arcane effect will manifest for its normal duration target on the area, object, or creature that unbound it. Used this way, the Glyph will stay in place until it is triggered for up to one full day. You may also use this Feature to Mark an item.  Marking an item means that you have placed a personal Glyph that represents you in some essential way. This Mark can be used in various other bindings. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Feature will decrease your current Charge value by 1, along with any Charges used to create the desired Arcane effect."
  },
  {
    "featureName": "Obscure Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to hide the existence and the nature of your arcana.",
    "featureBenDesc": "By using the correct Gestures and using an additional Charge while creating an Arcane effect, you may attempt to disguise or hide the chosen effect form all ‘Sense Arcana’ checks. Anyone attempting to sense your arcana will have to succeed at an opposed Magic Use roll against you in order to do so. Alternately, you can disguise an Arcane Glyph so that it gains an opposed Check Value equal to your Use Magic roll against all Sense Arcana attempts made toward your Glyph. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Un-Bind Arcana", "Arcane Glyph"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Feature will decrease you Charge value by one."
  },
  {
    "featureName": "Linked Arcana",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You are able to share your control of Arcane Energy with other Arcanists.",
    "featureBenDesc": "You may join with up to 12 other Arcanists in an Arcane Link and provide the Master of the Link with additional power. As a Linked Arcanist, you no longer have the ability to control your magic. The Link’s Master gains a +2 bonus to Magic Use for each member of the Link and has complete access to your current Charge value. Only a Link’s Master can release a Link once it has been joined. As a member of the Link, your power is bound to the Link as long as you are within 30’ the leader. If you move beyond this limit while still linked, you break the link and immediately become Exhausted.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Find",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to help find an object or creature.",
    "featureBenDesc": "You can bind Arcane Energy into an item that you hold. As long as your target is in the same Realm, you can then use that item as a tracker to locate an object or creature that has some connection to your tracker. The stronger the connection, the more accurate the tracker. If there is only a weak connection, (i.e. similar items, items recently came into contact, were made in the same place or by the same person, etc.) you only have a 5% chance +1% x your Magic Use roll. If there is a moderate connection (i.e. possession or ownership, contains shared material, where once part of a larger set, etc.), you have a 25% chance + 1% x your Magic Use roll. If there is a strong connection (i.e. organic material, a piece of the sought item, etc.), you have a 50% chance +1% x your Magic Use roll. Once used, this binding will cause the tracker to orient itself in some way toward the sought after creature or item. It will continue to function in this way for up to one hour for each Charge spent or until you are within sight of your target. If the object or creature that you wish to Find is Marked with your personal Glyph, you do not need to bind a tracker.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  }
]