[{
    "featureName": "Sense Arcana",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You may use your senses to reach out into your immediate surroundings in order to perceive the presence or absence of magical forces.",
    "featureBenDesc": "You may detect arcane magic with your Physical action roll for Perception.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Awareness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may determine if arcane magic is present and its relative strength only."
  },
  {
    "featureName": "Arcane Knowledge",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have been introduced to the strange studies of Arcane Lore.",
    "featureBenDesc": "Add +1d4 to all Mental Activity and Skill check rolls related to Arcane Lore.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Intelligence"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Bind Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to capture Arcane Energy and bind it for your use.",
    "featureBenDesc": "Through the use of certain Arcane actions you can use Fundamental Arcane Bindings to bind Arcane Energy to physical matter in order to accomplish magical feats. You gain a Magic Use/Attack modifier die of +1d4 to Use Magic rolls when attempting to use Arcane Magic. You gain a Total Daily Magic User Modifier (Charge counter). The result is your Charge value and represents the number of times you may attempt to use Arcane Magic. Once your counter is depleted, you will not be able to use Arcane Magic again without penalties until you have completed at least 6 hours of uninterrupted Complete Rest (e.g. sleep) and 1 full hour of focused meditation. Without this feat, characters may attempt to use Arcane Magic only 1d4 times each day. During a combat round, you must reduce your Ticker value by one each time that you also decrease your Charge value. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sense Arcana", "Arcane Knowledge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Un-Bind Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to release Arcane Energy from a binding and cancel its effect.",
    "featureBenDesc": "Through the use of certain Arcane actions you can unravel the binding that holds Arcane Energy to physical matter. You may attempt to cancel a manifested Arcane Binding, Power, or Spell by making an opposed Magic Use check against the original caster, or against some modifier determined by the Storyteller.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Arcane Glyph",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to bind Arcane Energy to a person, place, or object for an extended period of time.",
    "featureBenDesc": "By using Binder’s Chalk or Binder’s Ink you can inscribe a Glyph on an object or surface with which you can bind and store an Arcane effect of some sort. If the Glyph is touched, crossed, broken, or actively ‘Sensed’ (your choice), the bound Arcane effect will manifest for its normal duration target on the area, object, or creature that unbound it. Used this way, the Glyph will stay in place until it is triggered for up to one full day. You may also use this Feature to Mark an item.  Marking an item means that you have placed a personal Glyph that represents you in some essential way. This Mark can be used in various other bindings. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Feature will decrease your current Charge value by 1, along with any Charges used to create the desired Arcane effect."
  },
  {
    "featureName": "Obscure Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore to hide the existence and the nature of your arcana.",
    "featureBenDesc": "By using the correct Gestures and using an additional Charge while creating an Arcane effect, you may attempt to disguise or hide the chosen effect form all ‘Sense Arcana’ checks. Anyone attempting to sense your arcana will have to succeed at an opposed Magic Use roll against you in order to do so. Alternately, you can disguise an Arcane Glyph so that it gains an opposed Check Value equal to your Use Magic roll against all Sense Arcana attempts made toward your Glyph. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Un-Bind Arcana", "Arcane Glyph"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Feature will decrease you Charge value by one."
  },
  {
    "featureName": "Linked Arcana",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You are able to share your control of Arcane Energy with other Arcanists.",
    "featureBenDesc": "You may join with up to 12 other Arcanists in an Arcane Link and provide the Master of the Link with additional power. As a Linked Arcanist, you no longer have the ability to control your magic. The Link’s Master gains a +2 bonus to Magic Use for each member of the Link and has complete access to your current Charge value. Only a Link’s Master can release a Link once it has been joined. As a member of the Link, your power is bound to the Link as long as you are within 30’ the leader. If you move beyond this limit while still linked, you break the link and immediately become Exhausted.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Find",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to help find an object or creature.",
    "featureBenDesc": "You can bind Arcane Energy into an item that you hold. As long as your target is in the same Realm, you can then use that item as a tracker to locate an object or creature that has some connection to your tracker. The stronger the connection, the more accurate the tracker. If there is only a weak connection, (i.e. similar items, items recently came into contact, were made in the same place or by the same person, etc.) you only have a 5% chance +1% x your Magic Use roll. If there is a moderate connection (i.e. possession or ownership, contains shared material, where once part of a larger set, etc.), you have a 25% chance + 1% x your Magic Use roll. If there is a strong connection (i.e. organic material, a piece of the sought item, etc.), you have a 50% chance +1% x your Magic Use roll. Once used, this binding will cause the tracker to orient itself in some way toward the sought after creature or item. It will continue to function in this way for up to one hour for each Charge spent or until you are within sight of your target. If the object or creature that you wish to Find is Marked with your personal Glyph, you do not need to bind a tracker.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Bad Touch",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to harm and damage a creature or object.",
    "featureBenDesc": "You may bind a field pure Arcane Energy around your dominant hand. If you touch an opponent or object as a standard touch attack action and decrease your current Charge value by one, you may transfer the manifested energy into your target as lethal damage.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Your touch is considered to be a Magic Attack action wherein the opponent makes an Unarmored Physical Defense roll against your Magic Use/Attack roll. If your Attack roll his higher, you deal the difference in damage + all allowed additional damage."
  },
  {
    "featureName": "Ward",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to defend yourself against harm.",
    "featureBenDesc": "You may bind a field pure Arcane Energy around your body that helps to deflect attacks. You may decrease your current Charge value by one in order to attempt your Use Magic roll in place of your Physical Ability roll to resolve Combat checks.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Glimlight",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to conjure and shape light.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy to manifest an orb of shimmering silver-blue light. This light lasts for up to one hour for each Charge spent and may illuminate an area with a 15’ radius. The light appears near you and will follow you as you move. As a free action, you may adjust the light’s brightness as you wish:  from a dim glow to its full intensity. As a standard action, you may absorb an already manifested Glimlight into yourself. If you do so, the Glimlight disappears and you glow with a soft, silver-blue light while adding 1d4+1 to your current Ticker value.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This effect is cancelled by and cancels out Darkmist."
  },
  {
    "featureName": "Slowfall",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use arcane power to slow the rate of fall for yourself or another touched individual or object.",
    "featureBenDesc": "As a move action, you may bind Arcane Energy into a field of physical force that you may use to slow the descent of yourself or a touched subject against gravity. The effect slows your fall for up to (1d4+1) x 10’ for each Charge spent. .  If the end of the fall is within this distance, the target suffers no falling damage. If the fall is farther than this, the effect’s distance will be subtracted from the calculations when determining distance for normal falling damage.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Stiff",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to affect the actions of a nearby creature.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy to cause a creature within 30’ of you to become encased in a field of Arcane Force that limits the target’s ability to function. If the creature fails at a Physical Defense roll against your Magic Attack roll, the creature will be effected for 2d4+2 rounds per Charge spent. While effected by this binding, the target can only take the equivalent of one move action each round will suffer a -2d4 to all rolls. If the creature succeeds with its Defense roll, it suffers a -1d4 penalty to all rolls until your next Turn.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Veil",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to hide.",
    "featureBenDesc": "As a standard action, you may bind a field of pure Arcane Energy around your body that causes you to blend in with your surroundings. Decrease your Charge value by one each 2d4+2 rounds of use in order to substitute your Use Magic roll in place of all Stealth checks. This applies against all Perception checks to notice you. A successful Search or Perception check will find you. You gain 75% Concealment with this effect. Signs of your passage are not hidden by this effect. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This effect is cancelled if you take any action other than a move action."
  },
  {
    "featureName": "Daze",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to affect the perceptions of a nearby creature.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy to overwhelm the perceptions of a creature within 15’ of you. If the creature fails at a Spiritual Defense roll against your Magic Attack roll, the creature will suffer a -1d4 penalty to all rolls and is allowed to take only one standard action each Turn for 2d4+2 rounds per Charge spent. If the creature succeeds with its Defense roll, it still suffers a -2 penalty to all rolls until the target’s next Turn.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Hush",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use arcane power to dampen and effect sound.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy to create a 30’ area of space around you to lower the ambient noise. Anyone inside the area of effect experiences all sounds from outside the effect as a blend of low whispering. Alternately, this effect may instead be cast so that anyone outside the area of effect must succeed at an opposed roll against your Use Magic for all Perception checks to hear any sound from within the affected area. The effect is centered on a targeted location within sight of the caster and remains stationary for 2d4+2 rounds per Charge spent and may be cancelled as a free action by the caster.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Darkmist",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to create a shadowy area.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy into a shadowy mist. This mist lasts for one hour per Charge spent and dims all natural light in a 15’ radius area. The mist surrounds you and will follow you as you move. As a free action, you may adjust the mist’s ability to darken an area as you wish from slightly shadowed to complete darkness. As a standard action, you may absorb an already manifested Darkmist into yourself. If you do, the Darkmist disappears and you become a shadowy image of yourself while you gain a +1d4 Spectral Bonus to all Combat check rolls for the next 1d4+1 rounds.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This effect is cancelled by and cancels out Glimlight."
  },
  {
    "featureName": "Image",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to create a temporary illusion.",
    "featureBenDesc": "As a standard action, you may bind a field pure Arcane Energy to a spot within 15’ of your location and use that energy to manifest an illusionary image that will last for up to one hour per Charge spent. The Image may be up to two Sizes larger than you, but cannot move and is silent. It will remain in place for its duration even if you leave the area. A Mental Defense roll against your Magic Use roll is required in order to disbelieve without interaction. Any creature that physically interacts with your ‘Image’ will immediately recognize that it is illusory.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Change",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to affect a temporary change in the appearance of a creature or object that you can touch.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy into the surface of a touched creature or object. You can use this binding to change any qualities possessed by the target that are related only to color, texture, and scent. Unless removed in some way, changes will last only for one hour per Charge spent. Unwilling creatures are allowed a Spiritual Defense roll in order to negate this effect.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Freshen",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Fundamental Binding you may use Arcane Energy to clean and straiten your personal appearance.",
    "featureBenDesc": "As a standard action, by decreasing your Charge value by one, you may remove surface dust and dirt from yourself and carried possessions. This will also detangle and arrange hair and remove wrinkles form clothing.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Novice Binder",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have learned what is required to start your career as an Arcanist.",
    "featureBenDesc": "Gain a +1d4 to all Use Magic check rolls when using a Fundamental Binding.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Arcane Glyph", "Linked Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Sense Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You may use your perceptions and knowledge to investigate the various properties contained within the Arcane Energies that you can Sense.",
    "featureBenDesc": "You may use your Mental activity Recall Knowledge check for Arcane Lore to determine certain facts about an Arcane emanation that you have Sensed. Studying the nature of an Arcane Energy requires you to Sense the energy for a consecutive number of rounds while making a new Recall roll each round. On the first round you must succeed against a check of 3d6. Each following round the Check Value increased by +1d6. As long as you make successful Recall checks, you will gain an important piece of information each round in the order listed below. If you fail once, you can no longer gain additional information from a Recall check on that particular emanation until after you have rolled for your next Charge value. You can learn the following each round from investigating an instance of Arcane magic:  1st round – Age. How long ago was this magic manifested? (The stronger the magic, the longer it will leave a signature.) 2nd round – Type. What type of magic was used? (Elemental, Destructive, Investigative, Protective, etc.)  3rd round – Effect. What was the specific use of Energy and its general parameters? (The specific Arcane effect description.)  4th round – Method. What type of Arcanist bound this energy? (Sorcerer, Mage, Arcanist, Artificer, etc.)  5th round – Cultural. What cultural type of magic was this? (Elvish, Human, Goblyn, etc.)  6th round – Individual. What is the individual style or signature of the Arcanist in question? (If you have discovered this signature before, you can compare and recognize it now.  If this is a new signature, you will be able to recognize it again later if you find it again.)",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Arcane Knowledge",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have improved your knowledge of Arcane Lore.",
    "featureBenDesc": "Your Arcane Knowledge ability bonus check die increases to +1d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Bind Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have improved your ability to capture Arcane Energy and bind it into more complicated forms.",
    "featureBenDesc": "Through the use of certain Arcane Words and Gestures you can use Standard Arcane Bindings to bind Arcane Energy to physical matter in order to accomplish additional magical feats. Your Use Magic base modifier increases to 1d6 when using Arcane Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Linked Arcana", "Improved Sense Arcana", "Improved Arcane Knowledge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Increase Charge",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have strengthened your ability to control Arcane energy.",
    "featureBenDesc": "Add +1d4 to the Daily Magic Use roll that determines your Charge value.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Disrupt Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your control of Arcane Energy in an attempt to stop another Arcanist from creating an Arcane Effect.",
    "featureBenDesc": "As an Immediate action, you may spend one Charge and then make an opposed Use Magic roll against an Arcanist within 30’ of you who is attempting to manifest some type of Arcane Effect. If you succeed, the Effect is Disrupted and will not manifest. In addition, the targeted Arcanist still loses 1 Charge.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Magic Bullet",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "You can bind Arcane Energy as solid force in order to deal lethal damage.",
    "featureBenDesc": "As a standard action you may decrease your Charge value by one to conjure a silvery blue projectile that will immediately streak directly toward an intended target within 30’. As a Magic Attack action, you make a Magic Attack/Use roll against your opponent’s Armored Defense. If you are successful, your opponent suffers the difference as lethal Arcane Energy damage. This attack circumvents intervening objects and ignores all Block and Cover bonuses.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Bad Touch", "Improved Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Energy Blast",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding, you can bind additional Arcane Energy to your attacks.",
    "featureBenDesc": "For the next 10 rounds per Charge spent, all damage that you deal by any attack is now also counted as Arcane Energy damage. As long as this Binding is in effect, you may deal 1d6 points of additional Arcane Energy damage for each successful Melee, Ranged, or Magic Attack that you make. You may create this Binding as a Move Action.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Magic Bullet"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Shield",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "You can bind Arcane Energy into a solid force in order to defend against lethal damage.",
    "featureBenDesc": "This Binding is an improved version of Ward. When used, Ward is manifested and increased by 1d4+1. In addition to Ward, a silvery blue field of translucent force is conjured. This force is the size of a small shield and will provide 10% x 1d4 Cover against any single Melee or Ranged Attack from a specified opponent when placed between you and that opponent. You may only use this Cover against only one opponent each round. As long as you are Conscious and not attempting to create a magical effect, you may reposition your shield as a Free Action once per round while your Ward is manifested.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Ward", "Improved Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Energy Ward",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "You can bind Arcane Energy into a solid force in order to defend against lethal damage.",
    "featureBenDesc": "You can bind a field of Arcane Energy around you in order to resist some damage from a chosen type of Energy. As a standard action, for the next 10 full rounds per Charge spent, you can withstand the first 1d6+4 points dealt by each separate attack that deals lethal damage from an energy Type of your choice. You may choose one of the following: Acid, Arcane, Electricity, Flame, Force, Frost, Shadow, or Sonic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Shield"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Levitate",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding you may use arcane power to affect and move targets without touching them.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy into a field of physical force that you may use to move yourself or any one other target in space. You may Levitate yourself or any one target that is no larger than you at your normal movement Speed up or down in vertical space for up to 10 full rounds per Charge spent. If you or your target are suspended in vertical space, you may cause movement in any one direction that you choose. You can change direction once per round at any time as free action. It takes your full concentration to cause movement, you can perform no other actions during a round that you or your target are moving. If you stop concentrating, you or your target will remain in place until you restart movement or until the effect ends. Anyone effected by this binding who remains aloft at the end of the effect may suffer from normal falling damage. As long as the binding is in effect, as a move action, you may spend an additional Charge to extend the duration by +10 full rounds.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Slowfall", "Improved Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Unwilling creatures are allowed a Spiritual Defense roll to negate the effects of this binding."
  },
  {
    "featureName": "Push",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding you may use arcane power to affect and move targets without touching them.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy into a field of physical force that you may use to push or pull objects and creatures that are your size category or smaller. You may move such items and creatures in a single direction horizontally along a surface for a number of feet equal to your Magic Use/Attack roll. Distance moved is modified by the size difference between yourself and the subject. For smaller targets, the distance is multiplied by the number of size categories in difference. For larger targets, the distance is halved by each size category in difference. Creatures targeted by this effect are allowed an Unarmored Physical Defense roll to reduce distance by ½. The target must be in line of sight while Push is being used. Movement is stopped by any substantial object along the path of trajectory and the target will suffer 1 point of damage for each foot “Pushed” upon hitting an obstacle.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Stiff", "Levitate"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Image",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to create a good, temporary illusion.",
    "featureBenDesc": "As a standard action, you may bind a field pure Arcane Energy to a spot within 30’ of your location and use that energy to manifest an illusionary image that will last for up to one hour per Charge spent. The Image may be up to 4 Sizes larger than you, will appear to move within a 30’ radius, and it will perform a predetermined set of actions accompanied by an auditory effect both of which will vary each round for up to 10 rounds and can be set to repeat every 10 rounds. It will remain within its radius performing a set of actions for up to 1 hour even if you leave the area. You may spend 1 extra Charge for each additional hour that you wish to extend the illusion. A Mental Defense roll against your Magic Use roll is required in order to disbelieve without interaction. Any creature that physically interacts with your Image will immediately recognize that it is illusory.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Image", "Improved Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Arcane Diagram",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your knowledge of Arcane Lore and Glyphs to strongly bind Arcane Energy to a person, place, or object for a specific purpose. By using Binder’s Chalk or Binder’s Ink as a full round action, you can inscribe a Diagram of lines and Glyphs into a circle on the ground around yourself in order to create an Arcane Circle.",
    "featureBenDesc": "As long as you remain within the inscribed Arcane Circle, you cannot be touched by creatures summoned from another Realm. For each round that you remain within the unbroken Circle, you can choose to focus your Power. If you choose to do this for up to 20 rounds and then purposefully “break” the Circle, you gain a bonus equal to +1 for each round spent in focus (up to +20). This bonus must be used to modify any one Use Magic roll of your choice within the same round that the Circle is broken or else it is lost. If you spend more than 20 rounds focusing within a Circle, the contained Energy will rupture the Circle on its own and deal 10+1d10 points of Arcane damage to you and anything within 20’ of the Circle.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each Arcane Circle that you create will decrease your Charge value by one. The Circle’s effectiveness will last for up to one hour unless it is “broken” or disrupted in some way."
  },
  {
    "featureName": "View",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding you may look into places hidden from your physical senses.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a special diagram. If you enter this diagram, you can attempt a Use Magic roll to perceive and briefly survey a location blocked to you by physical obstructions and distance. For the next 2d4+2 rounds, your senses no longer register your immediate location, but will instead reveal to you a remote 30’ diameter location somewhere of your choice within 1 mi x your Use Magic roll result. While this effect is active, you may make additional normal Perception and Search checks within the Viewed area.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Perceive", "Arcane Diagram"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Locate",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to help determine the exact current location of a creature or object.",
    "featureBenDesc": "You can draw a Diagram onto a flat surface. Once drawn, place a map into that Diagram. As long as the target is in the same Realm, the binding will place a lighted, ephemeral Glyph at the current location on the map where your target is located. You may now place a tiny mundane object such as a coin, stone, or knife onto the map. The object will absorb the Glyph and become a tracker. Once used, this binding will cause the tracker to orient itself in some way toward the sought after creature or item. Unless somehow blocked, it will continue to function in this way without fail for up to one full day per Charge spent or until you are within sight of your target. If the target you wish to Locate is Marked with your personal Glyph, you do not need to use a tracker.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Find", "View"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Conjure Item",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding, you can temporarily create a useful item.",
    "featureBenDesc": "As a full round action, this binding brings into existence any type of mundane item of Large item size or smaller. As a part of the Binding, you must decrease your Charge value by one and draw a special Diagram onto a sheet of vellum that will become the item. The conjured item may be a tool, weapon, shield, piece of furniture, or any other mundane item that you desire and will last for up to one hour per Charge spent. The item is of no value and has no magical properties, but is of Standard Quality and may be described however you choose. Once conjured, you may choose to spend one additional Charge for each extra hour that you wish to Maintain the item.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Arcane Diagram"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Alter Item",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to make a real but temporary change in the nature of an object.",
    "featureBenDesc": "As a full round action, you may bind Arcane Energy into a touched object by tracing a special Diagram on its surface. You can use this binding to change certain qualities possessed by the target. You can change its general size and weight by one degree up or down. Although you cannot change its material state, you may change the composition of material within that state. While solids and liquids must remain as such, you may change wood to metal and water to oil. The binding will not affect gaseous mater. You may Alter an item that is your Size or smaller. Unless removed in some way, changes will last only for one hour per Charge spent. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Change", "Conjure Item"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The targeted item must be in your possession at the time this binding is made."
  },
  {
    "featureName": "Summon Item",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding, you can summon a prepared item to you.",
    "featureBenDesc": "As a full round action, this binding brings to you a Large or smaller sized item that you specify. In preparation for this binding, you must have chosen a special personal Glyph that represents you in some way. You may inscribe this Glyph as your personal Mark onto an item that you own or that you possess as you would place any other Glyph as described in the Feature Arcane Glyph. Alternately, you may have your Glyph permanently inscribed or added to the desired object either by a trained craftsman or by yourself at a Crafting check roll of 10 or better. This requires a full hour of work and decreased your Charge value by 5. Once the item has been inscribed, you may use this binding to summon it to you at any time. As long as the item is not magically bound or kept in a lead or iron container, it will appear in your hand at the beginning of your next Turn. Certain effects may be used to block this binding. If the item cannot reach you, it will return to its point of origin. This binding can be used on items of Large item size and smaller only. It will not work on creatures of any type. This binding can only work if you and the object are within the same Realm. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Alter Item"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Although you may have more than one such personal Glyph Marked item in existence at once, you are only able to Mark a total number of personal items equal to your maximum Mental Ability Die roll."
  },
  {
    "featureName": "Mend Object",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to fix a broken or otherwise damage object.",
    "featureBenDesc": "By using a full round action to draw a special Diagram on a flat surface, you can decrease your Charge value by one to place a damaged mundane object into the Diagram and cause it to be mended. Objects to be mended must be non-magical in nature and no larger than you can hold easily in two hands. As an exception, any magical item that you have already Marked before damage was dealt may be mended in this way.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Alter Item"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Alter Creature",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to make a real but temporary change in the nature of an object.",
    "featureBenDesc": "As a full round action, you may bind Arcane Energy into a touched creature. You can use this binding to change certain qualities possessed by the target. You can change its general size and weight by one degree up or down. Although you cannot change its Creature Type, you may change its Race or Species within that Type. While Humanoids and Beasts must remain as such, you may change Human to Elf and the like. The binding will only change the appearance of your Target and will not provide any special or racial abilities possessed by creatures born to that form. You may Alter a creature that is your Size or smaller. Unless removed in some way, changes will last for one hour per Charge spent.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Alter Item"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Unwilling creatures are allowed a Spiritual Defense roll in order to negate this effect."
  },
  {
    "featureName": "Mend Creature",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding you may use Arcane Energy to help heal a damaged creature.",
    "featureBenDesc": "By using a full round action to draw a special Diagram on a flat surface, you can place a damaged creature into the Diagram to return the same number of hit points that the creature would gain through one Complete Rest. Creatures to be mended must be no larger than you. No creature may benefit from this Binding more than once per day.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Mend Object", "Alter Creature"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You can only use this Feature on other creatures, you cannot use it to heal yourself."
  },
  {
    "featureName": "Conjure Twyt",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding, you conjure a simple Automaton to serve as a temporary personal messenger.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a tiny, fairy-like creature. This Tiny sized creature, called a Twyt, is an Automaton that is specifically designed to carry a message of no more than 160 characters scribed onto its body to any one recipient that you know anywhere within the same Realm. As a part of the Binding, you must inscribe a special Diagram into a wax tablet that will become the Twyt. Once the message is delivered, it leaves the Twyt’s body. The recipient may then inscribe a return message for the Twyt to carry back to you. Once the Twyt has returned to you, its function is over and will dissolve back into wax.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Alter Creature"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Although you may have more than one Twyt in existence concurrently, you are only able to control a total number of conjured and summoned creatures per day equal to your maximum Spiritual Ability Die roll."
  },
  {
    "featureName": "Conjure Chyt",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding, you conjure a simple Automaton to serve as a temporary personal assistant.",
    "featureBenDesc": "As a full round action, you may create a tiny, goblyn-like creature. A Chyt is a Tiny sized Automaton that appears to be a thin, simple featured cross between a monkey and a cat. The Chyt is no larger than 2’ and has hairless, blue-gray skin the texture of clay speckled with iridescent glitter. The creature has a large head with big ears and large opalescent eyes, but no mouth. As a part of the Binding, you must inscribe a special Diagram into a lump of clay that will become the Chyt. A Chyt’s main function is to hunt and remove vermin from an area delineated by you. A Chyt may also be directed to retrieve objects that are small enough for it to safely carry. Chyts can attack and defend themselves or others as directed by you. A Chyt has no Melee or Ranged attack modifiers, but has a Natural Weapon bonus for Claw of +1d4. Also, the Chyt’s Physical Ability modifier die is 1d4 . The creature has only 10 hit points and will decompose if it is reduced to 0. A Chyt must always stay within 30’ of you for up to one hour per Charge spent. Once conjured, you may choose to spend one additional Charge for each extra hour that you wish to Maintain the Chyt. When this binding ends, the Chyt disappears and leaves behind the original lump of clay.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Conjure Twyt"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have more than one Chyt in existence at a time.  You are only able to control a total number of conjured and summoned creatures per day equal to your maximum Spiritual Ability Die roll."
  },
  {
    "featureName": "Conjure Kurr",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding, you conjure a simple Automaton to serve as a temporary personal guard.",
    "featureBenDesc": "As a full round action, you may create a small, dog-like creature. A Kurr is a Small sized Automaton that appears to be a stocky, simple featured cross between a lizard and a dog. The Kurr is no larger than 4’ and has hairless, blue-gray skin the texture of clay speckled with iridescent glitter. The creature has a large head with small ears, large opalescent eyes, and a large, fang filled mouth. As a part of the Binding, you must inscribe a special Diagram into a fist sized rock that will become the Kurr. A Kurr’s main function is to guard and protect anyone and anything that you determine. A Kurr can attack has a Melee attack modifier of +1d4, and a Natural Weapon bonus for Bite of +1d6. Also, the Kurr’s Physical Ability modifier die is +1d6. The creature has only 20 hit points and will decompose if it is reduced to 0. A Kurr must always stay within 30’ of you for up to one hour per Charge spent. Once conjured, you may choose to spend one additional Charge for each extra hour that you wish to Maintain the Kurr. When this binding ends, the Kurr disappears and leaves behind the original rock. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Conjure Chyt"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have more than one Kurr in existence at a time.  You are only able to control a total number of conjured and summoned creatures per day equal to your maximum Spiritual Ability Die roll."
  },
  {
    "featureName": "Arcane Bond",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Standard Binding, you can create a permanent bond between you and a specific target creature of your choice.",
    "featureBenDesc": "As a full round action, this binding uses Arcane energy to connect your Mind, Body, and Spirit magically to the Body, Mind, and Spirit of another creature. If successful, this binding will cause the Target to become your Familiar. In preparation for this binding, you must have your personal Mark inscribed in some permanent fashion onto the skin of the targeted creature by a trained craftsman or by yourself at a Crafting check roll of 10 or better. This requires a full hour of work and decreases your Charge value by 10.  In addition, for each Bond that you create, you must spend 1 Training Point. When the bond is complete, your Physical Ability Die is increase by one type and the Familiar’s Mental Ability Die is increased by one type. Non sentient creatures automatically become self-aware and, if physically able, may speak your base language. Once bonded, you and your Familiar, unless somehow impeded, will always be aware of each other’s exact location by direction and general distance from each other within the same Realm. If you are in separate Realms, you will be aware of that fact and the general nature of the other’s Realm. Within 30’ of each other, you each gain a +1d4 Morale bonus to all rolls, and you may communicate ideas telepathically. Of course, the detail and complexity of your communications are limited by the mental abilities of your Familiar. Outside of 30’, you are only aware of each other’s strongest emotion and sense impression at any one time. You may each send a general call for help at any time that, if not blocked, will reach across any Realm. Also, within 30’ of each other, you share Current Hit Point Totals. If you move out of Range, your common Current Total is divided in half. Additionally within proximity, all Magical effects applied to you that modify dice rolls will also affect your Familiar. Your Familiar is bound to obey your commands. If the creature refuses to do as you ask, it will suffer a -10 Morale penalty to all rolls until it complies with your request. If the creature attempts to complete your request, but is for some reason unable, it does not suffer this penalty. If your Familiar dies while bonded to you, your Hit Point Total reverts to normal and you suffer 2d10 points of lethal damage while reducing your Charge value to 0. If you die, your bonded creature must make a successful Spiritual Defense roll against your Maximum Magic Use/Attack roll result or else die. If successful, the creature permanently suffers a -1d4 penalty to all rolls, has its Current Hit Points reduced to 1, and becomes Exhausted. If you are within 30’ of your Familiar, you may choose to end the bond at any time as a full round action. This requires you to burn 5 of your daily Charges to use a special Disrupt Arcana on the personal Mark.  Your Current Hit Points will each become ½ of your combined Current Hit Point total not to exceed either’s maximum hit points; you will each become Exhausted; and you will each lose all benefits granted by this bond. If the bond is ever broken for some reason, the bonded creature will always be uncomfortable when near you and suffer a -1d4 Morale penalty whenever within 30’ of you. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Arcane Diagram"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Familiar at a time."
  },
  {
    "featureName": "Arcane Magic Item",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Craft",
    "featureDesc": "You can create simple items of temporary Arcane Power.",
    "featureBenDesc": "You may create Minor Arcane Magic Items as described later in the chapter entitled Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Arcane Diagram"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Binder",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You are now a full fledged Binder.",
    "featureBenDesc": "Increase your Novice Binder bonus for Fundamental Binding check rolls to a d6. Gain a +1d4 to all Use Magic Check rolls when using a Standard Binding.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Arcane Bond"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Sense Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can extend your Arcane senses into other Realms and other Magics.",
    "featureBenDesc": "You may now Sense Arcana in the nearby Edges of adjacent Realms. You may now use your Sense Arcana abilities on Divine Magic as if it were Arcane Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Arcane Knowledge",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have improved your knowledge of Arcane Lore.",
    "featureBenDesc": "Your Arcane Knowledge check modifier die increases to d8.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Bind Arcana",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have improved your ability to capture Arcane Energy and bind it into more complicated forms.",
    "featureBenDesc": "Through the use of certain Arcane Words and Gestures you can use Advanced Arcane Bindings to bind Arcane Energy to physical matter in order to accomplish powerful Arcane effects. Your Base Magic Use/Attack modifier die increases to d8.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Sense Arcana", "Advanced Arcane Knowledge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Increase Charge",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have increased your hold over the power of Arcane energies.",
    "featureBenDesc": "Add another +1d4 to the Daily Magic Use roll that determines your Charge value.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Destroy Arcana",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your control of Arcane Energy to disenchant an Arcane Magic Item.",
    "featureBenDesc": "As a full round action, by placing a magic item onto a specially drawn Diagram and spending one Charge, you may permanently remove a single Arcane effect from that item. If the item no longer has any Arcane effects after you use this Feature, it becomes a Poor Quality mundane item and cannot be used again to create any Arcane magic item. While using this ability, if you succeed at a Magic Use roll against 1d20+10 you may siphon off some of the freed Arcane energy to increase your current Charge value by +1d4.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Arcane Magic Item",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Craft",
    "featureDesc": "You can create remarkable items of Arcane Power.",
    "featureBenDesc": "You may create Standard Arcane Magic Items as described later in the chapter entitled Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Arcane Magic Item", "Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Magic Bullet",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "You are able to strike more times with your arcane missile.",
    "featureBenDesc": "As a Full Round Action, when you use ‘Magic Bullet’, you may now create a number of projectiles equal to your Maximum Mental Ability die type roll. You may use all projectiles against one target, or split them up as you desire.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Magic Bullet", "Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Shield",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "Your Shield can defend against more damage.",
    "featureBenDesc": "Your Shield modifier to Ward is increased to 2d4+2. The effects of this binding lasts for 10 full rounds per Charge spent. In addition to Ward, a second shield is manifested. The second shield can be used to defend against a second opponent.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Shield", "Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Energy Ward",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "Your Shield can defend against more damage.",
    "featureBenDesc": "You can create a Binding to withstand significant amounts of Energy Damage. As a standard action, for the next 10 full rounds per Charge spent, you can withstand the first 2d6+8 points dealt by each separate attack that deals lethal damage from a Type of your choice. You may choose one of the following: Acid, Arcane, Electricity, Flame, Force, Frost, Shadow, or Sonic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Shield"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Energy Blast",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "Your Energy Blast becomes deadlier.",
    "featureBenDesc": "When using ‘Energy Blast’, your additional damage is increased by +1d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Magic Bullet", "Improved Shield"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Float",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Arcane Binding you may use arcane power to cause yourself or others to break the bonds of gravity.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy into a field of physical force that causes you or a creature that you touch to Float into the air or in water at no faster than a normal movement Speed in any direction for up to 10 full rounds per Charge spent. You can change direction at any time. A floating creature can float as high and as far as desired. As long as the binding is in effect, as a move action, you may spend an additional Charge to extend the duration by +10 full rounds.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Levitate", "Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Unwilling creatures are allowed a Spiritual Defense roll to negate the effects of this binding."
  },
  {
    "featureName": "Sore",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Advanced Binding you may use Arcane Energy to affect the actions of a nearby creature.",
    "featureBenDesc": "As a standard action, you may decrease your Charge value by one to bind Arcane Energy to cause a creature within 30’ of you to become encased in a field of Arcane Force that limits the target’s ability to function. If the creature fails at a Physical Defense roll against your Magic Attack roll, the creature will be effected for 4d4+4 rounds. While effected by this binding, the target can only take the equivalent of one move action each round, and will suffer 1d6 points of physical damage while doing so and suffer a -2d4+2 penalty to all rolls. If the target voluntarily remains immobile and takes no action, it suffers no damage. If the creature succeeds with its Defense roll, it still suffers 1d6 points of damage and a -5 penalty to all rolls until your next Turn.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Stiff", "Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Image",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Advanced Binding you may use Arcane Energy to create a good, temporary illusion.",
    "featureBenDesc": "If you concentrate and take no other action while using Improved Image, you may have your illusion interact with viewers as if you were interacting with them yourself. You may do this at any time during the duration of the effect.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Image", "Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved View",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Advanced Binding you may look into places hidden from your physical senses.",
    "featureBenDesc": "You may now use View for up to one hour per Charge spent to see into any place you have visited or to observe any creature that you have met as long as the person or place are within the your Realm. If you stop your View, you may re-enter it again within 1 full round without having to use another Charge. You may also exit View to refocus into a new location. As long as you do this within 1 full round then there is no additional Charge.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["View", "Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Go",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Arcane Binding you may transport yourself to another location.",
    "featureBenDesc": "As a full round action, you may create a special diagram and decrease your Charge value by one. If you enter this diagram, you may travel to a spot within 30’ of a non-warded location 1 mile x your Use Magic roll result. You may only transport yourself, any one bonded creature, and the items you can carry with this effect. Alternately, you may choose to transport yourself to a specifically created Arcane Diagram that you previously created (at a cost of 100gp) anywhere within the same Realm.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Go Together",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Arcane Binding you may transport yourself to another location.",
    "featureBenDesc": "You may spend additional Charges in order to take others with you while using Go. Passengers can be no more than one size category larger than yourself and cost one additional Charge each.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Go"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Conjure Ryde",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Advanced Binding, you conjure an Automaton to serve as a temporary personal mount.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a large, horse-like creature. The Ryde is a Large sized {[Automaton, Lesser] (Beast)} that appears to be a sturdy, simple featured horse. The Ryde has hairless, blue-gray skin the texture of clay and seems to be speckled with iridescent glitter.  The creature has a large conical head with small ears, large opalescent eyes, and a small, toothless mouth. A Ryde cannot attack or defend and only has 10 hit points. The Ryde appears equipped with simple riding equipment. The Ryde can communicate with you telepathically in short, concise sentences.  This mount can travel at up to 4 x your normal speed. The Ryde is intelligent enough to work with you and will even continue to journey while you sleep or read. As a part of the Binding, you must inscribe a special Diagram into a hand sized clay model of a horse that will become the Ryde.  After 8 hours, the Ryde fades leaving only the original lump of clay. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have more than one Ryde in existence at a time. You are only able to control a total number of conjured and summoned creatures equal to your maximum Spiritual Ability modifier die type result."
  },
  {
    "featureName": "Conjure Drudge",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Advanced Binding, you conjure an Automaton to serve as a temporary personal servant.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a short, man-like creature. The Drudge is a Medium sized {[Automaton, Lesser] (Humanoid)} that appears to be a thin, simple featured person about 4’ tall. The Drudge has hairless, blue-gray skin the texture of clay and seems to be speckled with iridescent glitter. The creature has a large head with no ears, large opalescent eyes, and a small, toothless mouth. Drudges cannot attack or defend and only have 10 hit points. The Drudge appears clothed in a simple gray tabard. The Drudge can communicate with you telepathically in short, concise sentences. You may give the Drudge a series of simple chores or tasks to complete. Drudges are often used to clean, carry, serve, set up camp, and other simple tasks. A Drudge cannot perform skilled tasks such as cooking, although it can be directed to stir a pot. As a part of the Binding, you must inscribe a special Diagram into a fist sized clay model of a person that will become the Drudge. After 8 hours, the Drudge fades leaving behind the original lump of clay.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have more than one Drudge in existence at a time. You are only able to control a total number of conjured and summoned creatures equal to your maximum Spiritual Ability modifier die type result."
  },
  {
    "featureName": "Conjure Fyx",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Advanced Binding, you conjure an Automaton that is able to complete complex tasks for you.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a short, man-like creature. The Fyx is a Medium sized {[Automaton, Lesser] (Humanoid)} that appears to be a thin, simple featured person about 5’ tall. The Fyx has hairless, blue-gray skin the texture of clay and seems to be speckled with iridescent glitter. The creature has a large head with no ears, large opalescent eyes, and a small, toothless mouth. Fyxes cannot attack or defend and only have 10 hit points. The Fyx appears clothed in a simple gray tabard. The Fyx can communicate with you telepathically in short, concise sentences. You may give the Fyx a single skilled task to complete. The Fyx will complete the task at a Skill Check roll equal to you Magic Use roll. You must provide all necessary tools, materials, and facilities to complete the assigned task. As a part of the Binding, you must inscribe a special Diagram into a fist sized clay model of a person that will become the Fyx.  Upon completing the assigned task, or after 8 hours, the Fyx will transform back into the original lump of clay.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Conjure Drudge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have more than one Fyx in existence at a time. You are only able to control a total number of conjured and summoned creatures equal to your maximum Spiritual Ability modifier die type result."
  },
  {
    "featureName": "Conjure Taynk",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Advanced Binding, you conjure an Automaton that is able to serve as a bodyguard.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a tall, man-like creature. The Taynk is a Medium sized {[Automaton, Lesser] (Humanoid)} that appears to be a muscular, simple featured person about 6’ tall. The Taynk has hairless, blue-gray skin the texture of stone and seems to be speckled with iridescent glitter. The creature has a large head with no ears, large opalescent eyes, and no mouth. A Taynk has 4 arms with shield-like growths on each forearm. Taynks have hit points equal to yours + 3d6. The Taynk appears clothed in a simple gray cured leather breastplate. The Taynk can communicate with you telepathically in short, concise sentences. The Taynk cannot attack, but will protect you or whoever you designate for up to 8 hours. Taynks protect by standing between you and your opponent. A Taynk’s Base Physical Ability is equal to your Mental Ability and it’s Armor bonus is equal to +3d6. It provides a maximum of 75% cover to you from designated opponents. This number can be divided as you see fit to protect you from up to 3 total opponents. For this to work, each opponent must be adjacent to at least one other such designated opponent. As a part of the Binding, you must inscribe a special Diagram into a fist sized piece of granite that will become the Taynk. Upon suffering a loss of Total Hit Points, or after 8 hours, the Taynk will transform back into the original rock.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Conjure Fyx"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have more than one Taynk in existence at a time. You are only able to control a total number of conjured and summoned creatures equal to your maximum Spiritual Ability modifier die type result."
  },
  {
    "featureName": "Conjure Blayde",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Advanced Binding, you conjure an Automaton that is able to serve as a warrior.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a tall, man-like creature. The Blayde is a Medium sized {[Automaton, Lesser] (Humanoid)} that appears to be a muscular, simple featured person about 6’ tall. The Blayde has hairless, blue-gray skin the texture of stone and seems to be speckled with iridescent glitter. The creature has a large head with no ears, large opalescent eyes, and no mouth. A Blayde has 2 arms with sword-like appendages for hands. Blaydes have hit points equal to yours + 3d6. The Blayde appears clothed in a simple gray cured leather breastplate. The Blayde can communicate with you telepathically in short, concise sentences. The Blayde can only defend itself, but will attack whoever you designate. A Blayde’s Base Physical Ability is equal to your Mental Ability and it’s Melee Attack modifier is +3d6. The Blayde’s sword hands each have a weapon bonus of +1d6. The Blayde can target up to 3 opponents for each Full round Attack action that it takes as long as the targets are adjacent to each other and within Reach. As a part of the Binding, you must inscribe a special Diagram into a fist sized piece of slate that will become the Blayde. Upon suffering a loss of Total Hit Points, or after 8 hours, the Blayde will transform back into the original rock.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Conjure Fyx"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have more than one Blayde in existence at a time. You are only able to control a total number of conjured and summoned creatures equal to your maximum Spiritual Ability modifier die type result."
  },
  {
    "featureName": "Summon Creature",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Advanced Binding, you can summon a creature from somewhere else.",
    "featureBenDesc": " As a full round action, this binding brings to you a Large or smaller sized creature that you specify.  In preparation for this binding, you must have chosen a special personal Glyph that represents you in some way. You must Mark the individual or you may inscribe this Glyph as your personal Mark onto an item that you give or attach to the designated creature. Alternately, you may have Bonded the creature as described earlier.  Certain effects may be used to block this binding. If the creature cannot reach you, it will return to its point of origin. This binding can be used on creatures of Large size and smaller only. It will not work on creatures native to other Realms. Summoned creatures will not automatically serve you and will automatically return to the point of origin after 1 full hour per Charge spent. Unwilling creatures are allowed a Spiritual Defense roll to negate the effect.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Conjure Drudge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Experienced Binder",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have sharpend your skills as a Binder.",
    "featureBenDesc": "Increase your Novice Binder bonus for Fundamental Binding check rolls to a d8. Increase your Binder bonus for Standard Binding check rolls to a d6. Gain a +1d4 to all Use Magic Check rolls when using an Advanced Binding.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Destroy Arcana", "Summon Creature"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Arcane Knowledge",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have mastered your knowledge of Arcane Lore. ",
    "featureBenDesc": "Your Arcane Knowledge check modifier die increases to d10.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Experienced Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Bind Arcana",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have mastered your skills as an Arcanist.",
    "featureBenDesc": "Through the use of certain Arcane Words and Gestures you can use Superior Arcane Bindings to bind Arcane Energy to physical matter in order to accomplish powerful Arcane effects. Your Base Magic Use/Attack modifier die increases to d10.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Superior Arcane Knowledge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Increase Charge",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have increased your hold over the power of Arcane energies.",
    "featureBenDesc": "Your Increased Charge Die type has changed to a d6 instead of a d4.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Usurp Arcana",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your control of Arcane Energy in an attempt to drain energy from another Arcanist.",
    "featureBenDesc": "As an Immediate action, you may spend one Charge and then make an opposed Use Magic roll against an Arcanist within 30’ of you who is attempting to manifest some type of Arcane Effect. If you succeed, the Effect is Disrupted and will not manifest. In addition, you drain and absorb Arcane energy from the Disrupted Arcanist effect to increase your Charge value by 1d4+1 and decrease your opponent’s Charge value by the same amount.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Arcane Magic Item",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Craft",
    "featureDesc": "You can create great items of Arcane Power.",
    "featureBenDesc": "You may create Major Arcane Magic Items as described later in the chapter entitled Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Arcane Magic Item", "Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Magic Bomb",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "You are able create an explosive blast of Arcane Energy.",
    "featureBenDesc": "You may decrease your Charge value to create a burst of Arcane Energy centered at any point you can see within 100’ of you. The burst deals damage equal to your Total Magic use roll to all things within a 15’ radius. Creatures within the burst may make a Physical Defense roll to save for half damage.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Magic Bullet", "Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Shield",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "Your Shield is stronger and can be extended to include others.",
    "featureBenDesc": "When used, your modifier to Ward is now +3d4+3. The effects of this binding last for 10 full rounds per Charge spent. You may now extend the coverage of your Shield fields to provide a +1d4+1 bonus and 10% cover to each ally standing adjacent to you.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Shield", "Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Energy Ward",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "You can create a Binding to withstand a great amount of Energy Damage.",
    "featureBenDesc": "As a standard action, for the next 10 full rounds per Charge spent, you can withstand the first 4d6+6 points dealt by each separate attack that deals lethal damage from Type of your choice. You may choose one of the following: Acid, Arcane, Electricity, Flame, Force, Frost, Shadow, or Sonic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Energy Ward", "Advanced Shield"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Energy Blast",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "Your Energy Blast becomes deadlier.",
    "featureBenDesc": "When using ‘Energy Blast’, your additional damage is increased by +1d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Energy Blast", "Magic Bomb", "Advanced Shield"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Soar",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Arcane Binding you may use arcane power to cause yourself or others to travel the sky.",
    "featureBenDesc": "As a standard action, you may decrease your Charge value by one to bind Arcane Energy into a field of physical force that causes you or a creature that you touch to Fly in the air or in the water at no faster than twice a normal movement Speed in any direction for up to 1 hour per Charge spent. As long as the binding is in effect, as a move action, you may spend an additional Charge to extend the duration by +1 hour.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Float", "Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If at any time during the effect the target becomes unconscious, the effect will immediately end causing the individual to float down until consciousness is regained or until the user is on the ground."
  },
  {
    "featureName": "Stopped",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Superior Binding you may use Arcane Energy to immobilize a nearby creature.",
    "featureBenDesc": " As a standard action, you may decrease your Charge value by one to cause a creature within 30’ of you to become encased in a field of Arcane Force that keeps the target from moving or acting. If the creature fails at a Physical Defense roll against your Magic Attack roll, the creature will be effected for 4d4+4 rounds per Charge spent. While effected by this binding, the target cannot take any action and is considered Prone. If the creature succeeds with its Defense roll, it still suffers a -10 penalty to all rolls until your next Turn.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sore", "Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Image",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Superior Binding you may use Arcane Energy and decrease your Charge value by one to create an excellent, temporary illusion.",
    "featureBenDesc": "The image takes on a life of its own and may interact with viewers as if it were real.  It looks, sounds, and feels like real.  A Superior Image will last for up to 1 full day per Charge spent. The image can be disbelieved with a successful Mental Defense roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Image", "Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced View",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Superior Binding you may look into places hidden from your physical senses.",
    "featureBenDesc": "You may now use View for up to one hour to see into any place or to observe any creature as long as the person or place are within the your Realm. You need never have seen or met the place or person targeted. A targeted creature is allowed a Mental Defense roll to perceive your View. If the creature succeeds, it can initiate an opposed Spiritual Ability roll against you in order to end the effect. If you stop your View, you may re-enter it again within 1 full round without having to use another Charge. You may also exit View to refocus into a new location. As long as you do this within 1 full round then there is no additional Charge.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved View", "Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Go Farther",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Arcane Binding you may transport yourself to a distant location.",
    "featureBenDesc": "When using ‘Go’ or ‘Go Together’, you may now travel to any spot you have seen or visited within your current Realm.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Go Together", "Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Summon Creature",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Superior Binding, you can summon a creature from somewhere else.",
    "featureBenDesc": " As a full round action, this binding brings to you a Large or smaller sized creature that you specify. You may decrease your Charge value by one to summon a generic Mortal creature of any type that you name, or a specifically Named creature that you know into a specially drawn Arcane Diagram within 30’ of you. A Summoned creature is allowed a Spiritual Defense check roll against your Use Magic Check to negate this binding. Creatures summoned by you are not required to follow any of your commands. You can attempt to pursuade or make a deal with the summoned creature so that it can stay for up to 1 hour in order to perform some requested task. If the creature stays longer than 1 hour, the binding is automatically released and the creature is returned to its point of origin. You can keep the creature with you by spending one additional charge per hour to maintain the binding. A creature whose current Hit Points is reduced to 0 while summoned by you will return to the point of origin within one full round if not healed before the end of that round. Any damage suffered by the summoned creature is real and not healed by the binding.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Summon Creature", "Superior Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Summon Outsider",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Superior Binding, you can decrease your Charge value by one to summon a Lesser creature from another Realm.",
    "featureBenDesc": "As a full round action, this binding brings to you a Large or smaller sized creature of any type that you specify. You may summon a generic creature of any type that you name, or a specifically Named creature that you know into a specially drawn Arcane Diagram/Trap within 30’ of you. Summoning creatures from other Realms is extremely dangerous. Summoned creatures will not automatically serve you and will automatically return to the point of origin after 1 full hour or until released. Named creatures are not allowed a Defense roll against this Binding, otherwise unwilling creatures are allowed a Spiritual Defense roll to negate the effect.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Summon Creature"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "As an additional requirement for this Feature, you must pay 500gp for the difficult to obtain arcane knowledge that allows one to call upon a denizen from another Realm. You only need to take this Feature once, but you must spend one additional TP and 500gp for each new Outsider(Lesser) type that you learn to Summon."
  },
  {
    "featureName": "Called by Name",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "You have discovered the True Name of an Outsider (Lesser).",
    "featureBenDesc": "You now know the True Name of a minor creature native to another Realm. By using this Name and the proper Summon Outsider Binding, the targeted creature will be unable to deny your call.  It is not allowed any Spiritual Defense against your summons. You gain a +3d6 bonus to all Magic Use/Attacks made against the Named Creature.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Summon Outsider"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "As an additional requirement for this Feature, you must pay 1000gp to account for the extensive research you did uncover this valuable piece of information. You only need to take this Feature once, but at any time you can spend an additional 1 T.P. and 1000gp to learn a new Name."
  },
  {
    "featureName": "Trap Outsider",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Superior Binding you may use Arcane Energy by decreasing your Charge value by one to create a temporary prison designed to hold a single type of creature from another Realm of existence.",
    "featureBenDesc": "If you spend 1 full round creating the trap, it has a 50% base chance of being stable. The probability of being stable increases by +5% for each additional round spent in its creation (up to 9 additional rounds – max. 95%). You can’t tell if it’s stable until it is used. An intended target will be able to break an unstable trap immediately. If the diagram is destroyed, smudged, or crossed it instantly becomes unstable and the creature inside will be free to leave or exact revenge. This Arcane Diagram will trap and imprison a predetermined Lesser type of extra-dimensional creature. If the creature enters a stable diagram by any means, it must succeed at a Spiritual Defense roll against your Magic Use roll. If the creature fails, it will be unable to leave the diagram for up to 1 hour. While imprisoned, the creature will be unable to touch or effect by magic anything outside of the diagram. If the creature beats your Magic Use roll, it is able to break your Arcane Matrix and remains free. Creatures trapped in this way may be bargained with or enchanted to perform some type of service for you, but beware the cost and the possibility of retribution. You may choose which outsider Trap diagram that you initially learn with this Feature. Each diagram is particular to a different kind of outsider, i.e. Infernal, Fae, Fire Elemental, Water Elemental, Demon, Celestial, etc.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Summon Outsider"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "As an additional requirement for this Feature, you must pay 100gp for the diagram that you learn. You only need to take this Feature once, but you must spend one additional TP and 100gp for each new diagram that you learn to trap a different kind of creature (Lesser)."
  },
  {
    "featureName": "Superior Binder",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You excel in your skills as a Binder.",
    "featureBenDesc": "Increase your Novice Binder bonus for Fundamental Binding check rolls to a d10. Increase your Binder bonus for Standard Binding check rolls to a d8. Increase your Experienced Binder bonus for Advanced Binding check rolls to a d6. Gain a +1d4 to all Use Magic Check rolls when using a Superior Binding.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Summon Creature"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Arcane Knowledge",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have mastered your knowledge of Arcane Lore. ",
    "featureBenDesc": "Your Arcane Knowledge check modifier die increases to d10.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Superior Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Bind Arcana",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "Your mastery of Arcane Binding is beyond the skills of most.",
    "featureBenDesc": "Through the use of certain Arcane Words and Gestures you can use Elite Arcane Bindings to bind Arcane Energy to physical matter in order to accomplish powerful Arcane effects. Your Base Magic Use/Attack modifier die increases to d12.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Superior Arcane Knowledge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Increase Charge",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You have mastered your hold over the power of Arcane energies.",
    "featureBenDesc": "Your Increased Charge Die type has changed to a d8 instead of a d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Deny Arcana",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You can use your control of Arcane Energy in an attempt to sever another Arcanist from the ability to Bind, as well as to seize his power as your own.",
    "featureBenDesc": "As an Immediate action, you may spend one Charge and then make an opposed Use Magic roll against an Arcanist within 30’. If you succeed, your target decreases her Charge value to 0 and will be unable to roll a new Charge value until she has had a Complete Rest. In addition, you may add all of the target’s lost Charges to your current Charge value.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Arcane Magic Item",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Craft",
    "featureDesc": "You can create items of incredible Arcane Power.",
    "featureBenDesc": "You may create Superior Arcane Magic Items as described later in the chapter entitled Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Arcane Magic Item", "Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Arcane Destruction",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "This Elite Binding creates an overwhelming blast of Arcane Energy.",
    "featureBenDesc": "You may create a burst of Arcane Energy centered at any point you can see within 100’ of you. Multiply a single roll of your Use Magic die type by 10 to deal Arcane Energy damage equal to the result to all things within a 15’ radius of your targeted point. All things within the burst radius may make a Physical Defense roll to save for ½ damage against the effect.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Magic Bomb", "Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Binding will cost 1d4+1 Charges."
  },
  {
    "featureName": "Superior Shield",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "Your Shield will block Arcane damage and can be extended to include others.",
    "featureBenDesc": "This Binding is an Elite version of Ward. When used, Ward is manifested and increased to provide a +10 Arcane bonus to all Defense rolls. The effects of this binding last for 10 full rounds. The Ward will now protect you from all Arcane Energy damage. In addition to Ward, a silvery blue field of translucent force is conjured. This force is the size of a small shield and will provide 50% Cover against any Melee or Ranged Attack from all opponents. You may now extend the coverage of this field to provide a +5 bonus and 25% cover to each ally standing adjacent to you.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Shield", "Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Binding will cost 1d4+1 Charges."
  },
  {
    "featureName": "Superior Energy Ward",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "You can create a Binding to withstand a huge amount of Energy Damage.",
    "featureBenDesc": "As a standard action, for the next 10 full rounds you can withstand the first 5d6+10 points dealt by each separate attack that deals lethal damage from Type of your choice. You may choose one of the following: Acid, Arcane, Electricity, Flame, Force, Frost, Shadow, or Sonic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Energy Ward", "Superior Shield"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Binding will cost 1d4+1 Charges."
  },
  {
    "featureName": "Superior Energy Blast",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "Your Energy Blast becomes most deadly.",
    "featureBenDesc": "When using ‘Energy Blast’, your additional damage is increased by an additional +1d6. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Energy Blast", "Arcane Destruction", "Superior Shield"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Binding will cost 1d4+1 Charges."
  },
  {
    "featureName": "Jet",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Arcane Binding you may use arcane power to cause yourself or others to shoot across great distances.",
    "featureBenDesc": "When using Soar, you or another may now travel through the air or water at up to 4 x a normal movement Speed in any direction for up to 1 hour. As long as the binding is in effect, as a Move action, you may spend an additional Charge to extend the duration by +1 hour. You will be unable to change direction easily while using this Binding. You will be required to make a Physical Ablility check roll against your normal Speed rate in order to make any turns. You cannot engage in combat or other activities while using this Binding.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Soar", "Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Binding will cost 1d4+1 Charges. If at any time during the effect the target becomes unconscious, the effect will immediately end causing the individual to plummet from the sky."
  },
  {
    "featureName": "Stoned",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Elite Binding you may use Arcane Energy to permanently immobilize a nearby creature.",
    "featureBenDesc": "As a standard action, you may bind Arcane Energy to cause a creature of Large size or smaller within 30’ of you to become encased in a field of Arcane Force that places the target into Stasis. Each use of this Binding will cost 1d4+1 Charges. If the creature fails at a Physical Defense roll against your Magic Attack roll, the creature will be permanently solidified into a statue-like object. If the creature succeeds with its Defense roll, it still suffers a -10 penalty to all rolls until your next Turn. While effected by this binding, the target can still see, hear, and think, but doesn’t require physical upkeep. No items may be removed from the effected target’s person. The target is immune to all damage. Unless the effect is removed by you or some other effect, the target will remain in stasis for one full day. At the end of one full day, the target is allowed another Defense roll. If the roll fails, the target will remain in Stasis until the end of the target’s natural lifespan at which it will change to ash and fall apart. You may still remove the effect at any time as a Free action. A successful disenchantment attempt of some sort will also remove the effect.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Stopped", "Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Binding will cost 1d4+1 Charges."
  },
  {
    "featureName": "Elite Image",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Elite Binding you may use Arcane Energy to create an excellent, long-lasting illusion.",
    "featureBenDesc": "You may create a Superior Image that now lasts until removed, or until your Death. ",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Superior Image", "Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Binding will cost 1d4+1 Charges. The image can be disbelieved with a successful Mental Defense roll."
  },
  {
    "featureName": "Superior View",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Elite Binding you may look into places on other Realms that are hidden from your physical senses.",
    "featureBenDesc": "You may now use View for up to one hour to see into any place or to observe any creature on another Realm as long as the person or place are known to you. A targeted creature is allowed a Mental Defense roll to perceive your View. If the creature succeeds, it can initiate an opposed Spiritual Ability roll against you in order to end the effect. If you stop your View, you may re-enter it again within 1 full round without having to use another Charge. You may also exit View to refocus into a new location. As long as you do this within 1 full round then there is no additional Charge.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced View", "Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Go Out",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Bindings",
    "featureDesc": "With this Arcane Binding you may transport yourself to another Realm of Existence.",
    "featureBenDesc": "If you spend 1d4+1 charge per traveler when using ‘Go’ or ‘Go Together’, you may now travel to any un-Warded spot you have seen or visited within another Realm.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Go Farther", "Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Conjure Drayke",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Superior Binding, you conjure an Automaton to serve as a temporary flying mount.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a huge, dragon-like creature. The Drayke is a Huge sized {[Automaton, Lesser] (Beast)} that appears to be a thin, simple featured dragon. The Drayke has hairless, blue-gray skin the texture of clay and seems to be speckled with iridescent glitter. The creature has a large reptilian head with no ears, large opalescent eyes, and a small, toothless mouth. Draykes cannot attack or defend and only have 20 hit points. The Drayke appears with simple riding equipment. The Drayke can communicate with you telepathically in short, concise sentences. This mount will carry up to 2 Medium sized passengers, and can fly at up to 6 x your normal Speed. The Drayke is intelligent enough to work with you and will even continue to journey while you sleep or read. As a part of the Binding, you must inscribe a special Diagram into a hand sized clay model of a dragon that will become the Drayke. After 8 hours, the Drayke fades leaving only the original lump of clay.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Conjure Ryde", "Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have more than one Drayke in existence at a time. You are only able to control a total number of conjured and summoned creatures equal to your maximum potential Spiritual Ability modifier die type roll at any one time."
  },
  {
    "featureName": "Conjure Whayle",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Elite Binding, you conjure an Automaton to serve as a temporary underwater mount.",
    "featureBenDesc": "As a full round action, you may decrease your Charge value by one to create a giant, leviathan. The Whayle is a Colossal sized {[Automaton, (Beast)} that appears to be a giant, simple featured whale. The Whayle has hairless, blue-gray skin the texture of clay and seems to be speckled with iridescent glitter. The creature has a large opalescent eyes, and a huge, toothless mouth. Whayles will not attack or defend and have 100 hit points. The Whayle can communicate with you telepathically in short, concise sentences. You and up to 5 others can travel inside the Whayle through the water and down into great depths. This mount can swim at up to 4 x your normal Speed. The Whayle is intelligent enough to work with you and will even continue to journey while you sleep or read. As a part of the Binding, you must inscribe a special Diagram into a 30’ diameter section of beach that will transform into the Whayle. After 8 hours, the Whayle dissolves into sand.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Conjure Drayke"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have no more than one Whayle in existence at a time. You are only able to control a total number of conjured and summoned creatures equal to your maximum potential Spiritual Ability modifier die type roll at any one time."
  },
  {
    "featureName": "Advanced Summon Creature",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Elite Binding, you can summon any creature from another place within your current Realm.",
    "featureBenDesc": "As a full round action, this binding brings to you any sized creature of any type that you specify. You may summon a generic creature native to your current Realm of any type that you name, or a specifically Named creature that you know into a specially drawn Arcane Diagram within 30’ of you. Summoned creatures may automatically serve you if you succeed at an opposed Spiritual ability check. Summoned creatures will automatically return to the point of origin after 1 full hour. Creatures are not allowed a Defense roll to negate your summons.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Summon Creature", "Elite Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Binding will cost 1d4+1 Charges. This binding can only work if you and the creature are in the same Realm."
  },
  {
    "featureName": "Improved Summon Outsider",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Elite Binding, you can summon a Standard creature from another Realm.",
    "featureBenDesc": "As a full round action, this binding brings to you a Huge or smaller sized creature of any type that you specify. You may summon a generic creature of any type that you name, or a specifically Named creature that you know into a specially drawn Arcane Diagram/Trap within 30’ of you. Summoning creatures from other Realms is extremely dangerous. Summoned creatures will not automatically serve you and will automatically return to the point of origin after 1 full hour or until released. Named creatures are not allowed a Defense roll against this Binding, otherwise unwilling creatures are allowed a Spiritual Defense roll to negate the effect.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Go Out", "Advanced Summon Creature"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Binding will cost 1d4+1 Charges. As an additional requirement for this Feature, you must pay 1000gp for the difficult to obtain arcane knowledge that allows one to call upon these more powerful denizens of the other Realms. You only need to take this Feature once, but you must spend two additional TP and 1000gp for each new Outsider(Standard) type that you learn to Summon."
  },
  {
    "featureName": "Improved Called by Name",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "You have discovered the True Name of an Outsider (Standard).",
    "featureBenDesc": "You now know the True Name of a powerful creature native to another Realm. By using this Name and the proper Summon Outsider Binding, the targeted creature will be unable to deny your call. It is not allowed any Spiritual Defense against your summons. You gain a +10 bonus to all Magic Use/Attacks made against the Named Creature. Summoning creatures from other Realms is extremely dangerous. Summoned creatures will not automatically serve you and will automatically return to the point of origin after 1 full hour or until released.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Summon Outsider"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "As an additional requirement for this Feature, you must pay 2000gp to account for the extensive research you did uncover this valuable piece of information. You only need to take this Feature once, but at any time you can spend an additional 1 T.P. and 2000gp to learn a new Name."
  },
  {
    "featureName": "Improved Trap Outsider",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Conjure",
    "featureDesc": "With this Elite Binding you may use Arcane Energy to create a temporary prison designed to hold a single type of creature from another Realm of existence.",
    "featureBenDesc": "If you spend 1 full round creating the trap, it has a 30% base chance of being stable. The probability of being stable increases by +5% for each additional round spent in its creation (up to 9 additional rounds – max. 75%). You can’t tell if it’s stable until it is used. An intended target will be able to break an unstable trap immediately. If the diagram is destroyed, smudged, or crossed it instantly becomes unstable and the creature inside will be free to leave or exact revenge. This Arcane Diagram will trap and imprison a predetermined Standard type of extra-dimensional creature. If the creature enters a stable diagram by any means, it must succeed at a Spiritual Defense roll against your Magic Use roll. If the creature fails, it will be unable to leave the diagram for up to 1 hour. While imprisoned, the creature will be unable to touch or effect by magic anything outside of the diagram. If the creature beats your Magic Use roll, it is able to break your Arcane Matrix and remains free. Creatures trapped in this way may be bargained with or enchanted to perform some type of service for you, but beware the cost and the possibility of retribution. Each diagram is particular to a different kind of outsider, i.e. Infernal, Fae, Fire Elemental, Water Elemental, Demon, Celestial, etc.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Summon Outsider"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "Each use of this Binding will cost 1d4+1 Charges. As an additional requirement for this Feature, you must pay 500gp for each individual diagram that you learn. You only need to take this Feature once, but you must spend two additional TP and 500gp for each new diagram that you learn to trap a different kind of creature (Standard)."
  },
  {
    "featureName": "Elite Binder",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You are one of the greatest Binders of your generation.",
    "featureBenDesc": "Increase your Novice Binder bonus for Fundamental Binding check rolls to a d12. Increase your Binder bonus for Standard Binding check rolls to a d10. Increase your Experienced Binder bonus for Advanced Binding check rolls to a d8. Increase your Superior Binder bonus for Superior Binding check rolls to a d6. Gain a +1d4 to all Use Magic Check rolls when using an Elite Binding.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Summon Creature"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Arcane Knowledge",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "Your knowledge of Arcane Lore is supreme. ",
    "featureBenDesc": "Your Arcane Knowledge check modifier die increases to d12.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Elite Binder"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Increase Charge",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "Your mastery over the power of Arcane energies is supreme.",
    "featureBenDesc": "Your Increased Charge Die type has changed to a d10 instead of a d8.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Elite Arcane Knowledge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Supreme Arcanist",
    "featureCost": 6,
    "featureClass": "Arcanist",
    "featurePath": "General",
    "featurePathTree": "Arcanist",
    "featureDesc": "You are one of the greatest Arcanists of all time.",
    "featureBenDesc": "Your Increased Charge Die type has changed to a d12 instead of a d10. Your Use Magic Check result for Fundamental Bindings is now always considered to be the maximum result and does not need to be rolled. Increase your Binder bonus for Standard Binding check rolls to a d12. Increase your Experienced Binder bonus for Advanced Binding check rolls to a d10. Increase your Superior Binder bonus for Superior Binding check rolls to a d8. Increase your Binder bonus for Standard Binding check rolls to a d12. Increase your Elite Binder bonus for Elite Binding check rolls to a d6. Your Increased Charge Die type has changed to a d12 instead of a d10. Your Modifier and Ticker values are all increased by +1d6",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Superior Arcane Magic Item", "Superior Energy Ward", "Superior Energy Blast", "Jet", "Stoned", "Elite Image", "Superior View", "Improved Summon Outsider", "Elite Increased Charge"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  }


]