{
  "races": [{
      "race": {
        "id": "dwarf",
        "raceName": "Dur",
        "raceDesc": "The Dur (or Dwarves as humans call them) are probably the oldest race still openly active in the world today.  The Dur and their culture have had some degree of impact on every culture in existence at this time.  The Dur are a race of dedicated, hardworking, hard fighting, and hard drinking, craftsmen without equal.  On the average, dwarves tend to be short and stocky with short legs but clever fingers.  They have broad, heavy features with rounded ears, lots of hair, and large noses.  Dwarves are tough and strong with a near legendary ability to withstand much physical strain.  Dwarves have a well-deserved reputation for being short tempered, suspicious, and thirsty; but they also form intensely loyal friendships with those they like.",
        "fullBlood": {
          "fbDesc": "A Character with two Dwarven parents gains +5 to Total Hit Points.",
          "fbBonus": {
            "fbHasBonus": true,
            "fbBonusType": "hp",
            "fbBonusAmount": 5
          }
        },
        "raceSpecial": {
          "specialDesc": "Characters of Dwarven Heritage gain the ability to always knodirection.",
          "specialAb": "know direction"
        },
        "traits": {
          "size": "m",
          "speed": 20,
          "avgHeight": 45,
          "avgWeight": 230,
          "avgLifespan": 350
        },
        "maternal": {
                "maternalDesc": "Your natural mother was Dur.",
                "maternalName": "Anvil Born",
                "maternalAb": "spiritual",
                "maternalAbBonus": 1
        },
        "paternal": {
                "paternalDesc": "Your natural father was Dur.",
                "paternalName": "Anvil Sired",
                "paternalAb": "physical",
                "paternalAbBonus": 1
        }
      }
    },
    {
      "race": {
        "id": "elf",
        "raceName": "N'Athi",
        "raceDesc": "The N'Athi (called elves by most humans) are thought to be one of the oldest races found in the world.  Certainly, most of their cultural traditions have survived for many thousands of years.  As with humans, there are several different elven racial types.  Certain physiological features are typical of all elves.  All elves tend to be slender with fine, almost delicate features and long, dexterous fingers.  Elven eyes are always large, slanted, and almond shaped.  Their ears are larger and sharply pointed.  All elves have excellent senses.  All elves are observant and have analytical minds.  As a result, most elves are thoughtful and opposed to action without comprehensive thought and planning.  Elves are prone to empathy and share a minor type of mystic bond with other members of their family and, to some extent, other elves.  As a result, Elves can share deep emotions and feelings with members of their families.  They know, vaguely, the direction in which any family member is located at any given time and have a general impression of that member’s well-being.  Elves gain a +2 bonus to all ‘Social Skills’ roll results that involve other Elves.",
        "fullBlood": {
          "fbDesc": "A Character with two Elven parents gains a +4 racial bonus to Physical Perception checks.",
          "fbBonus": {
            "fbHasBonus": true,
            "fbBonusType": "perception",
            "fbBonusAmount": 4
          }
        },
        "raceSpecial": {
          "specialDesc": "Characters with Elven Heritage gain the ability to rest without having to sleep.",
          "specialAb": "reverie"
        },
        "traits": {
          "size": "m",
          "speed": 30,
          "avgHeight": 56,
          "avgWeight": 105,
          "avgLifespan": 500
        },
        "maternal": {
                "maternalDesc": "Your natural mother was N'Athi.",
                "maternalName": "Fae Born",
                "maternalAb": "spiritual",
                "maternalAbBonus": 1
        },
        "paternal": {
                "paternalDesc": "Your natural father was N'Athi.",
                "paternalName": "Fae Sired",
                "paternalAb": "physical",
                "paternalAbBonus": 1
        }
      }
    },
    {
      "race": {
        "id": "gnome",
        "raceName": "Gnomentaug",
        "raceDesc": "Gnometaug (referred to by most as Gnomes) are a strange race of small, intelligent people. They have keen minds and skilled hands. Gnomes are friendly and forgiving, but they are easily excitable. Most Gnomes prefer bright colors and interesting hairstyles.",
        "fullBlood": {
          "fbDesc": "A Character with two Gnomish parents gains a +4 bonus to Mental Defense roll results.",
          "fbBonus": {
            "fbHasBonus": true,
            "fbBonusType": "Mental Defense",
            "fbBonusAmount": 4
          }
        },
        "raceSpecial": {
          "specialDesc": "Characters with Gnomish Heritage gain the ability to take two Standard Actions as one Full Round Action once per encounter",
          "specialAb": "multi-task"
        },
        "traits": {
          "size": "s",
          "speed": 20,
          "avgHeight": 25,
          "avgWeight": 50,
          "avgLifespan": 250
        },
        "maternal": {
                "maternalDesc": "Your natural mother was a Lowlander Gnome.",
                "maternalName": "Genius Born",
                "maternalAb": "mental",
                "maternalAbBonus": 1
        },
        "paternal": {
                "paternalDesc": "Your natural father was Lowlander Gnome.",
                "paternalName": "Genius Sired",
                "paternalAb": "mental",
                "paternalAbBonus": 1
        }
    }
  },
  {
    "race": {
      "id": "halfmen",
      "raceName": "Gor",
      "raceDesc": "Halfmen, or Gor as twould rather be called, are a raceshort, cheerful creatures that appearlook almost like human children.  All are family and community oriented.  Arace, they are mostly friendly, helpfand talkative. Halflings display a strtrait of naïve optimism. Seemincontrary to their somewhat childlnature, Gor can be intensely serious dedicated when necessary. They arpleasant race with deep reserves of qustrength and determination. They hfeatures very similar to humans excfor slightly pointed ears and lartough-soled feet.",
      "fullBlood": {
        "fbDesc": "A Character with Halfling parents gains a +4 bonusPhysical Defense roll results.",
        "fbBonus": {
          "fbHasBonus": true,
          "fbBonusType": "Physical Defense",
          "fbBonusAmount": 4
        }
      },
      "raceSpecial": {
        "specialDesc": "Characters wHalfling Heritage gain the abilitycommunicate with rodents.",
        "specialAb": "squirrel speak"
      },
      "traits": {
        "size": "s",
        "speed": 20,
        "avgHeight": 36,
        "avgWeight": 80,
        "avgLifespan": 100
      },
      "maternal": {
        "maternalDesc": "Your natural mother was Hammid.",
        "maternalName": "Hearth Born",
        "maternalAb": "physical",
        "maternalAbBonus": 1
      },
      "paternal": {
        "paternalDesc": "Your nafather was Hammid.",
        "paternalName": "Hearth Sired",
        "paternalAb": "spiritual",
        "paternalAbBonus": 1
      }
    }
  },
  {
    "race": {
      "id": "human",
      "raceName": "Human",
      "raceDesc": "In general, humans are most dominant race throughout the worThey are considered to be one of youngest of the races. Humans have largest diversity of genotype, cultuand personal attitude than any of other races. Humans are considered higadaptable and frustratinunpredictable. They may have shorlifespans, but they learn quickly. Ind they are the most versatile potentially the most powerful choice aBasic Race.",
      "fullBlood": {
        "fbDesc": "A Character with two Huparents gains +2 Training Points.",
        "fbBonus": {
          "fbHasBonus": true,
          "fbBonusType": "training points",
          "fbBonusAmount": 2
        }
      },
      "raceSpecial": {
        "specialDesc": "Characters with HuHeritage gain +2 Training Points.",
        "specialAb": "fast learner"
      },
      "traits": {
        "size": "m",
        "speed": 30,
        "avgHeight": 65,
        "avgWeight": 150,
        "avgLifespan": 65
      },
      "maternal": {
        "maternalDesc": "Your nmother was Ellish.",
        "maternalName": "Noble Born",
        "maternalAb": "spiritual",
        "maternalAbBonus": 1
      },
      "paternal": {
        "paternalDesc": "Your nfather was Ellish.",
        "paternalName": "Noble Sired",
        "paternalAb": "physical",
        "paternalAbBonus": 1
      }
    }
  }
  ]
}