  [{
      "cultureId": "Ang",
      "cultureTitle": "Ang",
      "culturePrereq": "Human",
      "cultureDesc": "The Ang were once the proud rulers of central Nas’Arial.  Their culture reaches back to the second Fithian Empire.  They inherited the power of that empire.  Ang Sorcerer Kings dominated life in much of Nas’Arial for centuries until their final defeat at the end of the Mage Wars.  The Ang people of Jetta Doure are the remnants of those who followed the rule of Kourren the Corrupted.  Many of those who survived the Mage Wars were rounded up and forced into controlled communities located throughout the scar lands of Jetta Doure.  Under Ellid Law, magic using Ang are hunted down and executed.  The modern Ang have no real political structure.  Some are allowed to leave the camps and find opportunities in the civilized towns of settled Jetta Doure.  Their cultural hatred for the Ellid Empire and its High Holy Orders is a living, palpable thing.  Most Ang long for the day when Ellida Imperia is ground to dust as the Ang ascend to their rightful place as the true rulers of Nas’Arial.",
      "cultureLook": "Ang tend to be of average size with fair skin, sharp features, jet black hair, black nails and dark eyes.",
      "cultureFaction": "Ang of Jetta Doure",
      "cultureFactionRel": "accepted",
      "cultureLang": "Anglosar",
      "addLang": [
        "Nammash", "Ellic", "Kellish", "Kellagash", "Kalfar", "Flamespeak", "Gobnarse"
      ],
      "cultureBenDesc": "Ang Heritage characters automatically gain a +1 bonus to all Mental Ability Check rolls",
      "cultureBenType": "mental",
      "cultureBenNum": 1,
      "cultureNote": "Ang heritage characters gain a +4 bonus to all Strategy Skill skill check rolls."
    },
    {
      "cultureId": "Ara",
      "cultureTitle": "Ara'N'Athi Heritage",
      "culturePrereq": "N'Athi",
      "cultureDesc": "The Ara N’Athi elves, or “high elves”, have inhabited small communities throughout Nas’Arial since the end of the second Gods’ War.  Some claim that the Ara are haughty and treat other races like children.  The Ara would claim that they are burdened with the wisdom of long lives.  They see the other races as equal, but perpetually unaware of the larger picture.  Their enclaves are often within the communities of other nations.  The few small communities that exist individually are led by a council of noble elder mages.  Religion is not a strong or cohesive factor in Ara culture.  Many Ara have taken up with various religious orders, but no one faith seems to have any strong cultural hold.",
      "cultureLook": "The Ara'N'Athi are taller than average with pale complexions. Their hair is blonde, reddish blonde, or light brown. They have almond shaped eyes of blue, violet, or grey.",
      "cultureFaction": "Ara'N'Athi Concordance",
      "cultureFactionRel": "accepted",
      "cultureLang": "Alnaranir",
      "addLang": [
        "Alsylnir", "Ellic", "Marrin", "Kellagash", "Kellish", "Kalfar", "Monaric", "Nammash", "Gobnarse", "Gnomish", "Durric", "Akric"
      ],
      "cultureBenDesc": "Ara'N'Athi characters are trained to sense arcane magic. All Ara'N'Athi characters gain the Sense Arcana Feature as a Cultural Ability.",
      "cultureBenType": "feature",
      "cultureBenNum": 0,
      "cultureNote": "All Ara’N’Athi Heritage characters gain a +2 cultural bonus to all Arcanist Skills skill check rolls."
    },
    {
      "cultureId": "Ardur",
      "cultureTitle": "Ardurran Heritage",
      "culturePrereq": "Dur",
      "cultureDesc": "The Ardur are the descendants of those Dur who decided to make a life above the “blessed stones”.  The Ardur have lived and participated in the societies of Nas’Arial for thousands of years.  They value honesty and hard work.  They are a strong cultural unit, but they mingle freely with the other civilized races.  Their craftsmen are a valued commodity throughout the Ellid Empire.  They are loyal to regional rule, but still listen to their own Durthanes and still pay homage to the King of Bargendelph.  Most Ardur participate in the traditional Dur worship of the “Four”, but some have converted to the various High Holy Orders of the Ellid faith.",
      "cultureLook": "Ardur tend to have brown or red colored hair, light brown skin, and brown or green colored eyes. They are generally a little taller than their Radurran cousins.",
      "cultureFaction": "Clans of the Ardur",
      "cultureFactionRel": "accepted",
      "cultureLang": "Durric",
      "addLang": [
        "Stonespeak", "Kellish", "Nammash", "Kellagash", "Uroggar", "Gnomish", "Gobnarse"
      ],
      "cultureBenDesc": "The Ardur have access to greater wealth due to their long history as talented merchants and craftsmen. Ardur characters gain +4 to their starting Wealth roll result.",
      "cultureBenType": "wealth",
      "cultureBenNum": 4,
      "cultureNote": "All Ardurran Heritage characters gain a +4 cultural bonus to all Craft skill check rolls."
    },
    {
      "cultureId": "Blood",
      "cultureTitle": "Blood Orc Tribe",
      "culturePrereq": "Orc",
      "cultureDesc": "Blood Orc culture is based on hunting and the “might makes right” mentality.  They thrill to the scents of blood and fear. They live in small semi-nomadic groups ruled over by the biggest, meanest, and strongest warrior. They give worship to whatever cruel power their tribal Shamans might dictate. Even though the live in tribal hunting bands. The tribes all pay homage to the Orcish Blood Lord and his Council of Blood.",
      "cultureLook": "Blood Orcs stand 6 to 7 feet tall with ruddy,brown skin and bristly, black hair.  Their eyes are often bright yellow.",
      "cultureFaction": "Council of Blood",
      "cultureFactionRel": "accepted",
      "cultureLang": "Uroggar",
      "addLang": [
        "Durric", "Gobnarse", "Nammash", "Kellish"
      ],
      "cultureBenDesc": "The Blood Orcs live harsh lives of intense physical activity.  Blood Orc characters gain a +1 bonus to all Physical ability check roll results.",
      "cultureBenType": "physical",
      "cultureBenNum": 1,
      "cultureNote": "All Blood Orc characters gain a +6 cultural bonus to all Nature Lore skill check rolls for Survival."
    },
    {
      "cultureId": "Ellid",
      "cultureTitle": "Ellid Heritage",
      "culturePrereq": "Human",
      "cultureDesc": "Ellid cultural history reaches back for thousands of years to the ancient lands of Loria.  Ellid society is organized around the militaristic feudal system of economy and governance.  Ellid citizens recognize the Ellid Emperor as the true and rightful ruler of Nas’Arial.  Those of Ellid heritage hold faith in the High Holy Orders of the Ellid Pantheon.  The Imperial Sects of Solaris, Kem, Iost, Tira, and others are the true Ellid guides for moral order.",
      "cultureLook": "The El are tall with blonde or blondish hair, fair skin, and light colored eyes.",
      "cultureFaction": "Ellid Empire",
      "cultureFactionRel": "accepted",
      "cultureLang": "Ellic",
      "addLang": [
        "Kellish", "Lorric", "Nammash", "Kellagash", "Marrin"
      ],
      "cultureBenDesc": "Citizens of true Ellid Heritage live at the pinicle of Ellish society. They often have access to greater wealth and social status. As such, Ellid characters gain a +4 bonus to their starting Social Status roll result.",
      "cultureBenType": "social",
      "cultureBenNum": 4,
      "cultureNote": "Ellid characters gain a +2 cultural bonus to all Sacred Skills skill check rolls."
    },
    {
      "cultureId": "Frontier",
      "cultureTitle": "Frontier Heritage",
      "culturePrereq": "any",
      "cultureDesc": "Those raised outside of society often don’t have the same cultural training and unity of those who are part of a larger community.  One raised on the frontiers of civilization is taught to survive in the wilds.  Frontier communities are usually quite small, often only a single family group.  Life is a daily struggle for many of these people.  Nature is the greatest influence on a child growing up in such a situation.  There is no particular political structure in most of these communities.  There may be any kind of religious belief found in such places, but there is also a constant and healthy respect for the omnipresent natural forces.",
      "cultureLook": "Those who live on the Frontiers can be of any race and appearance.",
      "cultureFaction": "none",
      "cultureFactionRel": "none",
      "cultureLang": "any",
      "addLang": [
        "any"
      ],
      "cultureBenDesc": "Those raised on the edge of society often learn to become independent and self-sufficient. Such characters gain +2 Trainin Points",
      "cultureBenType": "training",
      "cultureBenNum": 2,
      "cultureNote": "Frontier Heritage characters gain a +4 cultural bonus to all Nature Lore skill check rolls."
    },
    {
      "cultureId": "Giet",
      "cultureTitle": "Giet’tan Heritage",
      "culturePrereq": "Human",
      "cultureDesc": "The Giet’Tan have lived on the grassy plains of southern Nas’Arial for a long age.  Originally a nomadic herding culture, the settled ‘Getts’ continue to value their herds and still make journeys to their ancient sacred sites.  They feel tied to the sacred lands of their birth.  Their communities are headed by the clan elders.  They may recognize imposed overlords, but do not care about the workings of politics outside of their small villages and tent communities.  They are earnest farmers and great lovers of the land.  They worship in an agriculturally based Nosic way.  They also follow a form of Ancestor worship referred to as Giet’Se.",
      "cultureLook": "the Giets are long and lean with tan skin, dark brown hair, and dark eyes.",
      "cultureFaction": "Tribes of Giet'Tan",
      "cultureFactionRel": "accepted",
      "cultureLang": "Giet'Aran'",
      "addLang": [
        "Nammash", "Alsylnir", "Kellish", "Uroggar"
      ],
      "cultureBenDesc": "People of Giet'tan heritage spend long hours traveling the grasslands. As a matter of course, they are in good physical condition and gain a +1 bonus to all Physical ability based check rolls.",
      "cultureBenType": "physical",
      "cultureBenNum": 1,
      "cultureNote": "Geit'Tan characters gain a +2 cultural bonus to all Nature Lore skill check rolls."
    },
    {
      "cultureId": "Gnomish",
      "cultureTitle": "Gnomish Heritage",
      "culturePrereq": "Gnomentaug",
      "cultureDesc": "The Gnomes have fit into every civilized society of Nas’Arial, yet have maintained their cultural identity.  Gnomes teach the value of scholarship and research.  Gnome sages seek to advance the limits of knowledge while gnome engineers stretch the bounds of technological possibility.  Gnomes believe in debate and enlightened cooperation.  They aren’t very competitive.  When it comes to personal business, they have a “live and let live” philosophy.  Gnome communities and enclaves are administered by elected bureaucrats who oversee the mounds of paperwork generated by their small bureaucracies.  If they have a faith, gnomes tend to favor gods of knowledge or craft.",
      "cultureLook": "Gnomes are quite small, only 2 to 3 feet tall, with gnarled features and bright, intelligent eyes.",
      "cultureFaction": "Gnomish Academy of Arcane Sciences and Engineering",
      "cultureFactionRel": "accepted",
      "cultureLang": "Gnomish",
      "addLang": [
        "any"
      ],
      "cultureBenDesc": "Gnomes are industrious and curious folk. Characters of Gnomish heritage gain +2 Training Points at character creation.",
      "cultureBenType": "training",
      "cultureBenNum": 2,
      "cultureNote": "Gnomish heritage characters gain a +4 cultural bonus to all Building Lore and Mechanical Lore skill check rolls."
    },
    {
      "cultureId": "Hammid",
      "cultureTitle": "Hammid Farmer",
      "culturePrereq": "Gor",
      "cultureDesc": "The Hammids, or settled Gor, live an ideal country life.  They have privacy and social community.  They work hard, but have plenty of leisure time for gentle pursuits.  They are friendly, but not overly demonstrative.  They are great hosts, and excellent cooks.  All Hammish people love food and every aspect of its production, preparation, and consumption.  Hammid communities are run by town hall meetings administrated by a locally elected village alderman.  A majority of the Hammids are devoted to the goddess Tira.  Most follow the Imperial sect of the High Holy Order of Tira.",
      "cultureLook": "Hammid characters tend to have curly hair that ranges in color from deep brown through dull red into dark blonde. Their eyes are just about any regular color. They have tan colored skin and a paunchy build.",
      "cultureFaction": "United Hammid Council",
      "cultureFactionRel": "accepted",
      "cultureLang": "Nammash",
      "addLang": [
        "Durric", "AlSylnir", "Kellish", "Uroggar", "Kellagash", "Giet'Aran"
      ],
      "cultureBenDesc": "Hammish communities are strongly cooperative and family oriented.  Characters with this heritage gain +1 to Spiritual Ability based check rolls.",
      "cultureBenType": "spiritual",
      "cultureBenNum": 1,
      "cultureNote": "Hammish gain a +4 cultural bonus to all Animal Lore and Herbal Lore skill check rolls."
    },
    {
      "cultureId": "Metro",
      "cultureTitle": "Metropolitan",
      "culturePrereq": "any",
      "cultureDesc": "Life within the grand Imperial cities, especially the Capitol, has developed its own culture.  Metropolitans care little for what goes on beyond the walls of their civic world.  Theirs is a culture of commerce and politics, crime and corruption.  The city may be ruled by a Noble Lord, but districts and enclaves are ruled by councilors, guild masters, and crime lords.  Most metropolitans give homage to the High Holy Orders, but many cults, sects, and religions may be found in an Imperial Metropolis.",
      "cultureLook": "Characters living in an Imperial Metropolis can be of any race and appearance.",
      "cultureFaction": "Ellid Empire",
      "cultureFactionRel": "accepted",
      "cultureLang": "Kellish",
      "addLang": [
        "any"
      ],
      "cultureBenDesc": "Residents of the great Ellid cities have to deal with the desires and schemes of many other people each day in order to survive.  As a consequence, they learn to be a little more cunning and gain a +1 bonus to all Mental ability based check rolls.",
      "cultureBenType": "mental",
      "cultureBenNum": 1,
      "cultureNote": "Metropolitan characters gain a +2 cultural bonus to all Social Skill check rolls."
    },
    {
      "cultureId": "Nammagh",
      "cultureTitle": "Nammagh Citizen",
      "culturePrereq": "any",
      "cultureDesc": "The City State of Nammagh is the oldest of the modern style metropolises of Nas’Arial.  Nammagh was founded over 2,500 years ago.  It is the oldest common free market.  It was originally settled by Dur who wanted a safe place to barter for Nam.  The city still carries its Dwarvish character, but is truly a cosmopolitan metropolis.  Nammagh is the birthplace of modern wizardry in Nas’Arial.  The first college dedicated to the Arcane Arts and Sciences was founded in Nammagh by Borgryn “Dursyl” Redhelm over 1,000 years ago.  The citizens of Nammagh live under the rule of Peace.  Anyone who sheds even a drop of another’s blood is doomed to be executed.  This law has kept the peace for most all of Nammagh’s history.  Although the High Holy Orders have a large presence in modern Nammagh, representatives from just about every known faith or sect can be found there.",
      "cultureLook": "Citizens of Nammagh can be of any racial background and appearance.",
      "cultureFaction": "City of Nammagh",
      "cultureFactionRel": "accepted",
      "cultureLang": "Nammash",
      "addLang": [
        "any"
      ],
      "cultureBenDesc": "Nammagh is a wealthy center of trade and its citizens have greater wealth and a higher standard of living. As such, all Nammagh citizen characters gain a +4 bonus to their starting Wealth roll result.",
      "cultureBenType": "wealth",
      "cultureBenNum": 4,
      "cultureNote": "Nammash characters gain a +2 cultural bonus to all Academic Skills skill check rolls."
    },
    {
      "cultureId": "Kalfan",
      "cultureTitle": "Kalfan Islander",
      "culturePrereq": "Human",
      "cultureDesc": "Kalfan culture is based on sea travel and trade.  Kalfan people value adventure and wealth.  They are always looking for something new to see and sell.  The Kalfan homeland is the Golden Isles far off the southeastern coast of Nas’Arial.  Kalfan communities exist as independent city states ruled by various Merchant Clans.  The major population of Kalfs living in Nas’Arial is based on the Island of Gratte.  The Island of Gratte, by treaty, is under Imperial Rule but run by a powerful Kalfan Merchant Clan.  The Kalfs follow their own cultural sects of Mael, Nixtia, and Heshlah.",
      "cultureLook": "Kalfs are short with an average build and broad features. They have deep ebony colored skin with fine, curly reddish brown hair and deep green eyes.",
      "cultureFaction": "Mercantile Principalities of Kal",
      "cultureFactionRel": "accepted",
      "cultureLang": "Kalfar",
      "addLang": [
        "any"
      ],
      "cultureBenDesc": "The Kalfan people love music, math, astronomy, and games that involve complex strategies.  As a result, Kalfan characters gain a +2 bonus to all Mental ability based check rolls.",
      "cultureBenType": "mental",
      "cultureBenNum": 1,
      "cultureNote": "All Kalfan characters gain a +4 cultural bonus to all Appraise Value and Navigation skill check rolls."
    },
    {
      "cultureId": "Kellag",
      "cultureTitle": "Kellag Heritage",
      "culturePrereq": "Human",
      "cultureDesc": "Kellag culture dominated Northeastern Nas’Arial for hundreds of years before the coming of the Ellid Kings.  Kellag society is based on a caste system of the two Kell peoples, a system of Kellag rule and Kellash service.  Long ago, the Kellag rulers bent the knee to Ellid Nobles.  Since then, the Kellag Thanes have been absorbed into the system as part of the Ellid Noble Structure.  Most Kellag people recognize the King of El as the true and rightful ruler of Nas’Arial and give offerings to the Ellid gods while still recognizing the Old Ways.  As important as religion might seem to others, the thrill of a life well lived is at the heart of Kellag Culture.  Hunting, Feasting, and Combat:  these are the mainstays of Kellag life.",
      "cultureLook": "Kellags are broad and strong. They have ruddy, freckled skin with thick, curly black hair and dark eyes.",
      "cultureFaction": "Thanes of Kell",
      "cultureFactionRel": "accepted",
      "cultureLang": "Kellagash",
      "addLang": [
        "Kellish", "Ellic", "Nammash", "Marrin", "Owvanic"
      ],
      "cultureBenDesc": "Kellag people live an active life filled with physical pursuits.  As such, Kellag characters gain a +1 bonus to all Physical ability based check rolls.",
      "cultureBenType": "physical",
      "cultureBenNum": 1,
      "cultureNote": "Kellag characters gain a +2 cultural bonus to all Combat Skills skill check rolls."
    },
    {
      "cultureId": "Kellash",
      "cultureTitle": "Kellash Heritage",
      "culturePrereq": "Human",
      "cultureDesc": "The Kellash are part of the caste system of the two Kellish races, a system of Kellag rule and Kellash service.  Long ago, the Kellag rulers bent the knee to Ellid Nobles.  Since then, the Kellash peasants have been absorbed into the system as part of the Ellid social structure.  They current Kellash are a mixed culture of old Kellag and new Ellid ways. Many have mixed El and Kell bloodlines.  They have even evolved a new spoken language of their own, Kellish.  Kellish is a mix of Kellagash, Ellic, and Nammash with some other bit included. In addition to Nor Doure, Kellash culture makes up the bulk of the common folk in the main imperial realms of El, Neb, and Dar.",
      "cultureLook": "The Kellash tend to be short and stout with ruddy, freckled skin. Their hair is red to reddish brown hair and have eyes of green or brown.",
      "cultureFaction": "Ellid Empire",
      "cultureFactionRel": "accepted",
      "cultureLang": "Kellish",
      "addLang": [
        "Kellagash", "Ellic", "Nammash"
      ],
      "cultureBenDesc": "The Kellash love to spend their time singing, dancing, laughing, and having a good time with others. Because of their ability to strike up fast freindships, they gain a +1 to all Spiritual ability based check rolls.",
      "cultureBenType": "spiritual",
      "cultureBenNum": 1,
      "cultureNote": "Kellash characters also gain a +4 cultural bonus to all Perform skill check rolls."
    },
    {
      "cultureId": "Konari",
      "cultureTitle": "Konari Heritage",
      "culturePrereq": "any",
      "cultureDesc": "The Konari live on the Isle of Kon Siddah.  Theirs is a heritage of mixed cultures and ideas.  The importance of craft and trade are paramount to Konari tradition.  Konari communities are run by elected councils made up of leading members of the local Trade Guilds.  Although Kon Siddah is under Imperial Rule, the region is run locally as a Trade Republic.  Many religious traditions can be found on Kon Siddah.  Most prominently are the High Holy Orders of Espa, Heshlah, and Iost.",
      "cultureLook": "The Konari may be of any race and appearance.",
      "cultureFaction": "Konari Trade Republic",
      "cultureFactionRel": "accepted",
      "cultureLang": "Illfash",
      "addLang": [
        "any"
      ],
      "cultureBenDesc": "The Konari are excellent tradesfolk and have a strong banking system. Due to this, Konari characters have a greater chance of holding wealth. Konari characters gain a +4 to starting Wealth roll results.",
      "cultureBenType": "wealth",
      "cultureBenNum": 4,
      "cultureNote": "The Konari tradition of trade means that all Konari characters gain a +4 cultural bonus to Craft skill check rolls."
    },
    {
      "cultureId": "Marrish",
      "cultureTitle": "Marrish Heritage",
      "culturePrereq": "Human",
      "cultureDesc": "An ancient island culture, the Marrish have developed a strong sense of ethnic pride.  In spite of this, they are an open and friendly people.  Arcane magic is a strong part of Marrish culture.  Most Marrish have at least a small amount of magic talent.  Their communities are run by elected conclaves of powerful mages.  Mar Siddah, their homeland, is a Republic of elected representatives from such communities.  Mar Siddah has tolerant and sometimes friendly relations with the Ellid Empire.  The Marrish follow the sacred teachings from their own Temples of Mael and Nixtia, even though the High Holy Orders do maintain small missions throughout the Marrish Islands.",
      "cultureLook": "Marrish are dark skinned with jet black hair and bright, sometimes violet, eyes.",
      "cultureFaction": "Marrish Republic",
      "cultureFactionRel": "accepted",
      "cultureLang": "Marrin",
      "addLang": [
        "Nammash", "Kellish", "Kalfar", "Wavespeak", "Windspeak"
      ],
      "cultureBenDesc": "The Marish are well trained to use their minds at an early age. Marrish characters gain a +1 bonus to all Mental ability based check rolls.",
      "cultureBenType": "mental",
      "cultureBenNum": 1,
      "cultureNote": "Marrsih characters gain a +2 cultural bonus to all Arcanist Skills skill check rolls."
    },
    {
      "cultureId": "Radur",
      "cultureTitle": "Radurran Heritage",
      "culturePrereq": "Dur",
      "cultureDesc": "Radurran culture is nearly as old as the stones themselves.  The Radur ways are the ways of mining and forging.  Their long years in the “earth below” have made them into superb warriors and soldiers.  The central Radur community is the metropolis of Bargendelph. Small clan communities are led by a Durthane.  The council of Durthags elects a regional king.  The king’s clan holds hereditary power unless the council deposes the king and installs a new one.  The regional kings elect the High King in much the same way.  The Radur worship the four Dur Gods of the Creation - Depghaad, Glaghaad, Aeirghaada, and Vasghaada.",
      "cultureLook": "The Radur have light brown complexions with light or pale colored hair. They have bright gray-blue eyes.",
      "cultureFaction": "Council of Durthanes",
      "cultureFactionRel": "accepted",
      "cultureLang": "Durric",
      "addLang": [
        "Stonespeak", "Nammash", "Gobnarse", "Uroggar", "Gnomish"
      ],
      "cultureBenDesc": "With a long history of mining and access to precious metals, Radurran characters are more likely to have accumulated wealth. Radurran characters gain a +4 bonus to their starting Wealth roll results.",
      "cultureBenType": "wealth",
      "cultureBenNum": 4,
      "cultureNote": "Radurran characters have a +4 cultural bonus to all Craft skill check rolls."
    },
    {
      "cultureId": "Sewer",
      "cultureTitle": "Sewer Goblyn",
      "culturePrereq": "Goblyn",
      "cultureDesc": "Often called Squeakers by most, these muck dwelling denizens of the Imperial underbelly have a heritage of degradation and crime. They live among the civilized, but practice a life of quiet savagery. The small Goblyn enclaves within the larger cities are run by the strongest and smartest of the Goblyns. If they have a faith, it is usually in some vile and disgusting cult. Even though they live in smaller clan like communities, they are linked together into what they refer to as the Kindom of the Sewers.",
      "cultureLook": "Squeakers tend to have dull yellow to greenish brown colored skin with little or no hair. ",
      "cultureFaction": "Kindom of the Sewers",
      "cultureFactionRel": "accepted",
      "cultureLang": "Gobnarse",
      "addLang": [
        "any"
      ],
      "cultureBenDesc": "Squeakers are quick and quiet. Sewer Goblyn characters gain a +1 bonus to all physical ability check roll results.",
      "cultureBenType": "physical",
      "cultureBenNum": 1,
      "cultureNote": "Sewer Goblyn characters gain a +2 cultural bonus to all Thieving Skill skill check rolls."
    },
    {
      "cultureId": "Steel",
      "cultureTitle": "Steel Orc",
      "culturePrereq": "Orc",
      "cultureDesc": "The Steel Orcs created an organized, fanatically religious military society. They rule over lesser orcs and other races of Ghurad-Uhle and beyond from their fortress city of Grad Uht Orog. They have some respect for the military of Ellida. They have been at war with Ellida off and on for over 350 years. The Steel Orcs are ruled by a demigod king, usually the strongest half mortal son of their ancient dragon god Raath. Since all Steel Orcs claim to have the Blood of Raath, it is needless to mention their fanatic devotion to that god.",
      "cultureLook": "Steel Orcs are taller than other orcs with grey skin and dark silver hair. They have yellow orange eyes.",
      "cultureFaction": "Grad Uht Orog",
      "cultureFactionRel": "accepted",
      "cultureLang": "Uroggar",
      "addLang": [
        "Nammash", "Shillic", "AlSylnir", "Durric", "Akric"
      ],
      "cultureBenDesc": "Steel Orcs are stongly devout and spritual in nature. Steel Orc characters gain a +1 bonus to all Spiritual ability roll results.",
      "cultureBenType": "spiritual",
      "cultureBenNum": 1,
      "cultureNote": "Steel Orc characters gain a +2 cultural bonus to all Combat Skill skill check rolls."
    },
    {
      "cultureId": "Syl",
      "cultureTitle": "Syl'N'Athi Heritage",
      "culturePrereq": "N'Athi",
      "cultureDesc": "The Syl’N’Athi, or forest elves, came over the mountains and into Nas’Arial about 5,000 years ago.  Theirs is a culture of harmonic codependence with the forest.  They tolerate some races, but strongly dislike outsiders in their lands.  They are serious guardians and warriors when challenged, but at heart they are a fun loving and happy people.  They have prohibitions against the practice of Arcane Magic among their populace.  Syl who wish to study such magic must leave their homeland and seek knowledge from the outside world.  Syl communities are small and guided by their local Nosic druid.  The Syl people are united under the guidance of the Council of Leaves.  Syl’N’Athi are almost entirely Nosic in faith.",
      "cultureLook": "Syl'N'Athi are short and wiry of build with fine, sharp features.  They have almond shaped eyes of gold, green, or brown.  Their skin is a deep olive tan, and their hair may be any shade of brown or deep red.",
      "cultureFaction": "Council of Leaves",
      "cultureFactionRel": "accepted",
      "cultureLang": "Alsylnir",
      "addLang": [
        "Alnaranir", "Durric", "Hammish", "Nammash", "Gobnarse", "Uroggar"
      ],
      "cultureBenDesc": "Syl'N'Athi are strong and athletic. Syl'N'Athi characters gain +1 to all Physical ability based check rolls.",
      "cultureBenType": "physical",
      "cultureBenNum": 1,
      "cultureNote": "Syl'N'Athi characters gain a +4 cultural bonus to all Nature Lore skill check rolls."
    },
    {
      "cultureId": "Wandering",
      "cultureTitle": "Gor Traveler",
      "culturePrereq": "Gor",
      "cultureDesc": "The Wandering Gor are viewed by most of Ellida with about as much affection as a case of the hives.  They wander about in groups small and large looking for adventure and seeking new things.  In order to lessen their unpopularity among the settled peoples, many Wanderers join circuses and traveling shows.  They are natural performers.  They have no real political structure, but join together is loose extended family groups that they call The Fellowship of the Roads.  Family groups connect for short periods of time and work together.  Wanderers have no unifying faith. They usually explore many faiths in their lifetime search for new experiences.",
      "cultureLook": "",
      "cultureFaction": "Fellowship of the Roads",
      "cultureFactionRel": "accepted",
      "cultureLang": "Hammish",
      "addLang": [
        "any"
      ],
      "cultureBenDesc": "Wanderers are observant and quick witted. Wandering Gor characters gain a +1 bonus to all Mental ability based check rolls.",
      "cultureBenType": "mental",
      "cultureBenNum": 1,
      "cultureNote": "Wanderers have a hard time with the concept of personal property and ownership.  As such Wandering Gor characters gain a +2 bonus to all Theiving Skill skill check rolls."
    }
  ]