{
  "races": [{
      "race": {
        "id": "dwarf",
        "raceName": "Dur",
        "raceDesc": "The Dur (or Dwarves as humans call them) are probably the oldest race still openly active in the world today.  The Dur and their culture have had some degree of impact on every culture in existence at this time.  The Dur are a race of dedicated, hardworking, hard fighting, and hard drinking, craftsmen without equal.  On the average, dwarves tend to be short and stocky with short legs but clever fingers.  They have broad, heavy features with rounded ears, lots of hair, and large noses.  Dwarves are tough and strong with a near legendary ability to withstand much physical strain.  Dwarves have a well-deserved reputation for being short tempered, suspicious, and thirsty; but they also form intensely loyal friendships with those they like.",
        "fullBlood": {
          "fbDesc": "A Character with two Dwarven parents gains +5 to Total Hit Points.",
          "fbBonus": {
            "fbHasBonus": true,
            "fbBonusType": "hp",
            "fbBonusAmount": 5
          }
        },
        "raceSpecial": {
          "specialDesc": "Characters of Dwarven Heritage gain the ability to always knodirection.",
          "specialAb": "know direction"
        },
        "traits": {
          "size": "m",
          "speed": 20,
          "avgHeight": 45,
          "avgWeight": 230,
          "avgLifespan": 350
        },
        "types": [{
            "type": {
              "typeName": "Ardur",
              "typeDesc": "The Ardur are what most humans think of when they hear the name Dwarf.  They are a hard drinking, hard fighting, and dour faced race of fine craftsmen, stalwart mercenaries, and loyal companions.  The Ardur are descendants of Radur entrepreneurs who came from the mountains to live and trade among the surface races.  Since that time, the Ardur have changed a little from their cousins.  They tend to have brown or red colored hair, light brown skin, and brown or green colored eyes.  They stand slightly taller than the Radur.",
              "fullType": {
                "fullTypeDesc": "A Character with two Ardur parents gains an additional +1 to Mental Ability",
                "fullTypeAbBonus": "physical",
                "fullTypeBonusAmt": 1
              },
              "isTaller": true,
              "isShorter": false,
              "heightMaxDiff": 6,
              "isHeavier": false,
              "isLighter": false,
              "weightMaxDiff": 0,
              "maternal": {
                "maternalDesc": "Your natural mother was Ardur.",
                "maternalName": "Hammer Born",
                "maternalAb": "mental",
                "maternalAbBonus": 1
              },
              "paternal": {
                "paternalDesc": "Your natural father was Ardur.",
                "paternalName": "Hammer Sired",
                "paternalAb": "physical",
                "paternalAbBonus": 1
              }
            }
          },
          {
            "type": {
              "typeName": "Radur",
              "typeDesc": "The Radur are the denizens of the mountain deeps.  They are an underground dwelling race of stone loving warriors and craftsmen.  They love the simple pleasures of life, but within moderation.  They are strongly loyal and brave, but very serious with outsiders.  They are shorter than the Ardur with a strong and stocky build.  They love to eat and drink.  They are very family oriented.  They have light colored hair, sometimes pale blonde.  They have bright gray-blue eyes.  They weigh slightly more than the Ardur.",
              "fullType": {
                "fullTypeDesc": "A Character with two Radur parents gains an additional +1 to Spiritual Ability",
                "fullTypeAbBonus": "spiritual",
                "fullTypeBonusAmt": 1
              },
              "isTaller": false,
              "isShorter": false,
              "heightMaxDiff": 0,
              "isHeavier": true,
              "isLighter": false,
              "weightMaxDiff": 40,
              "maternal": {
                "maternalDesc": "Your natural mother was Radur.",
                "maternalName": "Anvil Born",
                "maternalAb": "spiritual",
                "maternalAbBonus": 1
              },
              "paternal": {
                "paternalDesc": "Your natural father was Radur.",
                "paternalName": "Anvil Sired",
                "paternalAb": "physical",
                "paternalAbBonus": 1
              }
            }
          }
        ]
      }
    },
    {
      "race": {
        "id": "elf",
        "raceName": "N'Athi",
        "raceDesc": "The N'Athi (called elves by most humans) are thought to be one of the oldest races found in the world.  Certainly, most of their cultural traditions have survived for many thousands of years.  As with humans, there are several different elven racial types.  Certain physiological features are typical of all elves.  All elves tend to be slender with fine, almost delicate features and long, dexterous fingers.  Elven eyes are always large, slanted, and almond shaped.  Their ears are larger and sharply pointed.  All elves have excellent senses.  All elves are observant and have analytical minds.  As a result, most elves are thoughtful and opposed to action without comprehensive thought and planning.  Elves are prone to empathy and share a minor type of mystic bond with other members of their family and, to some extent, other elves.  As a result, Elves can share deep emotions and feelings with members of their families.  They know, vaguely, the direction in which any family member is located at any given time and have a general impression of that member’s well-being.  Elves gain a +2 bonus to all ‘Social Skills’ roll results that involve other Elves.",
        "fullBlood": {
          "fbDesc": "A Character with two Elven parents gains a +4 racial bonus to Physical Perception checks.",
          "fbBonus": {
            "fbHasBonus": true,
            "fbBonusType": "perception",
            "fbBonusAmount": 4
          }
        },
        "raceSpecial": {
          "specialDesc": "Characters with Elven Heritage gain the ability to rest without having to sleep.",
          "specialAb": "reverie"
        },
        "traits": {
          "size": "m",
          "speed": 30,
          "avgHeight": 56,
          "avgWeight": 105,
          "avgLifespan": 500
        },
        "types": [{
            "type": {
              "typeName": "Ara'N'Athi",
              "typeDesc": "The Ara, as those on Kon Siddah name them, are the remnant of a larger population of the so called “High Elves” that once covered the world.  They are a magic loving race of intelligent craftsmen who prefer to be left out of regional politics and worldly affairs.  They are a taller than average race of fine skinned, high featured elves with blonde, reddish blonde, or light brown hair.  They have almond shaped eyes of blue, violet, or grey.",
              "fullType": {
                "fullTypeDesc": "A Character with two Ara’N’Athi parents gain an additional +1 to Mental Ability.",
                "fullTypeAbBonus": "mental",
                "fullTypeBonusAmt": 1
              },
              "isTaller": true,
              "isShorter": false,
              "heightMaxDiff": 6,
              "isHeavier": false,
              "isLighter": false,
              "weightMaxDiff": 0,
              "maternal": {
                "maternalDesc": "Your natural mother was Ara'N'Athi.",
                "maternalName": "Mage Born",
                "maternalAb": "mental",
                "maternalAbBonus": 1
              },
              "paternal": {
                "paternalDesc": "Your natural father was Ara'N'Athi.",
                "paternalName": "Mage Sired",
                "paternalAb": "spiritual",
                "paternalAbBonus": 1
              }
            }
          },
          {
            "type": {
              "typeName": "Syl'N'Athi",
              "typeDesc": "The Syl are a nature loving race and care little for the intrusions of outsiders.  They are short and wiry of build with fine, sharp features.  They have almond shaped eyes of gold, green, or brown.  Their skin is a deep olive tan, and their hair may be any shade of brown or deep red.",
              "fullType": {
                "fullTypeDesc": "A Character with two Syl’N’Athi parents gain an additional +1 to Physical Ability.",
                "fullTypeAbBonus": "spiritual",
                "fullTypeBonusAmt": 1
              },
              "isTaller": false,
              "isShorter": false,
              "heightMaxDiff": 0,
              "isHeavier": false,
              "isLighter": false,
              "weightMaxDiff": 0,
              "maternal": {
                "maternalDesc": "Your natural mother was Syl'N'Athi.",
                "maternalName": "Forest Born",
                "maternalAb": "spiritual",
                "maternalAbBonus": 1
              },
              "paternal": {
                "paternalDesc": "Your natural father was Syl'N'Athi.",
                "paternalName": "Forest Sired",
                "paternalAb": "physical",
                "paternalAbBonus": 1
              }
            }
          }
        ]
      }
    },
    {
      "race": {
        "id": "gnome",
        "raceName": "Gnomein-ud-Taugrein",
        "raceDesc": "Gnomein-ud-Taugrein (referred to by most as Gnomes) are a strange race of small, intelligent people. They have keen minds and skilled hands. Gnomes are friendly and forgiving, but they are easily excitable. Most Gnomes prefer bright colors and interesting hairstyles.",
        "fullBlood": {
          "fbDesc": "A Character with two Gnomish parents gains a +4 bonus to Mental Defense roll results.",
          "fbBonus": {
            "fbHasBonus": true,
            "fbBonusType": "Mental Defense",
            "fbBonusAmount": 4
          }
        },
        "raceSpecial": {
          "specialDesc": "Characters with Gnomish Heritage gain the ability to take two Standard Actions as one Full Round Action once per encounter",
          "specialAb": "multi-task"
        },
        "traits": {
          "size": "s",
          "speed": 20,
          "avgHeight": 25,
          "avgWeight": 50,
          "avgLifespan": 250
        },
        "types": [{
            "type": {
              "typeName": "Lowlander",
              "typeDesc": "Typical Lowland Gnomes are the little people ubiquitous to civic life in most human nations. Many live in the larger cities.  They are an industrious race, full of questions and ideas.  They often work as engineers and scholars. As common as they are in large cities, some do have small villages of their own scattered throughout the less inhabited areas. Gnomes commonly have gnarled features and bright, intelligent eyes.  They are quite friendly, but often absent minded. They tend to have pale to light pink complexions, amber to brown colored eyes, and hair that ranges in color across the visible spectrum.",
              "fullType": {
                "fullTypeDesc": "A Character with two Lowlander Gnome parents gain an additional +1 to Spiritual Ability",
                "fullTypeAbBonus": "spiritual",
                "fullTypeBonusAmt": 1
              },
              "isTaller": false,
              "isShorter": false,
              "heightMaxDiff": 0,
              "isHeavier": false,
              "isLighter": false,
              "weightMaxDiff": 0,
              "maternal": {
                "maternalDesc": "Your natural mother was a Lowlander Gnome.",
                "maternalName": "Genius Born",
                "maternalAb": "mental",
                "maternalAbBonus": 1
              },
              "paternal": {
                "paternalDesc": "Your natural father was Lowlander Gnome.",
                "paternalName": "Genius Sired",
                "paternalAb": "mental",
                "paternalAbBonus": 1
              }
            }
          },
          {
            "type": {
              "typeName": "Blue Stone",
              "typeDesc": "Blue Stone gnomes are native to the Blue Stone Mountian Ranges.  They build simple cities within the roots of the mountains. They are clever craftsmen and engineers.  Although, in general, they prefer not to live above ground or dwell within the crowded cities of humankind, some will travel out into the world to seek new materials or trade in ideas. They tend to be smaller and stouter than their lowlander cousins. They have medium to dark blue-gray complexions, amber colored eyes, and hair that ranges from light blonde to firey orange.",
              "fullType": {
                "fullTypeDesc": "A Character with two Blue Stone parents gain an additional +1 to Physical Ability.",
                "fullTypeAbBonus": "physical",
                "fullTypeBonusAmt": 1
              },
              "isTaller": false,
              "isShorter": true,
              "heightMaxDiff": 6,
              "isHeavier": true,
              "isLighter": false,
              "weightMaxDiff": 15,
              "maternal": {
                "maternalDesc": "Your natural mother was a Blue Stone Gnome.",
                "maternalName": "Deep Born",
                "maternalAb": "spiritual",
                "maternalAbBonus": 1
              },
              "paternal": {
                "paternalDesc": "Your natural father was a Blue Stone Gnome.",
                "paternalName": "Deep Sired",
                "paternalAb": "mental",
                "paternalAbBonus": 1
              }
            }
          },
          {
            "race": {
              "id": "halfmen",
              "raceName": "Gor",
              "raceDesc": "Halfmen, or Gor as they would rather be called, are a race of short, cheerful creatures that appear to look almost like human children.  All Gor are family and community oriented.  As a race, they are mostly friendly, helpful, and talkative. Halflings display a strong trait of naïve optimism. Seemingly contrary to their somewhat childlike nature, Gor can be intensely serious and dedicated when necessary. They are a pleasant race with deep reserves of quiet strength and determination. They have features very similar to humans except for slightly pointed ears and large, tough-soled feet.",
              "fullBlood": {
                "fbDesc": "A Character with two Halfling parents gains a +4 bonus to Physical Defense roll results.",
                "fbBonus": {
                  "fbHasBonus": true,
                  "fbBonusType": "Physical Defense",
                  "fbBonusAmount": 4
                }
              },
              "raceSpecial": {
                "specialDesc": "Characters with Halfling Heritage gain the ability to communicate with rodents.",
                "specialAb": "squirrel speak"
              },
              "traits": {
                "size": "s",
                "speed": 20,
                "avgHeight": 36,
                "avgWeight": 80,
                "avgLifespan": 100
              },
              "types": [{
                  "type": {
                    "typeName": "Hardfut",
                    "typeDesc": "Hardfut halflings are hardworking and industrious Gor.  They like to live with the Radur and Blue Stone Gnomes beneath the mountains. As such, they are very much like the Radur in temperament. Hardfut are cunning craftsmen and diligent miners. They stand about 3 feet tall and have very fair skin with dark hair. Their eyes are light colored.",
                    "fullType": {
                      "fullTypeDesc": "A Character with two Hardfut parents gain an additional +1 to Physical Ability.",
                      "fullTypeAbBonus": "physical",
                      "fullTypeBonusAmt": 1
                    },
                    "isTaller": false,
                    "isShorter": false,
                    "heightMaxDiff": 0,
                    "isHeavier": false,
                    "isLighter": false,
                    "weightMaxDiff": 0,
                    "maternal": {
                      "maternalDesc": "Your natural mother was a Hardfut Gor.",
                      "maternalName": "Warren Born",
                      "maternalAb": "spiritual",
                      "maternalAbBonus": 1
                    },
                    "paternal": {
                      "paternalDesc": "Your natural mother was a Hardfut Gor.",
                      "paternalName": "Warren Sired",
                      "paternalAb": "physical",
                      "paternalAbBonus": 1
                    }
                  }
                },
                {
                  "type": {
                    "typeName": "Hammid",
                    "typeDesc": "Hammids are a pleasant farming folk. They live in small towns and farming villages. Hammid homes are nicely appointed “dens” built into hillsides or sometimes they live in cozy cottages above ground. They prefer the security of simple lives. They are amiable, love to eat, and enjoy working with plants. They have curly hair that ranges in color from deep brown through dull red into dark blonde.  Their eyes are just about any regular color. They have fair skin and a paunchy build.",
                    "fullType": {
                      "fullTypeDesc": "A Character with two Hammid parents gain an additional +1 to Spiritual Ability.",
                      "fullTypeAbBonus": "spiritual",
                      "fullTypeBonusAmt": 1
                    },
                    "isTaller": false,
                    "isShorter": false,
                    "heightMaxDiff": 0,
                    "isHeavier": true,
                    "isLighter": false,
                    "weightMaxDiff": 20,
                    "maternal": {
                      "maternalDesc": "Your natural mother was Hammid.",
                      "maternalName": "Hearth Born",
                      "maternalAb": "physical",
                      "maternalAbBonus": 1
                    },
                    "paternal": {
                      "paternalDesc": "Your natural father was Hammid.",
                      "paternalName": "Hearth Sired",
                      "paternalAb": "spiritual",
                      "paternalAbBonus": 1
                    }
                  }
                },
                {
                  "type": {
                    "typeName": "Traveler",
                    "typeDesc": "Travelers are a race of Gor who wander that realm in search of adventure and new experiences. Their settled cousins, the Hammids, view Travelers with great distaste. Family groups of Travelers often travel in trains of small, brightly painted wagons.  They love life and adventure. They are brave and curious. They love to laugh and sing. Travelers are natural performers. They have deep, creamy almond colored skin. They tend to be slighter of build than the Hammids. Their eyes are bright in color, while their hair tends to be reddish or dark blonde.",
                    "fullType": {
                      "fullTypeDesc": "A Character with two Traveler parents gain an additional +1 to Mental Ability.",
                      "fullTypeAbBonus": "mental",
                      "fullTypeBonusAmt": 1
                    },
                    "isTaller": true,
                    "isShorter": false,
                    "heightMaxDiff": 10,
                    "isHeavier": false,
                    "isLighter": false,
                    "weightMaxDiff": 0,
                    "maternal": {
                      "maternalDesc": "Your natural mother was Traveler Gor.",
                      "maternalName": "Trail Born",
                      "maternalAb": "spiritual",
                      "maternalAbBonus": 1
                    },
                    "paternal": {
                      "paternalDesc": "Your natural father was Traveler Gor.",
                      "paternalName": "Trail Sired",
                      "paternalAb": "physical",
                      "paternalAbBonus": 1
                    }
                  }
                }
              ]
            }
          },
          {
            "race": {
              "id": "human",
              "raceName": "Human",
              "raceDesc": "In general, humans are the most dominant race throughout the world. They are considered to be one of the youngest of the races. Humans have the largest diversity of genotype, culture, and personal attitude than any of the other races. Humans are considered highly adaptable and frustratingly unpredictable. They may have shorter lifespans, but they learn quickly. Indeed, they are the most versatile and potentially the most powerful choice as a Basic Race.",
              "fullBlood": {
                "fbDesc": "A Character with two Human parents gains +2 Training Points.",
                "fbBonus": {
                  "fbHasBonus": true,
                  "fbBonusType": "training points",
                  "fbBonusAmount": 2
                }
              },
              "raceSpecial": {
                "specialDesc": "Characters with Human Heritage gain +2 Training Points.",
                "specialAb": "fast learner"
              },
              "traits": {
                "size": "m",
                "speed": 30,
                "avgHeight": 65,
                "avgWeight": 150,
                "avgLifespan": 65
              },
              "types": [{
                  "type": {
                    "typeName": "Ang",
                    "typeDesc": "The Ang are an old culture that once ruled most of central Nas’Arial. They are a haughty race of sorcerers.  The last true Ang kingdom was destroyed at the end of the Mage Wars 500 years ago. The Ang tend to be average sized with fair skin, sharp features, jet black hair, black nails and dark eyes. They are exceptional Arcanists.",
                    "fullType": {
                      "fullTypeDesc": "A Character with two Ang parents gain an additional +1 to Mental Ability.",
                      "fullTypeAbBonus": "mental",
                      "fullTypeBonusAmt": 1
                    },
                    "isTaller": false,
                    "isShorter": false,
                    "heightMaxDiff": 0,
                    "isHeavier": false,
                    "isLighter": false,
                    "weightMaxDiff": 0,
                    "maternal": {
                      "maternalDesc": "Your natural mother was Ang Human.",
                      "maternalName": "Sorcerer Born",
                      "maternalAb": "mental",
                      "maternalAbBonus": 1
                    },
                    "paternal": {
                      "paternalDesc": "Your natural father was Ang Human.",
                      "paternalName": "Sorcerer Sired",
                      "paternalAb": "spiritual",
                      "paternalAbBonus": 1
                    }
                  }
                },
                {
                  "type": {
                    "typeName": "El",
                    "typeDesc": "The People of El are, on average, tall with blonde or blondish hair and light colored eyes. The Ellish prefer well defined, ordered societies. The Ellid people have been a strong political force in Nas'Arial. ",
                    "fullType": {
                      "fullTypeDesc": "A Character with two Syl’N’Athi parents gain an additional +1 to Spiritual Ability.",
                      "fullTypeAbBonus": "spiritual",
                      "fullTypeBonusAmt": 1
                    },
                    "isTaller": true,
                    "isShorter": false,
                    "heightMaxDiff": 6,
                    "isHeavier": true,
                    "isLighter": false,
                    "weightMaxDiff": 20,
                    "maternal": {
                      "maternalDesc": "Your natural mother was Ellish.",
                      "maternalName": "Noble Born",
                      "maternalAb": "spiritual",
                      "maternalAbBonus": 1
                    },
                    "paternal": {
                      "paternalDesc": "Your natural father was Ellish.",
                      "paternalName": "Noble Sired",
                      "paternalAb": "physical",
                      "paternalAbBonus": 1
                    }
                  }
                },
                {
                  "type": {
                    "typeName": "Giet'tan",
                    "typeDesc": "The Giet’tan or “Getts” are the most common human type of Nam Doure.  The modern Getts are descendants of nomad clans who wandered the lands they now farm. Some Getts still live a nomadic existence on the frontiers of Nam Doure, but most have settled into one of the many agricultural communities throught that land. As a race, the Getts are long and lean with tan skin, dark brown hair, and dark eyes.",
                    "fullType": {
                      "fullTypeDesc": "A Character with two Giet'tan parents gain an additional +1 to Physical Ability.",
                      "fullTypeAbBonus": "physical",
                      "fullTypeBonusAmt": 1
                    },
                    "isTaller": true,
                    "isShorter": false,
                    "heightMaxDiff": 12,
                    "isHeavier": false,
                    "isLighter": true,
                    "weightMaxDiff": 20,
                    "maternal": {
                      "maternalDesc": "Your natural mother was Giet'tan.",
                      "maternalName": "Grass Born",
                      "maternalAb": "spiritual",
                      "maternalAbBonus": 1
                    },
                    "paternal": {
                      "paternalDesc": "Your natural father was Giet'tan.",
                      "paternalName": "Grass Sired",
                      "paternalAb": "physical",
                      "paternalAbBonus": 1
                    }
                  }
                },
                {
                  "type": {
                    "typeName": "Kalfan",
                    "typeDesc": "The Kalfs are a dark skinned seafaring people from the Golden Isles south east of Nam Doure. They love to sail, tell stories, and sing songs. They are shrewd merchants. There is a large, transplanted population of Kalfs on the northern island of Gratte. Kalfan traders transport goods throughout Nas’Arial.  Kalfs are of average build with reddish-brown hair, and eyes of any color.",
                    "fullType": {
                      "fullTypeDesc": "A Character with two Kalfan parents gain an additional +1 to Physical Ability.",
                      "fullTypeAbBonus": "physical",
                      "fullTypeBonusAmt": 1
                    },
                    "isTaller": false,
                    "isShorter": false,
                    "heightMaxDiff": 0,
                    "isHeavier": false,
                    "isLighter": false,
                    "weightMaxDiff": 0,
                    "maternal": {
                      "maternalDesc": "Your natural mother was Kalfan.",
                      "maternalName": "Sea Born",
                      "maternalAb": "spiritual",
                      "maternalAbBonus": 1
                    },
                    "paternal": {
                      "paternalDesc": "Your natural father was Kalfan.",
                      "paternalName": "Sea Sired",
                      "paternalAb": "physical",
                      "paternalAbBonus": 1
                    }
                  }
                },
                {
                  "type": {
                    "typeName": "Kalfan",
                    "typeDesc": "The Kalfs are a dark skinned seafaring people from the Golden Isles south east of Nam Doure. They love to sail, tell stories, and sing songs. They are shrewd merchants. There is a large, transplanted population of Kalfs on the northern island of Gratte. Kalfan traders transport goods throughout Nas’Arial.  Kalfs are of average build with reddish-brown hair, and eyes of any color.",
                    "fullType": {
                      "fullTypeDesc": "A Character with two Kalfan parents gain an additional +1 to Physical Ability.",
                      "fullTypeAbBonus": "physical",
                      "fullTypeBonusAmt": 1
                    },
                    "isTaller": false,
                    "isShorter": false,
                    "heightMaxDiff": 0,
                    "isHeavier": false,
                    "isLighter": false,
                    "weightMaxDiff": 0,
                    "maternal": {
                      "maternalDesc": "Your natural mother was Kalfan.",
                      "maternalName": "Sea Born",
                      "maternalAb": "spiritual",
                      "maternalAbBonus": 1
                    },
                    "paternal": {
                      "paternalDesc": "Your natural father was Kalfan.",
                      "paternalName": "Sea Sired",
                      "paternalAb": "physical",
                      "paternalAbBonus": 1
                    }
                  }
                }
              ]
            }
          }
        ]
      }
    }


  ]
}