[{
    "featureName": "Sorcery",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have developed an ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Primal Arcane Powers. Add +1d4 Charge to your Charge roll result.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Self-Awareness", "Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Kinetomancy",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have harnessed your physical being and its movements to capture and control Arcane Energy.",
    "featureBenDesc": "When using any Evocation Arcane Power, you may now use your Physical Ability modifier dice instead of your Mental Ability modifier dice when making any Magic Use/Attack check rolls for Arcane Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Ectomancy",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have harnessed your spiritual being and its emotions to capture and control Arcane Energy.",
    "featureBenDesc": "When using any Invocation Arcane Power, you may now use your Spiritual Ability modifier dice instead of your Mental Ability modifier dice when making any Magic Use/Attack check rolls for Arcane Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Empower Weapon",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "As a Partial Action, if you spend one Charge, you may empower a mundane weapon (melee, ranged, or unarmed attack) with a +1d4 Arcane Enhancement bonus to Combat Attack check rolls 10 full rounds. As a free action, you may maintain a weapon so empowered by spending another 1 Charge for each additional 10 rounds. As long as a weapon is empowered, it is considered to be a Magic Weapon.",
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Evocation",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have learned to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you may add +1d4 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Kinetomancy"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Primal Darkness",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Darkness.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to diminish or remove light from an area with a radius of up to 5' centered on a point that you can see within 30' of yourself. As a free action once per round while Primal Darkness is active, you may increase or decrease the level of darkness within the affected area from dim to complete darkness. Also, while this is active you gain the ability to see in darkness without penalty to your vision. Each round that Primal Darkness is active, you may choose to spend additional Charges to cause all creatures within your Darkness to reduce their Current Ticker Values by 1d4 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Darkness remains active. You may spend no more than 5 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Primal Darkness remains active for 1d4+1 rounds.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Light and negate the effects of both."
  },
  {
    "featureName": "Cloaked in Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to shroud and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 1d4+1, to Manifest an Arcane Presence of Primal Darkness. This Presence rises up around you to dim the level of all light within your Reach. While near you, others feel a little unsure. While this Presence is active you gain 10% Concealment against all Ranged and Melee attacks. Also, Living creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of loss from Ticker Value for each instance of contact. While Cloaked in Darkness is active, you also automatically gain all of the abilities from the Feature Primal Darkness without having to decrease your current Charge. Cloaked in Darkness remains active for 6 rounds + the Charge cost. When Cloaked in Darkness enters its last round of activity, as a Free Action you may continue the Presence for another 6 rounds by spending 1 additional Charge.",
    "featurePrereq": ["Primal Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to attack your foes.",
    "featureBenDesc": "While Cloaked in Darkness is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Darkbolt. While Darkbolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against 1 opponent each round. Your Darkbolt will deal +1d6 points of Ticker Value loss on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Darkbolt must be re-manifested with 1 additional Charge each time your Cloaked in Darkness Power is renewed.",
    "featurePrereq": ["Cloaked in Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Darkblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to enhance your weapon.",
    "featureBenDesc": "If you Manifest Empower Weapon while Cloaked in Darkness is active, your Empowered Weapon will now automatically deal Shadow Damage with each attack and will cause a Living opponent to lose +1d6 points from its Ticker Value as additional damage on all successful Combat Check rolls. Darkblade does not incur any additional Charge loss to Manifest and remains active as long as Cloaked in Darkness and Empower Weapon are both active.",
    "featurePrereq": ["Empower Weapon", "Cloaked in Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Primal Flame",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Flame.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to raise the ambient temperature in an area with a radius of up to 5' centered on a point that you can see within 30' of yourself. As a free action once per round while Primal Flame is active, you may increase or decrease the level of heat within the affected area from warm to uncomfortably hot. Also, while this is active you gain the ability to light candles, torches, or campfires with a touch. Each round that Primal Flame is active, you may choose to spend additional Charges to cause all creatures within your Heat to reduce their Current Health Values by 1d4 points of Fire Damage for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Flame remains active. You may spend no more than 5 Charges on this action each round. Targeted individuals are allowed a Physical Defense Check roll against your Use Magic check in order to negate this damage. Once Manifested, Primal Flame remains active for 1d4+1 rounds.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Frost and negate the effects of both."
  },
  {
    "featureName": "Wreathed in Flames",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Flame to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Primal Flame. This Presence ignites around you and wraps your form in spectral fire.  While near you, others feel a bit warmer. While this Presence is active you gain a 25% reduction of all Fire damage that would be dealt to you. Also, creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of Fire damage for each instance of contact. While Cloaked in Flame is active, you also automatically gain all of the abilities from the Feature Primal Flame without having to decrease your current Charge. Cloaked in Flame remains active for 6 rounds + the Charge cost. When Cloaked in Flame enters its last round of activity, as a Free Action you may continue the Presence for another 6 rounds by spending 1 additional Charge.",
    "featurePrereq": ["Primal Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Flame to attack your foes.",
    "featureBenDesc": "While Cloaked in Flame is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Flamebolt. While Flamebolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against 1 opponent each round. Your Flamebolt will deal +1d6 points of additional Fire damage on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Firebolt must be re-manifested with 1 additional Charge each time your Cloaked in Flame Power is renewed.",
    "featurePrereq": ["Wreathed in Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Flameblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Flame to enhance your weapon.",
    "featureBenDesc": "If you Manifest Empower Weapon while Cloaked in Flame is active, your Empowered Weapon will now automatically deal Fire Damage with each attack and will inflict +1d6 points of additional Fire damage on all successful Combat Check rolls. Fireblade does not incur any additional Charge loss to Manifest and remains active as long as Cloaked in Flame and Empower Weapon are both active.",
    "featurePrereq": ["Empower Weapon", "Wreathed in Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Primal Frost",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Frost.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to lower the ambient temperature in an area with a radius of up to 5' centered on a point that you can see within 30' of yourself. As a free action once per round while Primal Frost is active, you may increase or decrease the level of temperature within the affected area from cool to uncomfortably cold. Also, while this is active you gain the ability to chill items or freeze small amounts of water with a touch. Enough water may be frozen by this ability to create a walkable path over standing water for yourself and adjacent companions. Each round that Primal Frost is active, you may choose to spend additional Charges to cause all creatures within your Cold to reduce their Current Health Values by 1d4 points of Cold Damage for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Frost remains active. You may spend no more than 5 Charges on this action each round. Targeted individuals are allowed a Physical Defense Check roll against your Use Magic check in order to negate this damage. Once Manifested, Primal Frost remains active for 1d4+1 rounds.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Flame and negate the effects of both."
  },
  {
    "featureName": "Encased in Ice",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Primal Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Primal Frost. This Presence condenses around you and covers your form in spectral ice.  While near you, others feel a bit cold. While this Presence is active you gain a 25% reduction of all Cold damage that would be dealt to you. Also, creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of Cold damage for each instance of contact. While Encased in Ice is active, you also automatically gain all of the abilities from the Feature Primal Frost without having to decrease your current Charge. Encased in Ice remains active for 6 rounds + the Charge cost. When Encased in Ice enters its last round of activity, as a Free Action you may continue the Presence for another 6 rounds by spending 1 additional Charge.",
    "featurePrereq": ["Primal Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Frostbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Frost to attack your foes.",
    "featureBenDesc": "While Encased in Ice is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Frostbolt. While Frostbolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against 1 opponent each round. Your Frostbolt will deal +1d6 points of additional Cold damage on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Frostbolt must be re-manifested with 1 additional Charge each time your Encased in Ice Power is renewed.",
    "featurePrereq": ["Encased in Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Frostblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Frost to enhance your weapon.",
    "featureBenDesc": "If you Manifest Empower Weapon while Encased in Ice is active, your Empowered Weapon will now automatically deal Cold Damage with each attack and will inflict +1d6 points of additional Cold damage on all successful Combat Check rolls. Frostblade does not incur any additional Charge loss to Manifest and remains active as long as Encased in Ice and Empower Weapon are both active.",
    "featurePrereq": ["Empower Weapon", "Encased in Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Primal Light",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Light.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to radiate or brighten light from an area with a radius of up to 5' centered on a point that you can see within 30' of yourself. As a free action once per round while Primal Light is active, you may increase or decrease the level of light within the affected area from dim to fully lit. Also, while this is active you gain the ability to gently float one handspan above any vertical surface on which you would normally stand. While floating, you may move at your normal Speed. This ability will work over still water and mud. Each round that Primal Light is active, you may choose to spend additional Charges to cause all creatures within your Light to add +1d4 to their Ticker Values for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Light remains active. You may spend no more than 5 Charges on this action each round. Undead, Infernal, and Demonic creatures affected by this ability suffer a 1d4 loss to Ticker Value and are allowed a Physical Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Primal Light remains active for 1d4+1 rounds.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Darkness and negate the effects of both."
  },
  {
    "featureName": "Bathed in Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Primal Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 1d4+1, to Manifest an Arcane Presence of Primal Light. This Presence radiates from you and illuminates all within your Reach.  While near you, others feel a bit invigorated. While this Presence is active you gain 10% Block against all Ranged and Melee attacks. Also, allies who you Touch may add 1d6 points to Ticker Value. You may use this beneficial touch effect once per round as a partial action only if you are not engaged in combat during the current round. Undead, Infernal, and Demonic creatures that you touch, that touch you without permission, or that succeed at a Melee Attack Combat check against you must succeed at a Physical Defense Check roll against your Use Magic check or else suffer a 1d6 loss to Ticker Value for each instance of contact. While Bathed in Light is active, you also automatically gain all of the abilities from the Feature Primal Light without having to decrease your current Charge. Bathed in Light remains active for 6 rounds + the Charge cost. When Bathed in Light enters its last round of activity, as a Free Action you may continue the Presence for another 6 rounds by spending 1 additional Charge.",
    "featurePrereq": ["Primal Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "While Bathed in Light is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Shining Bolt. While Shining Bolt is active, you gain the ability to target an ally that you can see within 30’ of yourself with a Shining Bolt of energy that will add +1d6 points to the target’s Ticker Value. You may also use this ability against Undead, Infernal, and Demonic opponents as a Ranged Magic Attack. As a Standard Attack action against 1 such opponent each round, your Shining Bolt will deal +1d6 points of Ticker Value loss on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Shining Bolt must be re-manifested with 1 additional Charge each time your Bathed in Light Power is renewed.",
    "featurePrereq": ["Bathed in Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Shining Blade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Light to enhance your weapon.",
    "featureBenDesc": "If you Manifest Empower Weapon while Bathed in Light is active, your Empowered Weapon will now automatically deal Radiant Damage with each attack and will cause an Undead, Infernal, or Demonic opponent to lose +1d6 points from its Ticker Value as additional damage on all successful Combat Check rolls. Shining Blade does not incur any additional Charge loss to Manifest and remains active as long as Bathed in Light and Empower Weapon are both active.",
    "featurePrereq": ["Empower Weapon", "Bathed in Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Invocation",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, you may add +1d4 to your Use Magic check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Ectomancy"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Primal Fear",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Power of Fear.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to manifest a feeling of dread in Living creatures who interact with you. While Primal Fear is active you gain a +1d4 bonus to all People Skills Check rolls for Intimidation. Also, you may use Primal Fear to target a Living creature that you can see within 20' of yourself. You appear fearsome and intimidating to the target. You may cause the target of this ability to become afraid and unable to take any Attack actions during the current round. Targets affected by this ability may defend against attacks as normal but you gain a +1d4 bonus on all rolls made against the target during the current round. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 20' of you. Each round that Primal Fear is active, you may choose to spend additional Charges to cause the currently affected target to reduce its Current Modifier Value by 1d4 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Fear remains active. You may spend no more than 5 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Primal Fear remains active for 1d4+1 rounds.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Hope and negate the effects of both."
  },
  {
    "featureName": "Dreadful Guise",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Primal Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 1d4+1, to Manifest an Arcane Presence of Primal Fear. This Presence inspires dread in those who see you. While near you, others feel a little frightened. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become afraid and unable to take any attack actions while adjacent to you. Targets affected by this ability may defend against attacks as normal, but you gain a +1d6 bonus to all rolls against such opponents. While Dreadful Guise is active, you also automatically gain all of the abilities from the Feature Primal Fear without having to decrease your current Charge. Dreadful Guise remains active for 6 rounds + the Charge cost. When Dreadful Guise enters its last round of activity, as a Free Action you may continue the Presence for another 6 rounds by spending 1 additional Charge.",
    "featurePrereq": ["Invocation", "Primal Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Dreadful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "While Dreadful Guise is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Dreadful Words. While Dreadful Words is active, you may speak and inspire dread in a targeted Living opponent that is within 20’ of you and that can hear you speak. Your Dreadful Words will cause the target to become fearful and unable to take any Attack Actions for up to 1d6 rounds.  Also, the affected target will suffer a 1d6 point loss to its Modifier Value. Targets affected by this ability may defend against attacks as normal. If the target succeeds at a Spiritual Defense check against your Use Magic check, all effects are halved.  Dreadful Words must be re-manifested with 1 additional Charge each time your Dreadful Guise Power is renewed.",
    "featurePrereq": ["Dreadful Guise"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Primal Hope",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Arcane Power of Hope.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to manifest a feeling of confidence and goodwill in a Living ally that you can see within 20' of yourself. You may cause the target of this ability to gain a +1d4 bonus on all rolls made during the current round. As a free action once per round, you may change the target of this ability to another Living creature that you can see within 20' of you. Each round that Primal Hope is active, you may choose to touch the current target and spend additional Charges to increase its Current Modifier Value by 1d4 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Hope remains active and you are not currently engaged in Combat. You may spend no more than 5 Charges on this action each round. Also, While Primal Hope is active you gain a +1d4 bonus to all People Skills Check rolls for Diplomacy.  Once Manifested, Primal Hope remains active for 1d4+1 rounds.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Fear and negate the effects of both."
  },
  {
    "featureName": "Confident Demeanor",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Hope to inspire goodwill.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 1d4+1, to Manifest an Arcane Presence of Primal Hope. This Presence inspires feelings of optimism and confidence within those who see you. While near you, others feel a little encouraged. Companions standing adjacent to you gain a +1d6 bonus to all rolls while positioned next to you. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else decide that you are not an enemy and choose a different opponent. Targets affected by this ability subsequently attacked by you cannot be affected by this ability again during the Current Encounter. While Confident Demeanor is active, you also automatically gain all of the abilities from the Feature Primal Hope without having to decrease your current Charge. Confident Demeanor remains active for 6 rounds + the Charge cost. When Confident Demeanor enters its last round of activity, as a Free Action you may continue the Presence for another 6 rounds by spending 1 additional Charge.",
    "featurePrereq": ["Invocation", "Primal Hope"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Encouraging Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Hope to bolster your allies.",
    "featureBenDesc": "While Confident Demeanor is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Encouraging Words. While Encouraging Words is active, you may take a Standard Action to speak and inspire self-confidence in a targeted Living creature that is within 20’ of you and that can hear you speak. Your Encouraging Words will cause the target to become hopeful and gain a +1d6 point increase to its Modifier Value. Encouraging Words must be re-manifested with 1 additional Charge each time your Confident Demeanor Power is renewed.",
    "featurePrereq": ["Confident Demeanor"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Primal Anger",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Arcane Power of Anger.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to manifest feelings of hatred and rage in a Living creature that you can see within 20' of yourself. You may cause the target of this ability to gain a +1d4 bonus to all Melee Combat rolls and +1d4 to additional damage dealt by Melee Combat made during the current round. As a free action once per round, you may change the target of this ability to another Living creature that you can see within 20' of you. Each round that Primal Anger is active, you may choose to touch the current target and spend additional Charges to increase its Current Modifier Value by 1d4 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Anger remains active and you are not currently engaged in Combat. You may spend no more than 5 Charges on this action each round. Also, While Primal Anger is active you gain a +1d4 bonus to your Ticker Value.  Once Manifested, Primal Anger remains active for 1d4+1 rounds.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Tranquility and negate the effects of both."
  },
  {
    "featureName": "Bad Attitude",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 1d4+1, to Manifest an Arcane Presence of Primal Anger. This Presence inspires feelings of frustration and rage within those who see you. While near you, others feel a little upset. Companions standing adjacent to you gain a +1d6 bonus to all Melee Combat rolls and additional damage from Melee combat while positioned next to you. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become irrationally angry and attack some other random combat participant. Targets affected by this ability subsequently attacked by you cannot be affected by this ability again during the Current Encounter. While Bad Attitude is active, you also automatically gain all of the abilities from the Feature Primal Anger without having to decrease your current Charge. Bad Attitude remains active for 6 rounds + the Charge cost. When Bad Attitude enters its last round of activity, as a Free Action you may continue the Presence for another 6 rounds by spending 1 additional Charge.",
    "featurePrereq": ["Invocation", "Primal Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presence active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Hateful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Anger to empower your allies.",
    "featureBenDesc": "While Bad Attitude is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Hateful Words. While Hateful Words is active, you may take a Standard Action to speak and inspire rage in a targeted Living creature that is within 20’ of you and that can hear you speak. Your Hateful Words will cause the target to become Enraged and gain a +1d6 bonus to Melee Combat rolls and +1d6 additional damage dealt by a successful Melee attack. Hateful Words must be re-manifested with 1 additional Charge each time your Bad Attitude Power is renewed.",
    "featurePrereq": ["Bad Attitude"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Primal Tranquility",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Arcane Power of Tranquility.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 30' of yourself. While targeted by this ability, the target no longer wishes to engage in combat during the current round and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 30' of you. Initially, Primal Tranquility lasts for a number of rounds equal to your Use Magic Check roll result, but may be Extended as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. As a Partial Action once per round while Primal Tranquility is active, if you spend an additional Charge and succeed at a Use Magic check against a Living target's Spiritual Defense Check, the target will refuse to participate in Combat until Primal Tranquility is no longer active. If the affected target is under the effect of Battle Rage, it will now no longer be considered Enraged.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Anger and negate the effects of both."
  },
  {
    "featureName": "Calming Presence",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Tranquility to empower your actions and calm the minds of your enemies.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Tranquility. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Calming Presence ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and move away unless attacked. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Battle Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Calming Presence, you automatically manifest the Feature Primal Tranquility without having to decrease your current Charge.",
    "featurePrereq": ["Invocation", "Primal Tranquility"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presence active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Peaceful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Tranquility to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Calming Presence, you may decrease your Charge Count by 1 to speak and inspire Tranquility in a targeted Living opponent. The Peaceful Words lasts while your current Calming Presence is active. Peaceful Words must be re-manifested with 1 additional Charge each time your Presence is renewed. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat and move away. If attacked the opponent will defend, but not deal combat damage. An opponent in Battle Rage is no longer Enraged.",
    "featurePrereq": ["Calming Presence"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Novice Sorcerer",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have learned what it is to be a Sorcerer.",
    "featureBenDesc": "Gain a +1d4 bonus to your Use Magic Check rolls when attempting to use an Arcane Power ability.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Sorcery",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have improved your ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Enhanced Arcane Powers. Your Sorcery bonus die to Charge Count has increase from 1d4 to 1d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Empower Weapon",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane or Weapon, your Empower Weapon ability Arcane Enhancement bonus die has increased from +1d4 to +1d6. The effect now lasts until the end of the Current Encounter.",
    "featurePrereq": ["Empower Weapon", "Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Novice Evoker",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have improved your ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d6 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Evocation", "Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Enhanced Darkness",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Enhanced Arcane Powers of Darkness.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to diminish or remove light from an area with a radius of up to 5' centered on a point that you can see within 50' of yourself. As a free action once per round while Enhanced Darkness is active, you may increase or decrease the level of darkness within the affected area from dim to complete darkness. Also, while this is active you gain the ability to see in darkness without penalty to your vision. Each round that Primal Darkness is active, you may choose to spend additional Charges to cause all creatures within your Darkness to reduce their Current Ticker Values by 1d6 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Darkness remains active. You may spend no more than 5 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Enhanced Darkness remains active for 1d6+2 rounds.",
    "featurePrereq": ["Primal Darkness", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Light and negate the effects of both. This will overpower and negate the effects of Primal Light."
  },
  {
    "featureName": "Deeper Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Darkness to shroud and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 2d4+2, to Manifest an Arcane Presence of Enhanced Darkness. This Presence rises up around you to dim the level of all light within your Reach. While this Presence is active you gain 25% Concealment against all Ranged and Melee attacks. Also, Living creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d8 points of loss from Ticker Value for each instance of contact. While Deeper Darkness is active, you also automatically gain all of the abilities from the Feature Enhanced Darkness without having to decrease your current Charge. Deeper Darkness remains active until the end of the Current Encounter + a number of rounds equal to its Charge cost.",
    "featurePrereq": ["Cloaked by Darkness", "Enhanced Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Darkness to attack your foes.",
    "featureBenDesc": "While Deeper Darkness is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Improved Darkbolt. While Improved Darkbolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against 1 opponent each round. Your Darkbolt will deal +1d8 points of Ticker Value loss on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage.",
    "featurePrereq": ["Darkbolt", "Deeper Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Darkblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Darkness to enhance your weapon.",
    "featureBenDesc": "If you Manifest Improved Empower Weapon while Deeper Darkness is active, your Improved Empowered Weapon will now automatically deal Shadow Damage with each attack and will cause a Living opponent to lose +1d8 points from its Ticker Value as additional damage on all successful Combat Check rolls. Improved Darkblade does not incur any additional Charge loss to Manifest and remains active as long as Deeper Darkness and Improved Empower Weapon are both active.",
    "featurePrereq": ["Darkblade", "Improved Empower Weapon", "Deeper Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Enhanced Flame",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Enhanced Flame.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to raise the ambient temperature in an area with a radius of up to 5' centered on a point that you can see within 50' of yourself. As a free action once per round while Enhanced Flame is active, you may increase or decrease the level of heat within the affected area from warm to uncomfortably hot. Also, while this is active you gain the ability to light candles, torches, or campfires with a touch. Each round that Enhanced Flame is active, you may choose to spend additional Charges to cause all creatures within your Heat to reduce their Current Health Values by 1d6 points of Fire Damage for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Enhanced Flame remains active. You may spend no more than 5 Charges on this action each round. Targeted individuals are allowed a Physical Defense Check roll against your Use Magic check in order to negate this damage.  Once Manifested, Enhanced Flame remains active for 1d6+2 rounds.",
    "featurePrereq": ["Primal Flame", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Frost and negate the effects of both. This will overpower and negate the effects of Primal Frost."
  },
  {
    "featureName": "Hotter Flames",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Flame to surround and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 2d4+2, to Manifest an Arcane Presence of Enhanced Flame. This Presence ignites around you and wraps your form in spectral fire.  While near you, others feel a warmer. While this Presence is active you gain a 50% reduction of all Fire damage that would be dealt to you. Also, creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d8 points of Fire damage for each instance of contact. While Hotter Flame is active, you also automatically gain all of the abilities from the Feature Enhanced Flame without having to decrease your current Charge. Hotter Flame remains active until the end of the Current Encounter + a number of rounds equal to its Charge cost.",
    "featurePrereq": ["Wreathed in Flames", "Enhanced Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Flame to attack your foes.",
    "featureBenDesc": "While Hotter Flames is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Improved Flamebolt. While Improved Flamebolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against 1 opponent each round. Your Flamebolt will deal +1d8 points of additional Fire damage on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Improved Firebolt must be re-manifested with 1 additional Charge each time your Hotter Flames Power is renewed.",
    "featurePrereq": ["Flamebolt", "Hotter Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Flameblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Flame to enhance your weapon.",
    "featureBenDesc": "If you Manifest Improved Empower Weapon while Hotter Flames is active, your Improved Empowered Weapon will now automatically deal Fire Damage with each attack and will inflict +1d8 points of additional Fire damage on all successful Combat Check rolls. Improved Fireblade does not incur any additional Charge loss to Manifest and remains active as long as Hotter Flames and Improved Empower Weapon are both active.",
    "featurePrereq": ["Flameblade", "Improved Empower Weapon", "Hotter Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Enhanced Frost",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Enhanced Frost.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to lower the ambient temperature in an area with a radius of up to 5' centered on a point that you can see within 50' of yourself. As a free action once per round while Enhanced Frost is active, you may increase or decrease the temperature within the affected area from cool to uncomfortably cold. Also, while this is active you gain the ability to chill items or freeze small amounts of water with a touch. Enough water may be frozen by this ability to create a walkable path over slowly moving water for yourself and adjacent companions. Each round that Enhanced Frost is active, you may choose to spend additional Charges to cause all creatures within your Cold to reduce their Current Health Values by 1d6 points of Cold Damage for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Enhanced Frost remains active. You may spend no more than 5 Charges on this action each round. Targeted individuals are allowed a Physical Defense Check roll against your Use Magic check in order to negate this damage.  Once Manifested, Enhanced Frost remains active for 1d6+2 rounds.",
    "featurePrereq": ["Primal Frost", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Flame and negate the effects of both. This will overpower and negate the effects of Primal Flame."
  },
  {
    "featureName": "Colder Ice",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Enhanced Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 2d4+2, to Manifest an Arcane Presence of Enhanced Frost. This Presence condenses around you and covers your form in spectral ice.  While near you, others feel colder. While this Presence is active you gain a 50% reduction to all Cold damage that would be dealt to you. Also, creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d8 points of Cold damage for each instance of contact. While Colder Ice is active, you also automatically gain all of the abilities from the Feature Enhanced Frost without having to decrease your current Charge. Colder Ice remains active until the end of the Current Encounter + a number of rounds equal to its Charge cost.",
    "featurePrereq": ["Encased in Ice", "Enhanced Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Frostbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Frost to attack your foes.",
    "featureBenDesc": "While Colder Ice is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Improved Frostbolt. While Improved Frostbolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against 1 opponent each round. Your Improved Frostbolt will deal +1d8 points of additional Cold damage on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Improved Frostbolt must be re-manifested with 1 additional Charge each time your Colder Ice Power is renewed.",
    "featurePrereq": ["Frostbolt", "Colder Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Frostblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Frost to enhance your weapon.",
    "featureBenDesc": "If you Manifest Improved Empower Weapon while Colder Ice is active, your Improved Empowered Weapon will now automatically deal Cold Damage with each attack and will inflict +1d8 points of additional Cold damage on all successful Combat Check rolls. Improved Frostblade does not incur any additional Charge loss to Manifest and remains active as long as Colder Ice and Improved Empower Weapon are both active.",
    "featurePrereq": ["Frostblade", "Improved Empower Weapon", "Colder Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Enhanced Light",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Enhanced Light.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to radiate or brighten light in an area with a radius of up to 5' centered on a point that you can see within 50' of yourself. As a free action once per round while Enhanced Light is active, you may increase or decrease the level of light within the affected area from dim to fully lit. Also, while this is active you gain the ability to gently float one handspan above any vertical surface on which you would normally stand. While floating, you may move at your normal Speed. This ability will work over gently moving water and mud. Each round that Enhanced Light is active, you may choose to spend additional Charges to cause all creatures within your Light to add +1d6 to their Ticker Values for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Enhanced Light remains active. You may spend no more than 5 Charges on this action each round. Undead, Infernal, and Demonic creatures affected by this ability suffer a 1d6 loss to Ticker Value and are allowed a Physical Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Enhanced Light remains active for 1d6+2 rounds.",
    "featurePrereq": ["Primal Light", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Darkness and negate the effects of both. This will overpower and negate the effects of Primal Darkness."
  },
  {
    "featureName": "Brighter Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Primal Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 2d4+2, to Manifest an Arcane Presence of Enhanced Light. This Presence radiates from you and illuminates all within your Reach.  While near you, others feel invigorated. While this Presence is active you gain 25% Block against all Ranged and Melee attacks. Also, allies who you Touch may add 1d8 points to Ticker Value. You may use this beneficial touch effect once per round as a partial action only if you are not engaged in combat during the current round. Undead, Infernal, and Demonic creatures that you touch, that touch you without permission, or that succeed at a Melee Attack Combat check against you must succeed at a Physical Defense Check roll against your Use Magic check or else suffer a 1d8 loss to Ticker Value for each instance of contact. While Brighter Light is active, you also automatically gain all of the abilities from the Feature Enhanced Light without having to decrease your current Charge. Brighter Light remains active until the end of the Current Encounter + a number of rounds equal to its Charge cost.",
    "featurePrereq": ["Bathed in Light", "Enhanced Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "While Brighter Light is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Improved Shining Bolt. While Improved Shining Bolt is active, you gain the ability to target an ally that you can see within 30’ of yourself with a Shining Bolt of energy that will add +1d8 points to the target’s Ticker Value. You may also use this ability against Undead, Infernal, and Demonic opponents as a Ranged Magic Attack. As a Standard Attack action against 1 such opponent each round, your Shining Bolt will deal +1d8 points of Ticker Value loss on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Shining Bolt must be re-manifested with 1 additional Charge each time your Brighter Light Power is renewed.",
    "featurePrereq": ["Shining Bolt", "Brighter Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Shining Blade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Light to enhance your weapon.",
    "featureBenDesc": "If you Manifest Improved Empower Weapon while Brighter Light is active, your Improved Empowered Weapon will now automatically deal Radiant Damage with each attack and will cause an Undead, Infernal, or Demonic opponent to lose +1d8 points from its Ticker Value as additional damage on all successful Combat Check rolls. Improved Shining Blade does not incur any additional Charge loss to Manifest and remains active as long as Brighter Light and Improved Empower Weapon are both active.",
    "featurePrereq": ["Shining Blade", "Improved Empower Weapon", "Brighter Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Novice Invoker",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have improved the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d6 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Invocation", "Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Enhanced Fear",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Power of Fear.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to manifest a feeling of dread in Living creatures who interact with you. While Enhanced Fear is active you gain a +1d6 bonus to all People Skills Check rolls for Intimidation. Also, you may use Enhanced Fear to target a Living creature that you can see within 30' of yourself. You appear fearsome and intimidating to the target. You may cause the target of this ability to become afraid and unable to take any Attack actions during the current round. Targets affected by this ability may defend against attacks as normal but you gain a +1d6 bonus on all rolls made against the target during the current round. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 30' of you. Each round that Enhanced Fear is active, you may choose to spend additional Charges to cause the currently affected target to reduce its Current Modifier Value by 1d6 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Enhanced Fear remains active. You may spend no more than 5 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Enhanced Fear remains active for 1d6+2 rounds.",
    "featurePrereq": ["Primal Fear", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Hope and negate the effects of both. This will overpower and negate the effects of Primal Hope."
  },
  {
    "featureName": "Deeper Dread",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Enhanced Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 2d4+2, to Manifest an Arcane Presence of Enhanced Fear. This Presence inspires dread in those who see you. While near you, others feel frightened. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become afraid and unable to take any attack actions while adjacent to you. Targets affected by this ability may defend against attacks as normal, but you gain a +1d8 bonus to all rolls against such opponents. While Deeper Dread is active, you also automatically gain all of the abilities from the Feature Enhanced Fear without having to decrease your current Charge. Deeper Dread remains active until the end of the Current Encounter + a number of rounds equal to its Charge cost.",
    "featurePrereq": ["Dreadful Guise", "Enhanced Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "More Dreadful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Fear to gain strength over your enemies.",
    "featureBenDesc": "While Deeper Dread is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of More Dreadful Words. While More Dreadful Words is active, you may speak and inspire dread in a targeted Living opponent that is within 30’ of you and that can hear you speak. Your More Dreadful Words will cause the target to become fearful and unable to take any Attack Actions for up to 1d8 rounds.  Also, the affected target will suffer a 1d8 point loss to its Modifier Value. Targets affected by this ability may defend against attacks as normal. If the target succeeds at a Spiritual Defense check against your Use Magic check, all effects are halved.  More Dreadful Words must be re-manifested with 1 additional Charge each time your Deeper Dread is renewed.",
    "featurePrereq": ["Dreadful Words", "Deeper Dread"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Enhanced Hope",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Hope.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to manifest a feeling of confidence and goodwill in a Living ally that you can see within 30' of yourself. You may cause the target of this ability to gain a +1d6 bonus on all rolls made during the current round. As a free action once per round, you may change the target of this ability to another Living creature that you can see within 30' of you. Each round that Enhanced Hope is active, you may choose to touch the current target and spend additional Charges to increase its Current Modifier Value by 1d6 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Enhanced Hope remains active and you are not currently engaged in Combat. You may spend no more than 5 Charges on this action each round. Also, While Enhanced Hope is active you gain a +1d6 bonus to all People Skills Check rolls for Diplomacy. Once Manifested, Enhanced Hope remains active for 1d6+2 rounds.",
    "featurePrereq": ["Primal Hope", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Fear and negate the effects of both. This will overpower and negate the effects of Primal Fear."
  },
  {
    "featureName": "Greater Confidence",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Enhanced Power of Hope to guide others and inspire affection.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 2d4+2, to Manifest an Arcane Presence of Enhanced Hope. This Presence inspires feelings of optimism and confidence within those who see you. Companions standing adjacent to you gain a +1d8 bonus to all rolls while positioned next to you. While near you, others feel a little encouraged. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else decide that you are not an enemy and choose a different opponent. Targets affected by this ability subsequently attacked by you cannot be affected by this ability again during the Current Encounter. While Greater Confidence is active, you also automatically gain all of the abilities from the Feature Enhanced Hope without having to decrease your current Charge. Greater Confidence remains active remains active until the end of the Current Encounter + a number of rounds equal to its Charge cost.",
    "featurePrereq": ["Confident Demeanor", "Enhanced Hope"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "More Encouraging Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Hope to bolster your allies.",
    "featureBenDesc": "While Greater Confidence is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of More Encouraging Words. While More Encouraging Words is active, you may take a Standard Action to speak and inspire self-confidence in a targeted Living creature that is within 30’ of you and that can hear you speak. Your More Encouraging Words will cause the target to become hopeful and gain a +1d8 point increase to its Modifier Value.",
    "featurePrereq": ["Encouraging Words", "Greater Confidence"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Enhanced Anger",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Anger.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to manifest feelings of hatred and rage in a Living creature that you can see within 30' of yourself. You may cause the target of this ability to gain a +1d6 bonus to all Melee Combat rolls and +1d6 to additional damage dealt by Melee Combat made during the current round. As a free action once per round, you may change the target of this ability to another Living creature that you can see within 30' of you. Each round that Enhanced Anger is active, you may choose to touch the current target and spend additional Charges to increase its Current Modifier Value by 1d6 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Enhanced Anger remains active and you are not currently engaged in Combat. You may spend no more than 5 Charges on this action each round. Also, While Enhanced Anger is active you gain a +1d6 bonus to your Ticker Value.  Once Manifested, Enhanced Anger remains active for 1d6+2 rounds.",
    "featurePrereq": ["Primal Anger", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Tranquility and negate the effects of both. This will overpower and negate the effects of Primal Tranquility."
  },
  {
    "featureName": "Worse Attitude",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Enhanced Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 2d4+2, to Manifest an Arcane Presence of Enhanced Anger. This Presence inspires feelings of frustration and rage within those who see you. While near you, others feel upset. Companions standing adjacent to you gain a +1d8 bonus to all Melee Combat rolls and additional damage from Melee combat while positioned next to you. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become irrationally angry and attack some other random combat participant. Targets affected by this ability subsequently attacked by you cannot be affected by this ability again during the Current Encounter. While Worse Attitude is active, you also automatically gain all of the abilities from the Feature Enhanced Anger without having to decrease your current Charge. Worse Attitude remains active remains active until the end of the Current Encounter + a number of rounds equal to its Charge cost.",
    "featurePrereq": ["Bad Attitude", "Enhanced Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presence active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "More Hateful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Anger to empower your allies.",
    "featureBenDesc": "While Worse Attitude is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of More Hateful Words. While More Hateful Words is active, you may take a Standard Action to speak and inspire rage in a targeted Living creature that is within 30’ of you and that can hear you speak. Your More Hateful Words will cause the target to become Enraged and gain a +1d8 bonus to Melee Combat rolls and +1d8 additional damage dealt by a successful Melee attack.",
    "featurePrereq": ["Hateful Words", "Worse Attitude"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Enhanced Tranquility",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Tranquility.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 50' of yourself. While targeted by this ability, the target no longer wishes to engage in combat and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 50' of you. The ability will last until the end of the Current Encounter. Also, if you succeed at a Melee Combat Touch attack against a Living Target, the target will disengage from Combat until the end of the Encounter. Opponents under the effect of Violent Rage will no longer be considered Enraged. The target may only benefit from this Touch once per Encounter. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Primal Tranquility", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Anger and negate the effects of both. This will overpower and negate the effects of Primal Anger."
  },
  {
    "featureName": "Greater Peace",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Enhanced Power of Tranquility to empower your actions and calm the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Tranquility. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts until the end of the Current Encounter. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and move away unless attacked. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Violent Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Greater Peace, you automatically gain the effects from the Feature Enhanced Tranquility without having to decrease your current Charge.",
    "featurePrereq": ["Calming Presence", "Enhanced Tranquility"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presence active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "More Peaceful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Tranquility to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Greater Peace, you may decrease your Charge Count by 1 to speak and inspire Tranquility in a targeted Living opponent. The ability lasts as long as your current Greater Peace effect. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat and move away. If attacked the opponent will defend, but not deal combat damage. An opponent in Violent Rage is no longer Enraged.",
    "featurePrereq": ["Peacful Words", "Greater Peace"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Sorcerer",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have become an actual Sorcerer.",
    "featureBenDesc": "Your Novice Sorcerer bonus die increases from 1d4 to 1d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Sorcery",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have advanced in your ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Expanded Arcane Powers. Your Sorcery bonus die to Charge Count has increase from 1d6 to 1d8.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Empower Weapon",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane Weapon, your Empower Weapon ability Arcane Enhancement bonus die has increased from +1d6 to +1d8.",
    "featurePrereq": ["Improved Empower Weapon", "Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Evoker",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have advanced in your ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d8 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Evoker", "Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Expanded Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Expanded Arcane Powers of Darkness.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to diminish or remove light from an area with a radius of up to 10' centered on a point that you can see within 100' of yourself. As a free action once per round while Expanded Darkness is active, you may increase or decrease the level of darkness within the affected area from dim to complete darkness and move the Darkness to another point within 30’ of the original position. Also, while this is active you gain the ability to see in darkness without penalty to your vision. Each round that Primal Darkness is active, you may choose to spend additional Charges to cause all creatures within your Darkness to reduce their Current Ticker Values by 1d8 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Darkness remains active. You may spend no more than 10 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Expanded Darkness remains active for 1d8+3 rounds.",
    "featurePrereq": ["Enhanced Darkness", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Light and negate the effects of both. This will overpower and negate the effects of Enhanced Light."
  },
  {
    "featureName": "Deepest Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Darkness to shroud and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 3d4+3, to Manifest an Arcane Presence of Expanded Darkness. This Presence rises up around you to dim the level of all light within your Reach. While this Presence is active you gain 50% Concealment against all Ranged and Melee attacks. Also, Living creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d10 points of loss from Ticker Value for each instance of contact. While Deepest Darkness is active, you also automatically gain all of the abilities from the Feature Expanded Darkness without having to decrease your current Charge. Deepest Darkness remains active for 4 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Deeper Darkness", "Expanded Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Darkness to attack your foes.",
    "featureBenDesc": "While Deepest Darkness is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Advanced Darkbolt. While Advanced Darkbolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against up to 2 opponents each round. Your Darkbolt will deal +2d6 points of Ticker Value loss on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Loss to Ticker Value may be divided as you wish between affected targets after Combat damage is assigned.",
    "featurePrereq": ["Improved Darkbolt", "Deepest Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Darkblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Darkness to enhance your weapon.",
    "featureBenDesc": "If you Manifest Advanced Empower Weapon while Deepest Darkness is active, your Advanced Empowered Weapon will now automatically deal Shadow Damage with each attack and will cause a Living opponent to lose +1d10 points from its Ticker Value as additional damage on all successful Combat Check rolls. Advanced Darkblade does not incur any additional Charge loss to Manifest and remains active as long as Deepest Darkness and Advanced Empower Weapon are both active.",
    "featurePrereq": ["Improved Darkblade", "Advanced Empower Weapon", "Deepest Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Expanded Flame",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Expanded Flame.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to raise the ambient temperature in an area with a radius of up to 10' centered on a point that you can see within 100' of yourself. As a free action once per round while Expanded Flame is active, you may increase or decrease the level of heat within the affected area from warm to uncomfortably hot. Also, while this is active you gain the ability to light candles, torches, or campfires with a touch. Each round that Expanded Flame is active, you may choose to spend additional Charges to cause all creatures within your Heat to reduce their Current Health Values by 1d8 points of Fire Damage for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Expanded Flame remains active. You may spend no more than 10 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Expanded Flame remains active for 1d8+3 rounds.",
    "featurePrereq": ["Enhanced Flame", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Frost and negate the effects of both. This will overpower and negate the effects of Enhanced Frost."
  },
  {
    "featureName": "Hottest Flames",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "As a Full Round action, decrease your Charge Count by 2d4+2, to Manifest an Arcane Presence of Expanded Flame. This Presence ignites around you and wraps your form in spectral fire.  While near you, others feel quite warm. While this Presence is active you gain a 75% reduction to all Fire damage that would be dealt to you. Also, creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d10 points of Fire damage for each instance of contact. While Hottest Flames is active, you also automatically gain all of the abilities from the Feature Expanded Flame without having to decrease your current Charge. Hottest Flames remains active until the end of the Current Encounter + a number of rounds equal to its Charge cost.",
    "featurePrereq": ["Hotter Flames", "Expanded Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Flame to attack your foes.",
    "featureBenDesc": "While Hottest Flames is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Advanced Flamebolt. While Advanced Flamebolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against up to 2 opponents each round. Your Advanced Flamebolt will deal +2d6 points of Fire damage on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. The additional Fire damage may be divided as you wish between affected targets after Combat damage is assigned. Advanced Firebolt must be re-manifested with 1 additional Charge each time your Hottest Flames Power is renewed.",
    "featurePrereq": ["Improved Flamebolt", "Hottest Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Flameblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Flame to enhance your weapon.",
    "featureBenDesc": "If you Manifest Advanced Empower Weapon while Hottest Flames is active, your Advanced Empowered Weapon will now automatically deal Fire Damage with each attack and will inflict +1d10 points of additional Fire damage on all successful Combat Check rolls. Advanced Fireblade does not incur any additional Charge loss to Manifest and remains active as long as Hottest Flames and Advanced Empower Weapon are both active.",
    "featurePrereq": ["Improved Flameblade", "Advanced Empower Weapon", "Hottest Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Expanded Frost",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Expanded Frost.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to lower the ambient temperature in an area with a radius of up to 10' centered on a point that you can see within 100' of yourself. As a free action once per round while Expanded Frost is active, you may increase or decrease the temperature within the affected area from cool to very cold. Also, while this is active you gain the ability to chill items or freeze small amounts of water with a touch. Enough water may be frozen by this ability to create a walkable path over quickly moving water for yourself and all companions within 10’ of you. Each round that Expanded Frost is active, you may choose to spend additional Charges to cause all creatures within your Cold to reduce their Current Health Values by 1d8 points of Cold Damage for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Expanded Frost remains active. You may spend no more than 10 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Expanded Frost remains active for 1d8+3 rounds.",
    "featurePrereq": ["Enhanced Frost", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Flame and negate the effects of both. This will overpower and negate the effects of Enhanced Flame."
  },
  {
    "featureName": "Coldest Ice",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Expanded Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 3d4+3, to Manifest an Arcane Presence of Expanded Frost. This Presence condenses around you and covers your form in spectral ice.  While near you, others quite cold. While this Presence is active you gain a 75% reduction to all Cold damage that would be dealt to you. Also, creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d10 points of Cold damage for each instance of contact. While Coldest Ice is active, you also automatically gain all of the abilities from the Feature Expanded Frost without having to decrease your current Charge. Coldest Ice remains active for 4 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Colder Ice", "Expanded Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Frostbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Frost to attack your foes.",
    "featureBenDesc": "While Coldest Ice is active, as a Partial action you may decrease your Charge Count by 1 to Manifest the Arcane Power of Advanced Frostbolt. While Advanced Frostbolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against up to 2 opponents each round. Your Advanced Frostbolt will deal +2d6 points of Cold damage on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. The additional Cold damage may be divided as you wish between affected targets after Combat damage is assigned. Advanced Frostbolt must be re-manifested with 1 additional Charge each time your Coldest Ice Power is renewed.",
    "featurePrereq": ["Improved Frostbolt", "Coldest Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Frostblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Frost to enhance your weapon.",
    "featureBenDesc": "If you Manifest Advanced Empower Weapon while Coldest Ice is active, your Advanced Empowered Weapon will now automatically deal Cold Damage with each attack and will inflict +1d10 points of additional Cold damage on all successful Combat Check rolls. Advanced Frostblade does not incur any additional Charge loss to Manifest and remains active as long as Coldest Ice and Advanced Empower Weapon are both active.",
    "featurePrereq": ["Improved Frostblade", "Advanced Empower Weapon", "Coldest Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Expanded Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Expanded Light.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to radiate or brighten light in an area with a radius of up to 10' centered on a point that you can see within 100' of yourself. As a free action once per round while Expanded Light is active, you may increase or decrease the level of Light within the affected area from dim to fully lit and move the Light to another point within 30’ of the original position. Also, while this is active you gain the ability to gently float one handspan above any vertical surface on which you would normally stand. While floating, you may move at your normal Speed. This ability will work over swiftly moving water and mud. Each round that Expanded Light is active, you may choose to spend additional Charges to cause all creatures within your Light to add +1d8 to their Ticker Values for each Charge spent this way. Creatures affected by this ability are infused by your Light and gain the ability to float as described above while within the area of your Expanded Light. You may do this once per round as a Partial Action for as long as your Expanded Light remains active. You may spend no more than 10 Charges on this action each round. Undead, Infernal, and Demonic creatures affected by this ability suffer a 1d8 loss to Ticker Value and are allowed a Physical Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Expanded Light remains active for 1d8+3 rounds.",
    "featurePrereq": ["Enhanced Light", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Darkness and negate the effects of both. This will overpower and negate the effects of Enhanced Darkness."
  },
  {
    "featureName": "Brightest Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Expanded Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 3d4+3, to Manifest an Arcane Presence of Expanded Light. This Presence radiates from you and illuminates all within your Reach. While near you, others feel quite invigorated. While this Presence is active you gain 50% Block against all Ranged and Melee attacks. Also, allies who you Touch may add 1d10 points to Ticker Value. You may use this beneficial touch effect once per round as a partial action only if you are not engaged in combat during the current round. Undead, Infernal, and Demonic creatures that you touch, that touch you without permission, or that succeed at a Melee Attack Combat check against you must succeed at a Physical Defense Check roll against your Use Magic check or else suffer a 1d10 loss to Ticker Value for each instance of contact. While Brightest Light is active, you also automatically gain all of the abilities from the Feature Expanded Light without having to decrease your current Charge. Deepest Light remains active for 4 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Brighter Light", "Expanded Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "While Brightest Light is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Advanced Shining Bolt. While Advanced Shining Bolt is active, you gain the ability to target up to 2 allies that you can see within 30’ of yourself and each other with a Shining Bolt of energy that will add +1d8 points to each target’s Ticker Value. You may also use this ability against Undead, Infernal, and Demonic opponents as a Ranged Magic Attack. As a Standard Attack action against 2 such opponents each round, your Advanced Shining Bolt will deal +1d8 points of Ticker Value loss to each affected target on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Advanced Shining Bolt must be re-manifested with 1 additional Charge each time your Brightest Light Power is renewed.",
    "featurePrereq": ["Improved Shining Bolt", "Brightest Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Shining Blade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Light to enhance your weapon.",
    "featureBenDesc": "If you Manifest Advanced Empower Weapon while Brightest Light is active, your Advanced Empowered Weapon will now automatically deal Radiant Damage with each attack and will cause an Undead, Infernal, or Demonic opponent to lose +1d10 points from its Ticker Value as additional damage on all successful Combat Check rolls. Advanced Shining Blade does not incur any additional Charge loss to Manifest and remains active as long as Brightest Light and Advanced Empower Weapon are both active.",
    "featurePrereq": ["Improved Shining Blade", "Advanced Empower Weapon", "Brightest Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Invoker",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have advanced in the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d8 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Invoker", "Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Expanded Fear",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Power of Fear.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to manifest a feeling of dread in Living creatures who interact with you. While Enhanced Fear is active you gain a +1d8 bonus to all People Skills Check rolls for Intimidation. Also, you may use Expanded Fear to target all Living creatures within a 10’ radius that you can see within 50' of yourself. You appear fearsome and intimidating to the targets. You may cause the targets of this ability to become afraid and unable to take any Attack actions during the current round. Targets affected by this ability may defend against attacks as normal but you gain a +1d8 bonus on all rolls made against any of the targets during the current round. As a free action once per round, you may change the area of this ability to another 10’ radius area that you can see within 50' of you. Each round that Expanded Fear is active, you may choose to spend additional Charges to cause the currently affected targets to reduce their Current Modifier Values by 1d8 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Expanded Fear remains active. You may spend no more than 10 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Expanded Fear remains active for 1d8+3 rounds.",
    "featurePrereq": ["Enhanced Fear", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Hope and negate the effects of both. This will overpower and negate the effects of Enhanced Hope."
  },
  {
    "featureName": "Deepest Dread",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 3d4+3, to Manifest an Arcane Presence of Expanded Fear. This Presence inspires dread in those who see you. While near you, others feel quite frightened. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become afraid and unable to take any actions while adjacent to you. You gain a +1d10 bonus to all rolls against such opponents. While Deepest Dread is active, you also automatically gain all of the abilities from the Feature Expanded Fear without having to decrease your current Charge. Deepest Dread remains active for 4 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Deeper Dread", "Expanded Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Most Dreadful Words",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Fear to gain strength over your enemies.",
    "featureBenDesc": "While Deepest Dread is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Most Dreadful Words. While Most Dreadful Words is active, you may speak and inspire dread in up to 2 targeted Living opponents that are within 30’ of you and that can hear you speak. Your Most Dreadful Words will cause the targets to become fearful and only able to take Move actions for up to 1d10 rounds.  Also, the affected targets will suffer a 1d10 point loss to their Modifier Values. If the target succeeds at a Spiritual Defense check against your Use Magic check, all effects are halved.  Most Dreadful Words must be re-manifested with 1 additional Charge each time your Deepest Dread is renewed.",
    "featurePrereq": ["More Dreadful Words", "Deepest Dread"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Expanded Hope",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Expanded Arcane Power of Hope.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to manifest a feeling of confidence and goodwill in all Living creatures that you can see within a 10’ radius 50' of yourself. You may cause the targets of this ability to gain a +1d8 bonus on all rolls made during the current round. As a free action once per round, you may change the target of this ability to another 10’ radius area that you can see within 50' of you. Each round that Expanded Hope is active, you may choose to touch one of the current targets and spend additional Charges to increase its Current Modifier Value by 1d8 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Expanded Hope remains active and you are not currently engaged in Combat. You may spend no more than 10 Charges on this action each round. Also, While Expanded Hope is active you gain a +1d8 bonus to all People Skills Check rolls for Diplomacy.  Once Manifested, Expanded Hope remains active for 1d8+3 rounds.",
    "featurePrereq": ["Enhanced Hope", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Fear and negate the effects of both. This will overpower and negate the effects of Enhanced Fear."
  },
  {
    "featureName": "Greatest Confidence",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Power of Hope to guide others and inspire affection.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 3d4+3, to Manifest an Arcane Presence of Expanded Hope. This Presence inspires feelings of optimism and confidence within those who see you. Companions standing adjacent to you gain a +1d10 bonus to all rolls while positioned next to you. While near you, others feel a little encouraged. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else decide that you are a friend and attempt to convince its allies that you are not an enemy. Targets affected by this ability subsequently attacked by you cannot be affected by this ability again during the Current Encounter. While Greatest Confidence is active, you also automatically gain all of the abilities from the Feature Expanded Hope without having to decrease your current Charge. Greatest Confidence remains active remains active for 4 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Greater Confidence", "Expanded Hope"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Most Encouraging Words",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Hope to bolster your allies.",
    "featureBenDesc": "While Greatest Confidence is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Most Encouraging Words. While Most Encouraging Words is active, you may take a Standard Action to speak and inspire self-confidence in up to 2 targeted Living creatures that are within 50’ of you and that can hear you speak. Your Most Encouraging Words will cause the targets to become hopeful and gain a +1d8 point increase to their Modifier Values.",
    "featurePrereq": ["More Encouraging Words", "Greatest Kindness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Expanded Anger",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Anger.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 1 to manifest feelings of hatred and rage in all Living creatures that you can see in a 10’ radius within 50' of yourself. You may cause the targets of this ability to gain a +1d8 bonus to all Melee Combat rolls and +1d8 to additional damage dealt by Melee Combat made during the current round. As a free action once per round, you may change the 10’ radius location of this ability to another spot that you can see within 30' of you. Each round that Expanded Anger is active, you may choose to touch one of the current targets and spend additional Charges to increase its Current Modifier Value by 1d8 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Expanded Anger remains active and you are not currently engaged in Combat. You may spend no more than 10 Charges on this action each round. Also, While Expanded Anger is active you gain a +1d8 bonus to your Ticker Value.  Once Manifested, Expanded Anger remains active for 1d8+3 rounds.",
    "featurePrereq": ["Enhanced Anger", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Tranquility and negate the effects of both. This will overpower and negate the effects of Enhanced Tranquility."
  },
  {
    "featureName": "Worst Attitude",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Expanded Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 3d4+3, to Manifest an Arcane Presence of Expanded Anger. This Presence inspires feelings of frustration and rage within those who see you. While near you, others feel upset. Companions standing adjacent to you gain a +1d10 bonus to all Melee Combat rolls and additional damage from Melee combat while positioned next to you. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become irrationally angry and attack some other random combat participant. Targets affected by this ability subsequently attacked by you cannot be affected by this ability again during the Current Encounter. While Worst Attitude is active, you also automatically gain all of the abilities from the Feature Expanded Anger without having to decrease your current Charge. Worst Attitude remains active remains active for 4 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Worse Attitude", "Expanded Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presence active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Most Hateful Words",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Anger to empower your allies.",
    "featureBenDesc": "While Worst Attitude is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Most Hateful Words. While Most Hateful Words is active, you may take a Standard Action to speak and inspire rage in up to 2 targeted Living creatures that are within 50’ of you and that can hear you speak. Your Most Hateful Words will cause the targets to become Enraged and gain a +1d8 bonus to Melee Combat rolls and +1d8 additional damage dealt by a successful Melee attack.",
    "featurePrereq": ["More Hateful Words", "Worst Attitude"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Expanded Tranquility",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Expanded Arcane Power of Tranquility.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 100' of yourself. While targeted by this ability, the target no longer wishes to engage in combat and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. The ability will last until the end of the Current Encounter. Also, if you succeed at a Melee Combat Touch attack against a Living Target, the target will disengage from Combat until the end of the Encounter. Opponents under the effect of Blood Rage will no longer be considered Enraged. The target may only benefit from this Touch once per Encounter. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Enhanced Tranquility", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Anger and negate the effects of both. This will overpower and negate the effects of Enhanced Anger."
  },
  {
    "featureName": "Greatest Peace",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Expanded Power of Tranquility to empower your actions and calm the minds of your enemies.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Arcane Presence of Tranquility. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts for 8 hours or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and move away unless attacked. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Blood Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Greatest Peace, you automatically gain the effects from the Feature Expanded Tranquility without having to decrease your current Charge.",
    "featurePrereq": ["Greater Peace", "Expanded Tranquility"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presence active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Most Peaceful Words",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Tranquility to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Greatest Peace, you may decrease your Charge Count by 1 to speak and inspire Tranquility in 2 targeted Living opponents. The ability lasts as long as your current Greatest Peace effect. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat and move away. If attacked the opponent will defend, but not deal combat damage. An opponent in Blood Rage is no longer Enraged.",
    "featurePrereq": ["More Peaceful Words", "Greatest Peace"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Master Sorcerer",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have become a Master Sorcerer.",
    "featureBenDesc": "Your Sorcerer bonus die increases from 1d8 to 1d10.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Sorcery",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have mastered the ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Superior Arcane Powers. Your Sorcery bonus die to Charge Count has increase from 1d10 to 1d12.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Master Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Empower Weapon",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane Weapon, your Empower Weapon ability Arcane Enhancement bonus die has increased from +1d10 to +1d12.",
    "featurePrereq": ["Advanced Empower Weapon", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Master Evoker",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have mastered the ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d10 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Evoker", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Darkness",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Superior Arcane Powers of Darkness.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to diminish or remove light from an area with a radius of up to 15' centered on a point that you can see within 100' of yourself. As a free action once per round while Superior Darkness is active, you may increase or decrease the level of darkness within the affected area from dim to complete darkness and move the Darkness to another point within 30’ of the original position. Also, while this is active you gain the ability to see in darkness without penalty to your vision. Each round that Primal Darkness is active, you may choose to spend additional Charges to cause all creatures within your Darkness to reduce their Current Ticker Values by 1d10 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Darkness remains active. You may spend no more than 10 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Superior Darkness remains active until the end of the Current Encounter.",
    "featurePrereq": ["Expanded Darkness", "Master Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Light and negate the effects of both. This will overpower and negate the effects of Expanded Light."
  },
  {
    "featureName": "Bound By Darkness",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Darkness to shroud and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 4d4+4, to Manifest an Arcane Presence of Superior Darkness. This Presence rises up around you to dim the level of all light within your Reach. While this Presence is active you gain 75% Concealment against all Ranged and Melee attacks. Also, Living creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d12 points of loss from Ticker Value for each instance of contact. While Bound By Darkness is active, you also automatically gain all of the abilities from the Feature Superior Darkness without having to decrease your current Charge. Bound By Darkness remains active for 8 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Deepest Darkness", "Superior Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Superior Darkbolt",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Darkness to attack your foes.",
    "featureBenDesc": "While Bound By Darkness is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Superior Darkbolt. While Superior Darkbolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against up to 3 opponents each round. Your Darkbolt will deal +3d6 points of Ticker Value loss on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Loss to Ticker Value may be divided as you wish among any affected targets after Combat damage is assigned.",
    "featurePrereq": ["Advanced Darkbolt", "Bound By Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Darkblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Darkness to enhance your weapon.",
    "featureBenDesc": "If you Manifest Superior Empower Weapon while Bound By Darkness is active, your Superior Empowered Weapon will now automatically deal Shadow Damage with each attack and will cause a Living opponent to lose +1d12 points from its Ticker Value as additional damage on all successful Combat Check rolls. Superior Darkblade does not incur any additional Charge loss to Manifest and remains active as long as Bound By Darkness and Superior Empower Weapon are both active.",
    "featurePrereq": ["Advanced Darkblade", "Superior Empower Weapon", "Bound By Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Superior Flame",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Superior Flame.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to raise the ambient temperature in an area with a radius of up to 15' centered on a point that you can see within 100' of yourself. As a free action once per round while Superior Flame is active, you may increase or decrease the level of heat within the affected area from warm to uncomfortably hot and move the heated area to another point within 30’ of the original position. Also, while this is active you gain the ability to light candles, torches, or campfires with a touch. Each round that Superior Flame is active, you may choose to spend additional Charges to cause all creatures within your Heat to reduce their Current Health Values by 1d10 points of Fire Damage for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Superior Flame remains active. You may spend no more than 10 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Superior Flame remains active until the end of the Current Encounter.",
    "featurePrereq": ["Expanded Flame", "Master Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Frost and negate the effects of both. This will overpower and negate the effects of Expanded Frost."
  },
  {
    "featureName": "Bound By Flame",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Flame to surround and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 4d4+4, to Manifest an Arcane Presence of Superior Flame. This Presence ignites around you and wraps your form in spectral fire.  While near you, others feel uncomfortably warm. While this Presence is active you gain a 90% reduction to all Fire damage that would be dealt to you. Also, creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d12 points of Fire damage for each instance of contact. While Bound By Flame is active, you also automatically gain all of the abilities from the Feature Superior Flame without having to decrease your current Charge. Bound By Flame remains active for 8 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Hottest Flames", "Superior Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Superior Flamebolt",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Flame to attack your foes.",
    "featureBenDesc": "While Bound By Flame is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Superior Flamebolt. While Superior Flamebolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against up to 3 opponents each round. Your Flamebolt will deal +3d6 points of additional Fire damage on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. The additional Fire damage may be divided as you wish among any affected targets after Combat damage is assigned.",
    "featurePrereq": ["Advanced Flamebolt", "Bound By Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Flameblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Flame to enhance your weapon.",
    "featureBenDesc": "If you Manifest Superior Empower Weapon while Bound By Flame is active, your Superior Empowered Weapon will now automatically deal Fire Damage with each attack and deal +1d12 points of additional Fire damage on all successful Combat Check rolls. Superior Flameblade does not incur any additional Charge loss to Manifest and remains active as long as Bound By Flame and Superior Empower Weapon are both active.",
    "featurePrereq": ["Advanced Flameblade", "Superior Empower Weapon", "Bound By Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Superior Frost",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Superior Frost.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to lower the ambient temperature in an area with a radius of up to 15' centered on a point that you can see within 100' of yourself. As a free action once per round while Superior Frost is active, you may increase or decrease the temperature within the affected area from cool to very cold and move the cooled area to another point within 30’ of the original position. Also, while this is active you gain the ability to chill items or freeze small amounts of water with a touch. Enough water may be frozen by this ability to create a walkable path over rough water for yourself and all companions within 15’ of you. Each round that Superior Frost is active, you may choose to spend additional Charges to cause all creatures within your Cold to reduce their Current Health Values by 1d10 points of Cold Damage for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Superior Frost remains active. You may spend no more than 10 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Superior Frost remains active until the end of the Current Encounter.",
    "featurePrereq": ["Expanded Frost", "Master Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Flame and negate the effects of both. This will overpower and negate the effects of Expanded Flame."
  },
  {
    "featureName": "Bound By Frost",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Expanded Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 5d4+5, to Manifest an Arcane Presence of Superior Frost. This Presence condenses around you and covers your form in spectral ice. While near you, others feel very cold. While this Presence is active you gain a 75% reduction to all Cold damage that would be dealt to you. Also, creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d12 points of Cold damage for each instance of contact. While Bound By Frost is active, you also automatically gain all of the abilities from the Feature Superior Frost without having to decrease your current Charge. Bound By Frost remains active for 8 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Colder Ice", "Superior Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Superior Frostbolt",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Frost to attack your foes.",
    "featureBenDesc": "While Bound By Frost is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Superior Frostbolt. While Superior Frostbolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against up to 3 opponents each round. Your Superior Frostbolt will deal +3d6 points of Cold damage on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. The additional Cold damage may be divided as you wish among affected targets after Combat damage is assigned.",
    "featurePrereq": ["Advanced Frostbolt", "Bound By Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Frostblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Frost to enhance your weapon.",
    "featureBenDesc": "If you Manifest Superior Empower Weapon while Bound By Frost is active, your Superior Empowered Weapon will now automatically deal Cold Damage with each attack and will inflict +1d12 points of additional Cold damage on all successful Combat Check rolls. Superior Frostblade does not incur any additional Charge loss to Manifest and remains active as long as Bound By Ice and Superior Empower Weapon are both active.",
    "featurePrereq": ["Advanced Frostblade", "Superior Empower Weapon", "Bound By Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Superior Light",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Superior Light.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to radiate or brighten light in an area with a radius of up to 15' centered on a point that you can see within 100' of yourself. As a free action once per round while Superior Light is active, you may increase or decrease the level of Light within the affected area from dim to fully lit and move the Light to another point within 30’ of the original position. Also, while this is active you gain the ability to gently float one handspan above any vertical surface on which you would normally stand. While floating, you may move at your normal Speed. This ability will work over rough water and mud. Each round that Superior Light is active, you may choose to spend additional Charges to cause all creatures within your Light to add +1d10 to their Ticker Values for each Charge spent this way. Creatures affected by this ability are infused by your Light and gain the ability to float as described above while within the area of your Superior Light. You may do this once per round as a Partial Action for as long as your Superior Light remains active. You may spend no more than 10 Charges on this action each round. Undead, Infernal, and Demonic creatures affected by this ability suffer a 1d10 loss to Ticker Value and are allowed a Physical Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Superior Light remains active until the end of the Current Encounter.",
    "featurePrereq": ["Expanded Light", "Master Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Darkness and negate the effects of both. This will overpower and negate the effects of Expanded Darkness."
  },
  {
    "featureName": "Bound By Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Expanded Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 4d4+4, to Manifest an Arcane Presence of Superior Light. This Presence radiates from you and illuminates all within your Reach. While near you, others feel very invigorated. While this Presence is active you gain 75% Block against all Ranged and Melee attacks. Also, allies who you Touch may add 1d12 points to Ticker Value. You may use this beneficial touch effect once per round as a partial action only if you are not engaged in combat during the current round. Undead, Infernal, and Demonic creatures that you touch, that touch you without permission, or that succeed at a Melee Attack Combat check against you must succeed at a Physical Defense Check roll against your Use Magic check or else suffer a 1d12 loss to Ticker Value for each instance of contact. While Bound By Light is active, you also automatically gain all of the abilities from the Feature Superior Light without having to decrease your current Charge. Bound By Light remains active for 8 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Brightest Light", "Superior Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Superior Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "While Bound By Light is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Superior Shining Bolt. While Superior Shining Bolt is active, you gain the ability to target up to 3 allies that you can see within 30’ of yourself and each other with a Shining Bolt of energy that will add +1d10 points to each target’s Ticker Value. You may also use this ability against Undead, Infernal, and Demonic opponents as a Ranged Magic Attack. As a Standard Attack action against 3 such opponents each round, your Superior Shining Bolt will deal +1d10 points of Ticker Value loss to each affected target on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Superior Shining Bolt must be re-manifested with 1 additional Charge each time your Bound By Light Power is renewed.",
    "featurePrereq": ["Advanced Shining Bolt", "Bound By Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Shining Blade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Light to enhance your weapon.",
    "featureBenDesc": "If you Manifest Superior Empower Weapon while Bound By Light is active, your Superior Empowered Weapon will now automatically deal Radiant Damage with each attack and will cause an Undead, Infernal, or Demonic opponent to lose +1d12 points from its Ticker Value as additional damage on all successful Combat Check rolls. Superior Shining Blade does not incur any additional Charge loss to Manifest and remains active as long as Bound By Light Light and Superior Empower Weapon are both active.",
    "featurePrereq": ["Advanced Shining Blade", "Superior Empower Weapon", "Bound By Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Master Invoker",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have mastered the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d10 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Invoker", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Fear",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Power of Fear.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to manifest a feeling of dread in Living creatures who interact with you. While Superior Fear is active you gain a +1d10 bonus to all People Skills Check rolls for Intimidation. Also, you may use Superior Fear to target all Living creatures within a 15’ radius that you can see within 100' of yourself. You appear fearsome and intimidating to the targets. You may cause the targets of this ability to become afraid and unable to take any Attack actions during the current round. Targets affected by this ability may defend against attacks as normal but you gain a +1d10 bonus on all rolls made against any of the targets during the current round. As a free action once per round, you may change the area of this ability to another 15’ radius area that you can see within 100' of you. Each round that Superior Fear is active, you may choose to spend additional Charges to cause the currently affected targets to reduce their Current Modifier Values by 1d10 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Superior Fear remains active. You may spend no more than 10 Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Superior Fear remains active until the end of the Current Encounter.",
    "featurePrereq": ["Expanded Fear", "Master Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Hope and negate the effects of both. This will overpower and negate the effects of Expanded Hope."
  },
  {
    "featureName": "Bound By Fear",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 4d4+4, to Manifest an Arcane Presence of Superior Fear. This Presence inspires dread in those who see you. While near you, others feel quite frightened. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become afraid and unable to take any actions while adjacent to you. You gain a +1d12 bonus to all rolls against such opponents. While Bound By Fear is active, you also automatically gain all of the abilities from the Feature Superior Fear without having to decrease your current Charge. Bound By Fear remains active for 8 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Deepest Dread", "Superior Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Panic",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Fear to gain strength over your enemies.",
    "featureBenDesc": "While Bound By Fear is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Panic. While Panic is active, you may speak and inspire dread in up to 3 targeted Living opponents that are within 30’ of you and that can hear you speak. Your Panic will cause the targets to become fearful and only able to take Move actions for up to 1d12 rounds. Targeted creatures will stop any current action and, if able, use their Move action to flee from you in any random direction for the duration of the effect. At the end of the duration, the affected targets must succeed at a Spiritual Defense check against 2d10 or else continue to flee and not return to combat.  Also, the affected targets will suffer a 1d12 point loss to their Modifier Values. If the target succeeds at a Spiritual Defense check against your Use Magic check, all effects are halved.",
    "featurePrereq": ["Most Dreadful Words", "Bound By Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Superior Hope",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Superior Arcane Power of Hope.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to manifest a feeling of confidence and goodwill in all Living creatures that you can see within a 15’ radius that is 100' from you. You may cause the targets of this ability to gain a +1d10 bonus on all rolls made during the current round. As a free action once per round, you may change the area of this ability to another location that you can see within 100' of you. Each round that Superior Hope is active, you may choose to touch one of the current targets and spend additional Charges to increase its Current Modifier Value by 1d10 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Superior Hope remains active and you are not currently engaged in Combat. You may spend no more than 10 Charges on this action each round. Also, While Superior Hope is active you gain a +1d10 bonus to all People Skills Check rolls for Diplomacy.  Once Manifested, Superior Hope remains active until the end of the Current Encounter.",
    "featurePrereq": ["Expanded Hope", "Master Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Fear and negate the effects of both. This will overpower and negate the effects of Expanded Fear."
  },
  {
    "featureName": "Bound By Hope",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Power of Hope inspire feelings of self-confidence.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 4d4+4, to Manifest an Arcane Presence of Superior Hope. This Presence inspires feelings of optimism and confidence within those who see you. Companions standing adjacent to you gain a +1d12 bonus to all rolls while positioned next to you. While near you, others feel very encouraged. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else decide that you are a symbol of Hope and will defend you against all attackers. Targets affected by this ability subsequently attacked by you cannot be affected by this ability again during the Current Encounter. While Bound by Hope is active, you also automatically gain all of the abilities from the Feature Superior Hope without having to decrease your current Charge. Bound by Hope remains active remains active for 8 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Greatest Confidence", "Superior Hope"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Reassurance",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Hope to bolster your allies.",
    "featureBenDesc": "While Bound By Hope is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Reassurance. While Reassurance is active, you may take a Standard Action to speak and inspire self-confidence in up to 3 targeted Living creatures that are within 50’ of you and that can hear you speak. Your Reassurance will cause the targets to become hopeful and gain a +1d8 point increase to their Modifier Values. ",
    "featurePrereq": ["Most Encouraging Words", "Bound By Hope"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Superior Anger",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Superior Arcane Power of Anger.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to manifest feelings of hatred and rage in all Living creatures that you can see in a 15’ radius within 100' of yourself. You may cause the targets of this ability to gain a +1d10 bonus to all Melee Combat rolls and +1d10 to additional damage dealt by Melee Combat made during the current round. As a free action once per round, you may change the 15’ radius location of this ability to another spot that you can see within 100' of you. Each round that Superior Anger is active, you may choose to touch one of the current targets and spend additional Charges to increase its Current Modifier Value by 1d10 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Superior Anger remains active and you are not currently engaged in Combat. You may spend no more than 10 Charges on this action each round. Also, While Superior Anger is active you gain a +1d10 bonus to your Ticker Value.  Once Manifested, Superior Anger remains active until the end of the Current Encounter.",
    "featurePrereq": ["Expanded Anger", "Master Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Tranquility and negate the effects of both. This will overpower and negate the effects of Expanded Tranquility."
  },
  {
    "featureName": "Bound By Anger",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Superior Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 4d4+4, to Manifest an Arcane Presence of Superior Anger. This Presence inspires feelings of frustration and rage within those who see you. While near you, others feel very upset. Companions standing adjacent to you gain a +1d12 bonus to all Melee Combat rolls and additional damage from Melee combat while positioned next to you. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become irrationally angry and attack some other combat participant as determined by you. Targets affected by this ability subsequently attacked by you cannot be affected by this ability again during the Current Encounter. While Bound by Anger is active, you also automatically gain all of the abilities from the Feature Superior Anger without having to decrease your current Charge. Bound by Anger remains active remains active for 8 hours or until your Current Charge Count equals 0.",
    "featurePrereq": ["Worst Attitude", "Superior Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presence active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Hatred",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Anger to empower your allies.",
    "featureBenDesc": "While Bound by Anger is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Hatred. While Hatred is active, you may take a Standard Action to speak and inspire rage in up to 3 targeted Living creatures that are within 50’ of you and that can hear you speak. Your Hatred will cause the targets to become Enraged and gain a +1d8 bonus to Melee Combat rolls and +1d8 additional damage dealt by a successful Melee attack.",
    "featurePrereq": ["Most Hateful Words", "Bound By Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Superior Tranquility",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Superior Arcane Power of Tranquility.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 100' of yourself. While targeted by this ability, the target no longer wishes to engage in combat and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. The ability will last until the end of the Current Encounter. Also, if you succeed at a Melee Combat Touch attack against a Living Target, the target will disengage from Combat until the end of the Encounter. Opponents under the effect of Blind Rage will no longer be considered Enraged. The target may only benefit from this Touch once per Encounter. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Expanded Tranquility", "Master Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Anger and negate the effects of both. This will overpower and negate the effects of Expanded Anger."
  },
  {
    "featureName": "Complete Tranquility",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Superior Power of Tranquility to empower your actions and calm the minds of your enemies.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 3d4+3, you may manifest an Arcane Presence of Tranquility. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts until you become unconscious or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and attempt to convince any nearby allies to also end hostilies. The target will attempt to physically block an ally from attacking, causing the creature to be unable to attack while the target is blocking them. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Blind Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Peaceful, you automatically gain the effects from the Feature Superior Tranquility without having to decrease your current Charge.",
    "featurePrereq": ["Greatest Peace", "Superior Tranquility"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presence active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Peaceful",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Tranquility to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Complete Tranquility, you may decrease your Charge Count by 1 to speak and inspire Tranquility in all targeted Living opponents within 30' of you and each other. The ability lasts as long as your current Complete Tranquility effect. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat, have a seat, and rest. If attacked the opponent will defend, but not deal combat damage. An opponent in Blind Rage is no longer Enraged.",
    "featurePrereq": ["Most Peaceful Words", "Complete Tranquility"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Elite Sorcerer",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You are one of the greatest Sorcerers of your time.",
    "featureBenDesc": "Your Sorcerer bonus die increases from 1d10 to 1d12.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Sorcery",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have excelled in the ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Elite Arcane Powers. Your Sorcery bonus die to Charge Count is now 2d10 instead of 1d12.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Elite Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Unbound Sorcery",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "Your skills in Sorcery allow you to transcend the limits of Arcane Power.",
    "featureBenDesc": "If you have Evocation as a trained Feature, you now also have Invocation as a trained Feature. If you have Invocation as a trained Feature, you now also have Evocation as a trained Feature.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Elite Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Empower Weapon",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane Weapon, your Empower Weapon ability Arcane Enhancement bonus die is now 2d10 instead of 1d12.",
    "featurePrereq": ["Advanced Empower Weapon", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Dreaded Darkness",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bring Darkness and Fear to your enemies.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 4d4+4, you may manifest an Arcane Presence of Dreaded Darkness which combines all of the abilites from Bound By Darkness and Complete Fear.",
    "featurePrereq": ["Bound By Darkness", "Complete Fear", "Unbound Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Hopeful Light and negate the effects of both. This will overpower and negate the effects of all lesser Light and Hope Arcane Powers."
  },
  {
    "featureName": "Hopeful Light",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bring Light and Hope to your allies.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 4d4+4, you may manifest an Arcane Presence of Hopeful Light which combines all of the abilites from Complete Light and Complete Hope.",
    "featurePrereq": ["Complete Light", "Complete Hope", "Unbound Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Light of Hope and negate the effects of both. This will overpower and negate the effects of all lesser Light and Hope Arcane Powers."
  },
  {
    "featureName": "Elite Evoker",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have excelled in the ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d12 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Master Evoker", "Elite Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Darkness",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Elite Arcane Powers of Darkness.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to diminish or remove light from an area with a radius of up to 15' centered on a point that you can see within 100' of yourself. As a free action once per round while Elite Darkness is active, you may increase or decrease the level of darkness within the affected area from dim to complete darkness and move the Darkness to another point within 50’ of the original position. Also, while this is active you gain the ability to see in darkness without penalty to your vision. Each round that Primal Darkness is active, you may choose to spend additional Charges to cause all creatures within your Darkness to reduce their Current Ticker Values by 1d12 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Primal Darkness remains active. You may spend as many Charges to do this as you desire each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Elite Darkness remains active until the end of the Current Encounter.",
    "featurePrereq": ["Superior Darkness", "Elite Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Elite Light and negate the effects of both. This will overpower and negate the effects from all lesser Arcane Powers of Light."
  },
  {
    "featureName": "Absolute Darkness",
    "featureCost": 5,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Absolute Darkness to shroud and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 5d4+5, to Manifest an Arcane Presence of Elite Darkness. This Presence rises up around you to dim the level of all light within your Reach. While this Presence is active you gain 90% Concealment against all Ranged and Melee attacks. Also, Living creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 2d10 points of loss from Ticker Value for each instance of contact. While Bound By Darkness is active, you also automatically gain all of the abilities from the Features Elite Darkness and Superior Darkbolt without having to decrease your current Charge. Bound By Darkness remains active until you become unconscious or until your Current Charge Count equals 0.",
    "featurePrereq": ["Bound By Darkness", "Superior Darkbolt", "Elite Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Elite Darkbolt",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Darkness to attack your foes.",
    "featureBenDesc": "While Absolute Darkness is active, as a Partial action you may decrease your Charge Count by 3 to Manifest the Arcane Power of Elite Darkbolt. While Elite Darkbolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against up to any number of opponents each round. You must be able to see all targeted opponents and they must all be within 30’ of each other. Your Darkbolt will deal +6d6 points of Ticker Value loss on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. Loss to Ticker Value may be divided as you wish among any affected targets after Combat damage is assigned.",
    "featurePrereq": ["Superior Darkbolt", "Absolute Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Darkblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Darkness to enhance your weapon.",
    "featureBenDesc": "If you Manifest Elite Empower Weapon while Absolute Darkness is active, your Elite Empowered Weapon will now automatically deal Shadow Damage with each attack and will cause a Living opponent to lose +2d10 points from its Ticker Value as additional damage on all successful Combat Check rolls. Elite Darkblade does not incur any additional Charge loss to Manifest and remains active as long as Absolute Darkness and Elite Empower Weapon are both active.",
    "featurePrereq": ["Superior Darkblade", "Elite Empower Weapon", "Absolute Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Elite Flame",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Elite Flame.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to raise the ambient temperature in an area with a radius of up to 15' centered on a point that you can see within 100' of yourself. As a free action once per round while Elite Flame is active, you may increase or decrease the level of heat within the affected area from warm to uncomfortably hot and move the heat to another point within 50’ of the original position. Also, while this is active you gain the ability to light candles, torches, or campfires with a touch. Each round that Elite Flame is active, you may choose to spend additional Charges to cause all creatures within your Heat to reduce their Current Health Values by 1d12 points of Fire Damage for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Elite Flame remains active. You may spend any number of Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Elite Flame remains active until the end of the Current Encounter.",
    "featurePrereq": ["Superior Flame", "Elite Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Elite Frost and negate the effects of both. This will overpower and negate the effects from all lesser Arcane Powers of Frost."
  },
  {
    "featureName": "Inferno",
    "featureCost": 5,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Flame to surround and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 5d4+5, to Manifest an Arcane Presence of Elite Flame. This Presence ignites around you and wraps your form in spectral fire.  While near you, others feel hot. While this Presence is active you gain Immunity to all Fire damage. Also, creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 2d10 points of Fire damage for each instance of contact. While Inferno is active, you also automatically gain all of the abilities from the Features Elite Flame and Superior Flamebolt without having to decrease your current Charge. Inferno remains active until you become unconscious or until your Current Charge Count equals 0.",
    "featurePrereq": ["Bound By Flame", "Superior Flamebolt", "Elite Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Elite Flamebolt",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Flame to attack your foes.",
    "featureBenDesc": "While Inferno is active, as a Partial action you may decrease your Charge Count by 3 to Manifest the Arcane Power of Elite Flamebolt. While Elite Flamebolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against up to any number of opponents each round. You must be able to see all targeted opponents and they must all be within 30’ of each other. Your Elite Flamebolt will deal +6d6 points of additional Fire damage on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. The additional Fire damage may be divided as you wish among any affected targets after Combat damage is assigned.",
    "featurePrereq": ["Superior Flamebolt", "Inferno"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Flameblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Flame to enhance your weapon.",
    "featureBenDesc": "If you Manifest Elite Empower Weapon while Inferno is active, your Elite Empowered Weapon will now automatically deal Fire Damage with each attack and deal +2d10 points of additional Fire damage on all successful Combat Check rolls. Elite Flameblade does not incur any additional Charge loss to Manifest and remains active as long as Bound By Flame and Superior Empower Weapon are both active.",
    "featurePrereq": ["Superior Flameblade", "Elite Empower Weapon", "Inferno"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Elite Frost",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Elite Frost.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to lower the ambient temperature in an area with a radius of up to 15' centered on a point that you can see within 100' of yourself. As a free action once per round while Elite Frost is active, you may increase or decrease the temperature within the affected area from warm to freezing and move the cold to another point within 50’ of the original position. Also, while this is active you gain the ability to chill items or freeze small amounts of water with a touch. Enough water may be frozen by this ability to create a walkable path over rough water for yourself and all companions within 20’ of you. Each round that Elite Frost is active, you may choose to spend additional Charges to cause all creatures within your Cold to reduce their Current Health Values by 1d12 points of Cold Damage for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Elite Frost remains active. You may spend any number of Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Elite Frost remains active until the end of the Current Encounter.",
    "featurePrereq": ["Superior Frost", "Elite Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Elite Flame and negate the effects of both. This will overpower and negate the effects from all lesser Arcane Powers of Flame."
  },
  {
    "featureName": "Freeze",
    "featureCost": 5,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Frost to surround and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 5d4+5, to Manifest an Arcane Presence of Elite Frost. This Presence condenses around you and covers your form in spectral ice.  While near you, others feel too cold. While this Presence is active you gain Immunity to all Cold damage. Also, creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 2d10 points of Cold damage for each instance of contact. While Freeze is active, you also automatically gain all of the abilities from the Features Elite Frost and Superior Frostbolt without having to decrease your current Charge. Freeze remains active until you become unconscious or until your Current Charge Count equals 0.",
    "featurePrereq": ["Bound By Frost", "Superior Frostbolt", "Elite Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Elite Frostbolt",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Frost to attack your foes.",
    "featureBenDesc": "While Freeze is active, as a Partial action you may decrease your Charge Count by 3 to Manifest the Arcane Power of Elite Frostbolt. While Elite Frostbolt is active, you gain a Ranged Magic Attack that may be used as a Standard Attack action against up to any number of opponents each round. You must be able to see all targeted opponents and they must all be within 30’ of each other. Your Elite Frostbolt will deal +6d6 points of additional Cold damage on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage. The additional Cold damage may be divided as you wish among any affected targets after Combat damage is assigned.",
    "featurePrereq": ["Superior Frostbolt", "Freeze"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Frostblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Frost to enhance your weapon.",
    "featureBenDesc": "If you Manifest Elite Empower Weapon while Freeze is active, your Elite Empowered Weapon will now automatically deal Cold Damage with each attack and will inflict +2d10 points of additional Cold damage on all successful Combat Check rolls. Elite Frostblade does not incur any additional Charge loss to Manifest and remains active as long as Freeze and Elite Empower Weapon are both active.",
    "featurePrereq": ["Superior Frostblade", "Elite Empower Weapon", "Freeze"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Elite Light",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Elite Light.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to radiate or brighten light in an area with a radius of up to 15' centered on a point that you can see within 100' of yourself. As a free action once per round while Elite Light is active, you may increase or decrease the level of Light within the affected area from dim to fully lit and move the Light to another point within 50’ of the original position. Also, while this is active you gain the ability to gently float one handspan above any vertical surface on which you would normally stand. While floating, you may move at twice your normal Speed. This ability will work over rough water and mud. Each round that Elite Light is active, you may choose to spend additional Charges to cause all creatures within your Light to add +1d12 to their Ticker Values for each Charge spent this way. Creatures affected by this ability are infused by your Light and gain the ability to float as described above while within the area of your Elite Light. You may do this once per round as a Partial Action for as long as your Elite Light remains active. You may spend any number of Charges on this action each round. Undead, Infernal, and Demonic creatures affected by this ability suffer a 1d12 loss to Ticker Value and are allowed a Physical Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Elite Light remains active until the end of the Current Encounter.",
    "featurePrereq": ["Superior Light", "Elite Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Elite Darkness and negate the effects of both. This will overpower and negate the effects from all lesser Arcane Powers of Darkness."
  },
  {
    "featureName": "Illuminate",
    "featureCost": 5,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Light to surround and protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 5d4+5, to Manifest an Arcane Presence of Elite Light. This Presence radiates from you and illuminates all within your Reach. While near you, others feel very invigorated. While this Presence is active you gain 90% Block against all Ranged and Melee attacks. Also, allies who you Touch may add 2d10 points to Ticker Value. You may use this beneficial touch effect once per round as a partial action only if you are not engaged in combat during the current round. Undead, Infernal, and Demonic creatures that you touch, that touch you without permission, or that succeed at a Melee Attack Combat check against you must succeed at a Physical Defense Check roll against your Use Magic check or else suffer a 2d10 loss to Ticker Value for each instance of contact. While Illuminate is active, you also automatically gain all of the abilities from the Feature Elite Light without having to decrease your current Charge. Illuminate remains active until you become unconscious or until your Current Charge Count equals 0.",
    "featurePrereq": ["Bound By Light", "Superior Lightbolt", "Elite Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Elite Shining Bolt",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elight to attack Evil foes and to aid your allies.",
    "featureBenDesc": "While Illuminate is active, as a Partial action you may decrease your Charge Count by 3 to Manifest the Arcane Power of Elite Shining Bolt. While Elite Shining Bolt is active, you gain the ability to target all allies that you can see within 50’ of yourself and each other with a Shining Bolt of energy that will add +1d12 points to each target’s Ticker Value. You may also use this ability against Undead, Infernal, and Demonic opponents as a Ranged Magic Attack. As a Standard Attack action against all such opponents each round, your Elite Shining Bolt will deal +1d12 points of Ticker Value loss to each affected target on a successful Ranged Magic Attack Check roll in addition to any normal Combat damage.",
    "featurePrereq": ["Superior Shining Bolt", "Illuminate"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Shining Blade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Light to enhance your weapon.",
    "featureBenDesc": "If you Manifest Elite Empower Weapon while Illuminate is active, your Elite Empowered Weapon will now automatically deal Radiant Damage with each attack and will cause an Undead, Infernal, or Demonic opponent to lose +2d10 points from its Ticker Value as additional damage on all successful Combat Check rolls. Elite Shining Blade does not incur any additional Charge loss to Manifest and remains active as long as Illuminate and Elite Empower Weapon are both active.",
    "featurePrereq": ["Superior Shining Blade", "Elite Empower Weapon", "Illuminate"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Elite Invoker",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have excelled in the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d12 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Master Invoker", "Elite Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Fear",
    "featureCost": 5,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Power of Fear.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 2 to manifest a feeling of dread in Living creatures who interact with you. While Elite Fear is active you gain a +1d12 bonus to all People Skills Check rolls for Intimidation. Also, you may use Elite Fear to target all Living creatures within a 15’ radius that you can see within 100' of yourself. You appear fearsome and intimidating to the targets. You may cause the targets of this ability to become afraid and unable to take any Attack actions during the current round. Targets affected by this ability may defend against attacks as normal but you gain a +1d12 bonus on all rolls made against any of the targets during the current round. As a free action once per round, you may change the area of this ability to another 15’ radius area that you can see within 100' of you. Each round that Elite Fear is active, you may choose to spend additional Charges to cause the currently affected targets to reduce their Current Modifier Values by 1d12 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Superior Fear remains active. You may spend any number of Charges on this action each round. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss. Once Manifested, Elite Fear remains active until the end of the Current Encounter.",
    "featurePrereq": ["Superior Fear", "Elite Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Elite Hope and negate the effects of both. This will overpower and negate the effects from all lesser Powers of Hope."
  },
  {
    "featureName": "Menace",
    "featureCost": 5,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 5d4+5, to Manifest an Arcane Presence of Elite Fear. This Presence inspires dread in those who see you. While near you, others feel very frightened. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else cower in fear and only take actions as commanded by you. You gain a +2d10 bonus to all rolls against such opponents. While Menace is active, you also automatically gain all of the abilities from the Feature Elite Fear without having to decrease your current Charge. Bound By Fear remains active until you become unconscious or until your Current Charge Count equals 0.",
    "featurePrereq": ["Bound By Fear", "Elite Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Absolute Panic",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Fear to gain strength over your enemies.",
    "featureBenDesc": "While Menace is active, as a Partial action you may decrease your Charge Count by 3 to Manifest the Arcane Power of Absolute Panic. While Absolute Panic is active, you may speak and inspire dread in all targeted Living opponents that are within 30’ of you and that can hear you speak. Your Absolute Panic will cause the targets to become fearful and only able to take Move actions for up to 2d10 rounds. Targeted creatures will stop any current action and, if able, use their Move action to flee from you in any random direction for the duration of the effect. At the end of the duration, the affected targets must succeed at a Spiritual Defense check against 2d10 or else continue to flee and not return to combat.  Also, the affected targets will suffer a 2d10 point loss to their Modifier Values. If a target succeeds at a Spiritual Defense check against your Use Magic check, all effects are halved.",
    "featurePrereq": ["Panic", "Menace"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Elite Hope",
    "featureCost": 5,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Elite Arcane Power of Hope.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 3 to manifest a feeling of confidence and goodwill in all Living creatures within a 20’ radius area that you can see 100' from yourself. You may cause the targets of this ability to gain a +1d12 bonus on all rolls made during the current round. As a free action once per round, you may change the target of this ability to another 20’ radius location that you can see within 100' of you. Each round that Elite Hope is active, you may choose to touch one of the current targets and spend additional Charges to increase its Current Modifier Value by 1d12 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Elite Hope remains active and you are not currently engaged in Combat. You may spend any number of Charges on this action each round. Also, While Superior Hope is active you gain a +1d12 bonus to all People Skills Check rolls for Diplomacy.  Once Manifested, Elite Hope remains active until the end of the Current Encounter.",
    "featurePrereq": ["Superior Hope", "Elite Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Fear and negate the effects of both. This will overpower and negate the effects of Expanded Fear."
  },
  {
    "featureName": "Embolden",
    "featureCost": 5,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Power of Hope inspire feelings of self-confidence.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 5d4+5, to Manifest an Arcane Presence of Elite Hope. This Presence inspires feelings of optimism and confidence within those who see you. Companions standing adjacent to you gain a +2d10 bonus to all rolls while positioned next to you. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else decide that you are the Avatar of Hope and will defend you to the death against all attackers. While Embolden is active, you also automatically gain all of the abilities from the Feature Elite Hope without having to decrease your current Charge. Embolden remains active remains active until you become unconscious or until your Current Charge Count equals 0.",
    "featurePrereq": ["Bound By Hope", "Elite Hope"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Absolute Reassurance",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Hope to bolster your allies.",
    "featureBenDesc": "While Embolden is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Absolute Reassurance. While Absolute Reassurance is active, you may take a Standard Action to speak and inspire supreme self-confidence in all Living creatures that are within 50’ of you and that can hear you speak. Your Absolute Reassurance will cause the targets to become hopeful and gain a +1d8 point increase to their Modifier Values. Living opponents affected by this ability will perceive you as a Beacon of Hope and will attempt to aid and defend you. Creatures affected in this way are allowed a Spiritual Defense check against you Use Magic to negate the effect.",
    "featurePrereq": ["Reassurance", "Embolden"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Elite Anger",
    "featureCost": 5,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Superior Arcane Power of Anger.",
    "featureBenDesc": "As a Standard action, decrease your Current Charge Count by 3 to manifest feelings of hatred and rage in all Living creatures that you can see in a 20’ radius within 100' of yourself. You may cause the targets of this ability to gain a +1d12 bonus to all Melee Combat rolls and +1d12 to additional damage dealt by Melee Combat made during the current round. As a free action once per round, you may change the 20’ radius location of this ability to another spot that you can see within 100' of you. Each round that Elite Anger is active, you may choose to touch one of the current targets and spend additional Charges to increase its Current Modifier Value by 1d12 for each Charge spent this way. You may do this once per round as a Partial Action for as long as your Elite Anger remains active and you are not currently engaged in Combat. You may spend any number of Charges on this action each round. Also, While Elite Anger is active you gain a +1d12 bonus to your Ticker Value.  Once Manifested, Elite Anger remains active until the end of the Current Encounter.",
    "featurePrereq": ["Superior Anger", "Elite Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Elite Tranquility and negate the effects of both. This will overpower and negate the effects of Superior Tranquility."
  },
  {
    "featureName": "Furious",
    "featureCost": 5,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Superior Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round action, decrease your Charge Count by 5d4+5, to Manifest an Arcane Presence of Elite Anger. This Presence inspires feelings of frustration and rage within those who see you. While near you, others feel very upset. Companions standing adjacent to you gain a +2d10 bonus to all Melee Combat rolls and additional damage from Melee combat while positioned next to you. While this Presence is active, all Living opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become irrationally angry and attack some other combat participant as determined by you. While Furious is active, you also automatically gain all of the abilities from the Feature Elite Anger without having to decrease your current Charge. Bound by Anger remains active remains active until you become unconscious or until your Current Charge Count equals 0.",
    "featurePrereq": ["Bound By Anger", "Elite Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presence active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Absolute Hatred",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Anger to empower your allies.",
    "featureBenDesc": "While Furious is active, as a Partial action you may decrease your Charge Count by 2 to Manifest the Arcane Power of Absolute Hatred. While Absolute Hatred is active, you may take a Standard Action to speak and inspire rage in all Living creatures that are within 50’ of you and that can hear you speak. Your Absolute Hatred will cause the targets to become Enraged and gain a +1d8 bonus to Melee Combat rolls and +1d8 additional damage dealt by a successful Melee attack.",
    "featurePrereq": ["Hatred", "Furious"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  }





]