[{
    "featureName": "Sorcery",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have developed an ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Primal Arcane Powers. Add +1d4 Charge to your Charge roll result.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Self-Awareness", "Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Kinetomancy",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have harnessed your physical being and its movements to capture and control Arcane Energy.",
    "featureBenDesc": "You may now use your Physical Ability modifier dice instead of your Mental Ability modifier dice when making any Magic Use/Attack check rolls for Arcane Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Ectomancy",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have harnessed your spiritual being and its emotions to capture and control Arcane Energy.",
    "featureBenDesc": "You may now use your Spiritual Ability modifier dice instead of your Mental Ability modifier dice when making any Magic Use/Attack check rolls for Arcane Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Empower Weapon",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "As a Partial Action, if you spend one Charge, you may empower a mundane weapon (melee, ranged, or unarmed attack) with a +1d4 Arcane Enhancement bonus to Combat Attack check rolls 10 full rounds. As a free action, you may maintain a weapon so empowered by spending another 1 Charge for each additional 10 rounds. As long as a weapon is empowered, it is considered to be a Magic Weapon.",
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Evocation",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have learned to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you may add +1d4 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Kinetomancy"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may not take this Feature if you have already taken the Feature Invocation."
  },
  {
    "featureName": "Primal Darkness",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Darkness.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may diminish or remove light from an area with a radius of up to 5' centered on a point that you can see within 30' of yourself. As a free action once per round, you may increase or decrease the level of darkenss within the affected area from dim to complete darkness. As part of this Power, you are able to see within the affected area as though the effect were not present. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, while you and an opponent are both within the Primal Darkness, you may spend an additional charge in order to lower the targeted opponent's Ticker Value by 1d4. You may do this once per round as a Partial Action for as long as your Primal Darkness remains active. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Light and negate the effects of both."
  },
  {
    "featureName": "Cloaked in Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to shroud and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Darkness. This Presence rises up around you to dim the level of all light within your Reach. While near you, others feel a little unsure. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Cloaked in Darkness ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. This Power provides you with 10% Concealment against all Ranged and Melee attacks. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of loss from Ticker Value for each instance of contact. Additionally, while Cloaked in Darkness, you automatically manifest the Feature Primal Darkness without having to decrease your current Charge.",
    "featurePrereq": ["Primal Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Cloaked by Darkness, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Cloaked in Darkness effect. Darkbolt must be re-manifested with 1 additional Charge each time your Cloak is renewed. The Darkbolt deals +1d6 points of Ticker Value loss on a successful Ranged Magic Attack Check roll.",
    "featurePrereq": ["Cloaked by Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Darkblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Cloaked by Darkness, you may decrease your Charge Count by 1 to use your Empower Weapon ability empower a mundane weapon with Primal Darkness. The ability lasts as long as your current Cloaked in Darkness effect. Darkblade must be re-manifested with 1 additional Charge each time your Cloak is renewed. By using this ability, your Empowered Weapon now gains a +1d6 Arcane Enhancement Bonus instead of +1d4. Also, the weapon deals +1d6 points of loss to the opponent's Ticker Value on a successful Combat Check roll.",
    "featurePrereq": ["Empower Weapon", "Cloaked in Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Primal Flame",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Flame.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may ignite a flame centered on a point that you can see within 30' of yourself. Unattended combustable material will catch fire. As a free action once per round, you may increase or decrease the size of an active fire within the affected area from embers to a complete blaze.  Increasing a fire's size in this way will cause it to burn through its fuel at a faster rate. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending 1 additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, if you and an opponent are both within 10' of the same active fire, you may spend an additional Charge to direct a spark of flame toward the target. The spark deals 1d4 points of Fire Damage. You may do this as a partial action once per round while Primal Flame is active.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Frost and negate the effects of both."
  },
  {
    "featureName": "Wreathed in Flames",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Flame to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Flame. This Presence ignites around you and wraps your form in spectral fire.  While near you, others feel a bit warmer. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Wreathed in Flames ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. This effect negates 1/4 of all Fire damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of Fire Damage. Additionally, while Wreathed in Flames, you automatically manifest the Feature Primal Flame without having to decrease your current Charge.",
    "featurePrereq": ["Primal Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Flame to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Wreathed in Flames, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Wreathed in Flames effect. Flamebolt must be re-manifested with an additional Charge each time your Presence is renewed. The Flamebolt deals +1d6 points of additional Fire damage on a successful Ranged Magic Attack Check roll.",
    "featurePrereq": ["Wreathed in Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Flameblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Flame to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Wreathed in Flames, you may decrease your Charge Count by 1 to use your Empower Weapon ability empower a mundane weapon with Primal Flame. The ability lasts as long as your current Wreathed in Flames effect. Flameblade must be re-manifested with an additional Charge each time your Presence is renewed. By using this ability, your Empowered Weapon now gains a +1d6 Arcane Enhancement Bonus instead of +1d4. Also, the weapon deals +1d6 points of additional Fire damage on a successful Combat Attack Check roll.",
    "featurePrereq": ["Empower Weapon", "Wreathed in Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Primal Frost",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Frost.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may reduce the temperature in 5' radius area centered on a point that you can see within 30' of yourself. The effect will freeze water within the affected area and leave an frosty coating on other items. As a free action once per round, you may increase or decrease the temperature within the affected area from icy to only cool. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be increased as a Free Action beyond the initial limit by spending 1 additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, each round that a targeted opponent remains within the area of Frost, you may spend a Charge to deal 1d4 points of Cold Damage to that target. Affected Targets are allowed a Physical Defense roll against your Use Magic check + damage dealt in order to negate the effect. You may do this as a Partial action each round while Primal Frost is active.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Flame and negate the effects of both."
  },
  {
    "featureName": "Encased in Ice",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Primal Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Frost. This Presence condenses around you and covers your form in spectral ice.  While near you, others feel a bit cold. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Encased in Ice ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. This effect negates 1/4 of all Cold damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of Cold Damage. Additionally, while Encased in Ice, you automatically manifest the Feature Primal Frost without having to decrease your current Charge Count.",
    "featurePrereq": ["Primal Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Frostbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Frost to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Encased in Ice, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Encased in Ice effect. Frostbolt must be re-manifested with an additional Charge each time your Presence is renewed. The Frostbolt deals +1d6 points of additional Cold damage on a successful Ranged Magic attack check roll.",
    "featurePrereq": ["Encased in Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Frostblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Frost to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Encased in Ice, you may decrease your Charge Count by 1 to use your Empower Weapon ability empower a mundane weapon with Primal Frost. The ability lasts as long as your current Encased in Ice effect. Frostblade must be re-manifested with an additional Charge each time your Presence is renewed. By using this ability, your Empowered Weapon now gains a +1d6 Arcane Enhancement Bonus instead of +1d4. Also, the weapon deals +1d6 points of additional Cold damage on a successful Combat Check roll.",
    "featurePrereq": ["Empower Weapon", "Encased in Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Primal Light",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Light.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may create or brighten radiant light from an area with a radius of up to 5' centered on a point that you can see within 30' of yourself. As a free action once per round, you may increase or decrease the level of brightness within the affected area from dim to full. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, if a living creature is within the Primal Light, you may spend an additional Charge in order to raise the creature's Ticker Value by 1d4. You may do this once per round as a Partial Action while Primal Light is active. Undead, Demonic, and Infernal creatures Targeted with this ability are allowed a Spiritual Defense Check roll against your Use Magic check or else suffer 1d4 points of loss to Ticker Value.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Darkness and negate the effects of both."
  },
  {
    "featureName": "Bathed in Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Primal Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Light. This Presence radiates from you and illuminates all within your Reach.  While near you, others feel a bit cheered. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Bathed in Light ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. This effect provides a 20% Block against all Demonic, Infernal, and Undead attackers. Such creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will lose 1d6 points from Ticker Value for each instance of contact. Allies who you Touch may add 1d6 points to Ticker Value. You may use this beneficial touch effect once per round as a partial action only if you are not engaged in combat during the current round. Additionally, while Bathed in Light, you automatically manifest the Feature Primal Light without having to decrease your current Charge.",
    "featurePrereq": ["Primal Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "As a Partial Action if you are using Bathed in Light, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Bathed in Light effect. Shining Bolt must be re-manifested with 1 additional Charge each time your Cloak is renewed. The Shining Bolt deals +1d6 points of Ticker Value damage on a successful ranged Magic Attack Check roll against Demonic, Infernal, and Undead targets. A Living creature targeted by this ability will add 1d6 points to its Current Ticker Value.",
    "featurePrereq": ["Bathed in Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Shining Blade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Light to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Bathed in Light, you may decrease your Charge Count by 1 to use your Empower Weapon ability empower a mundane weapon with Primal Light. The ability lasts as long as your current Bathed in Light effect. Shining Blade must be re-manifested with 1 additional Charge each time your Cloak is renewed. By using this ability, your Empowered Weapon now gains a +1d6 Arcane Enhancement Bonus instead of +1d4. Also, against Demonic, Infernal, and Undead opponents the weapon deals +1d6 points of additional Ticker Value damage on a successful Combat Attack Check roll.",
    "featurePrereq": ["Empower Weapon", "Bathed in Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Invocation",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, you may add +1d4 to your Use Magic check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Ectomancy"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may not take this Feature if you have already taken the Feature Evocation."
  },
  {
    "featureName": "Primal Fear",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Power of Fear.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of Dread within a Living target that you can see within 30' of yourself. You appear Fearsome and Intimidating to the target. You may cause any Living creature targeted by this ability to become afraid and unable to take any attack actions during the current round. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 30' of you. Targets affected by this ability may defend against attacks as normal but you gain a +1d4 bonus on all rolls made against the target during the current round. Initially, Primal Fear lasts for a number of rounds equal to your Use Magic Check roll result, but may be continued as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. As a partial action once per round while this Power is active, you can lower a targeted opponent's Current Modifier value by 1d4. If this Value is lowered below 0 due to this ability, it will not also affect the target's Health. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check + Modifier loss in order to negate this effect.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Hope and negate the effects of both."
  },
  {
    "featureName": "Dreadful Guise",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Primal Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Fear. This Presence inspires dread in those who see you.  While near you, others feel a bit frightened. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Dreadful Guise ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become afraid and unable to take any attack actions while adjacent to you. You gain a +1d6 bonus to all rolls against such opponents. Additionally, while in Dreadful Guise, you automatically manifest the Feature Primal Fear without having to decrease your current Charge.",
    "featurePrereq": ["Invocation", "Primal Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Dreadful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Fear to gain strength over your enemies.",
    "featureBenDesc": "As a Partial Action if you are using Dreadful Guise, you may decrease your Charge Count by 1 to speak and inspire Dread in a targeted Living opponent. The ability lasts as long as your current Dreadful Guise effect. Dreadful Words must be re-manifested with 1 additional Charge each time your Presence is renewed. The target of this ability is unable to take any Attack action and suffers a 1d6 loss to Modifier Value each round while your Dreadful Guise is active. The target's Modifier may not be reduced below 0 with this ability.",
    "featurePrereq": ["Dreadful Guise"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Primal Hope",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Arcane Power of Hope.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of affection and goodwill within a Living ally that you can see within 30' of yourself. While targeted by this ability, the target gains a +1d4 bonus to all rolls made in defense of you this round. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 30' of you. Initially, Primal Hope lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, spending an additional Charge you may touch a Living target to raise the target's Current Modifier value by 1d4. The bonus lasts only until the end of your Primal Hope effect. You may do this once per round as a Partial Action while Primal Hope is active.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Fear and negate the effects of both."
  },
  {
    "featureName": "Kind Demeanor",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Hope to guide others and inspire affection.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Hope. This Presence inspires enthusiasm in those who see you. While near you, others feel a bit cheered. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Kind Demeanor ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else decide that you not an enemy and choose a different opponent. Allies in combat directly adjacent to you gain a +1d6 bonus to all rolls while fighting near you. Additionally, while in Kind Demeanor, you automatically manifest the Feature Primal Hope without having to decrease your current Charge.",
    "featurePrereq": ["Invocation", "Primal Hope"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Kind Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Hope to inspire affection in your enemies and to bolster your allies.",
    "featureBenDesc": "As a Partial Action if you are using Kind Demeanor, you may decrease your Charge Count by 1 to speak and inspire Affection in a targeted Living creature. The effect lasts as long as your current Kind Demeanor is active. Kind Words must be re-manifested with 1 additional Charge each time your Presence is renewed. By using this ability, the creature may add +1d6 to its Modifier Value. If the target is an opponent, it will not consider you to be an enemy during the remainder of the Current Encounter. The Modifier Value bonus lasts until the end of the Current Encounter. ",
    "featurePrereq": ["Kind Demeanor"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Primal Anger",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Arcane Power of Anger.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of rage within a Living target that you can see within 30' of yourself. While targeted by this ability, the target gains a +1d4 bonus to all additional damgage dealt on a successful Melee Combat check this round. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 30' of you. Initially, Primal Anger lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. If you spend an additional Charge to Touch a Living creature, you may raise the creature's Current Modifier value by 1d4. The bonus lasts until the end of you Primal Anger effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Tranquility and negate the effects of both."
  },
  {
    "featureName": "Bad Attitude",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Anger. This Presence inspires rage in those who see you. While near you, others feel frustrated and angry. Bad Attitude lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Bad Attitude ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become filled with hate for a different, random target. The affected opponent will immediately change direction and attack the new target. Allies in combat directly adjacent to you gain a +1d6 bonus to all damage dealt on a successful Melee Combat check while fighting near you. Additionally, while in Bad Attitude, you automatically manifest the Feature Primal Anger without having to decrease your current Charge.",
    "featurePrereq": ["Invocation", "Primal Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Hateful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Anger to empower your allies.",
    "featureBenDesc": "As a Partial Action if you are using Bad Attitude, you may decrease your Charge Count by 1 to speak and inspire Anger in a targeted Living creature. The ability lasts as long as your current Bad Attitude is active. Hateful Words must be re-manifested with 1 additional Charge each time your Presence is renewed. By using this ability, the ally becomes Enraged as described in the Warrior Feature named Battle Rage. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. Unwilling targets are allowed a Spiritual Defense check against your Use Magic check in order to negate the effect.",
    "featurePrereq": ["Bad Attitude"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Primal Tranquility",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Arcane Power of Tranquility.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 30' of yourself. While targeted by this ability, the target no longer wishes to engage in combat during the current round and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 30' of you. Initially, Primal Tranquility lasts for a number of rounds equal to your Use Magic Check roll result, but may be Extended as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. As a Partial Action once per round while Primal Tranquility is active, if you spend an additional Charge and succeed at a Use Magic check against a Living target's Spiritual Defense Check, the target will refuse to participate in Combat until Primal Tranquility is no longer active. If the affected target is under the effect of Battle Rage, it will now no longer be considered Enraged.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Anger and negate the effects of both."
  },
  {
    "featureName": "Calming Presence",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Tranquility to empower your actions and calm the minds of your enemies.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Tranquility. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Calming Presence ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and move away unless attacked. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Battle Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Calming Presence, you automatically manifest the Feature Primal Tranquility without having to decrease your current Charge.",
    "featurePrereq": ["Invocation", "Primal Tranquility"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Peaceful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Tranquility to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Calming Presence, you may decrease your Charge Count by 1 to speak and inspire Tranquility in a targeted Living opponent. The Peaceful Words lasts while your current Calming Presence is active. Peaceful Words must be re-manifested with 1 additional Charge each time your Presence is renewed. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat and move away. If attacked the opponent will defend, but not deal combat damage. An opponent in Battle Rage is no longer Enraged.",
    "featurePrereq": ["Calming Presence"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Novice Sorcerer",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have learned what it is to be a Sorcerer.",
    "featureBenDesc": "Gain a +1d4 bonus to your Use Magic Check rolls when attempting to use an Arcane Power ability.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Sorcery",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have improved your ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Enhanced Arcane Powers. Your Sorcery bonus die to Charge Count has increase from 1d4 to 1d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Empower Weapon",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane or Weapon, your Empower Weapon ability Arcane Enhancement bonus die has increased from +1d4 to +1d6. The effect now lasts until the end of the Current Encounter.",
    "featurePrereq": ["Empower Weapon", "Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Novice Evoker",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have improved your ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d6 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Evocation", "Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Enhanced Darkness",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Enhanced Arcane Powers of Darkness.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may diminish or remove light from an area with a radius of up to 5' centered on a point that you can see within 50' of yourself. As a free action once per round, you may increase or decrease the level of darkenss within the affected area from dim to complete darkness. As part of this Power, you are able to see within the affected area as though the effect were not present. Once Manifested, Enhanced Darkness remains active until the end of the Current Encounter. Also, while you and an opponent are both within the Enhanced Darkness, you may spend an additional charge in order to lower the targeted opponent's Ticker Value by 1d6. You may do this once per round as a Partial Action for as long as your Enhanced Darkness remains active. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss.",
    "featurePrereq": ["Primal Darkness", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Light and negate the effects of both. This will overpower and negate the effects of Primal Light."
  },
  {
    "featureName": "Deeper Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Darkness to shroud and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Darkness. This Presence rises up around you to dim the level of all light within your Reach. While near you, others feel a little unsure. Once manifested, Deeper Darkness may remain active until the end of the Current Encounter. This Power provides you with 25% Concealment against all Ranged and Melee attacks. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d8 points of loss from Ticker Value for each instance of contact. Additionally, while using Deeper Darkness, you automatically manifest the Feature Enhanced Darkness without having to decrease your current Charge.",
    "featurePrereq": ["Cloaked by Darkness", "Enhanced Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Darkness to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Deeper Darkness, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. Improved Darkbolt lasts as long as your current Deeper Darkness effect. Improved Darkbolt also deals +1d8 points of Ticker Value loss on a successful Ranged Magic Attack Check roll.",
    "featurePrereq": ["Darkbolt", "Deeper Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Darkblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Darkness to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Deeper Darkness, you may decrease your Charge Count by 1 to use your Empower Weapon ability to empower a mundane weapon with Enhanced Darkness. The ability lasts as long as your current Deeper Darkness effect. Your Empowered Weapon effect increases from +1d6 to +1d8 and the weapon deals +1d8 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Darkblade", "Improved Empower Weapon", "Deeper Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Enhanced Flame",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Enhanced Flame.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may ignite a flame centered on a point that you can see within 50' of yourself. Unattended combustable material will catch fire. As a free action once per round, you may increase or decrease the size of an active fire within the affected area from embers to a complete blaze.  Increasing a fire's size in this way will cause it to burn through its fuel at a faster rate. ONce Manifested, Enhanced Flame will remain active until the end of the Current Encounter. Also, if you and an opponent are both within 20' of the same active fire, you may spend an additional Charge to direct a spark of flame toward the target. The spark deals 1d6 points of Fire Damage. You may do this as a partial action once per round while Enhanced Flame is active.",
    "featurePrereq": ["Primal Flame", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Frost and negate the effects of both. This will overpower and negate the effects of Primal Frost."
  },
  {
    "featureName": "Hotter Flames",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Flame to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Enhanced Flame. This Presence ignites around you and wraps your form in spectral fire.  While near you, others feel a bit warmer. Once Manifested, Hotter Flames will remain active until the end of the Current Encounter. This effect negates 1/2 of all Fire damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d8 points of Fire Damage. Additionally, while in Hotter Flames, you automatically manifest the Feature Enhanced Flame without having to decrease your current Charge.",
    "featurePrereq": ["Wreathed in Flames", "Enhanced Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Flame to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Hotter Flames, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. Improved Flamebolt lasts for as long as your Hotter Flames remains active. The Flamebolt deals +1d8 points of additional Fire damage on a successful Ranged Magic Attack Check roll.",
    "featurePrereq": ["Flamebolt", "Hotter Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Flameblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Flame to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Hotter Flames, you may decrease your Charge Count by 1 to use your Improved Empower Weapon ability to empower a mundane weapon with Enhanced Flame. The ability lasts as long as your current Hotter Flames remains active. By using this ability, your Improved Empowered Weapon now gains a +1d8 Arcane Enhancement Bonus instead of +1d6. Also, the weapon deals +1d8 points of additional Fire damage on a successful Combat Attack Check roll.",
    "featurePrereq": ["Flameblade", "Improved Empower Weapon", "Hotter Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Enhanced Frost",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Enhanced Frost.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may reduce the temperature in 10' radius area centered on a point that you can see within 50' of yourself. The effect will freeze water within the affected area and leave an icy coating on other items. As a free action once per round, you may increase or decrease the temperature within the affected area from icy to only cool. Once manifested, Enhanced Frost will remain active until the end of the Current Round. Also, each round that a targeted opponent remains within the area of Frost, you may spend a Charge to deal 1d6 points of Cold Damage to that target. Affected Targets are allowed a Physical Defense roll against your Use Magic check + damage dealt in order to negate the effect. You may do this as a Partial action each round while Enhanced Frost is active.",
    "featurePrereq": ["Primal Frost", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Flame and negate the effects of both. This will overpower and negate the effects of Primal Flame."
  },
  {
    "featureName": "Colder Ice",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Enhanced Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Enhanced Frost. This Presence condenses around you and covers your form in spectral ice.  While near you, others feel a bit cold. Once Manifested, Colder Ice will remain active until the end of the Current Round. This effect negates 1/2 of all Cold damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d8 points of Cold Damage. Additionally, while in Colder Ice, you automatically manifest the Feature Enhanced Frost without having to decrease your current Charge Count.",
    "featurePrereq": ["Encased in Ice", "Enhanced Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Frostbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Frost to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Colder Ice, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Colder Ice is active. Improved Frostbolt deals +1d8 points of additional Cold damage on a successful Ranged Magic attack check roll.",
    "featurePrereq": ["Frostbolt", "Colder Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Frostblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Frost to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Colder Ice, you may decrease your Charge Count by 1 to use your Improved Empower Weapon ability to empower a mundane weapon with Enhanced Frost. The ability lasts as long as your current Colder Ice is active. By using this ability, your Empowered Weapon now gains a +1d8 Arcane Enhancement Bonus instead of +1d6. Also, the weapon deals +1d8 points of additional Cold damage on a successful Magic Attack Check roll.",
    "featurePrereq": ["Frostblade", "Improved Empower Weapon", "Colder Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Enhanced Light",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Enhanced Light.",
    "featureBenDesc": "As a standard action, decrease your Charge Count by 1 to create or brighten radiant light from an area with a radius of up to 10' centered on a point that you can see within 50' of yourself. As a free action once per round, you may increase or decrease the level of brightness within the affected area from dim to full. Once manifested, Enhanced Light will remain active until the end of the Current Round. Also, if a living creature is within the Enhanced Light, you may spend an additional Charge in order to raise the creature's Ticker Value by 1d6. You may do this once per round as a Partial Action while Enhanced Light is active. Undead, Demonic, and Infernal creatures Targeted with this ability are allowed a Spiritual Defense Check roll against your Use Magic check or else suffer 1d6 points of loss to Ticker Value.",
    "featurePrereq": ["Primal Light", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Darkness and negate the effects of both. This will overpower and negate the effects of Primal Darkness."
  },
  {
    "featureName": "Brighter Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Primal Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, decrease your Charge Count by 1d4+1 to manifest an Enhanced Arcane Presence of Light. This Presence radiates from you and illuminates all within your Reach. Enhanced Light lasts until the end of the Current Encounter. This effect provides a 50% Block against all Demonic, Infernal, and Undead attackers. Such creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d8 points of Radiant Damage and loss from Ticker Value for each instance of contact. Allies who you Touch may restore 1d8 lost hit points to their Current Health Value and as many lost points from their Ticker Value. Restored Ticker points must have been lost during the Current Encounter and must have been lost due to damage not round progression. Additionally, while using Brighter Light, you automatically manifest the Feature Enhanced Light without having to decrease your current Charge.",
    "featurePrereq": ["Bathed in Light", "Enhanced Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "As a Partial Action if you are using Brighter Light, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Brighter Light is active. The Shining Bolt deals +1d10 points of Ticker Value damage on a successful Ranged Magic Attack against Demonic, Infernal, and Undead targets. Living allies may be targeted by this ability without a Check roll. Allies targeted will increase their Ticker Value by 1d10.",
    "featurePrereq": ["Shining Bolt", "Brighter Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Shining Blade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Light to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Brighter Light, you may decrease your Charge Count by 1 to use your Improved Empower Weapon ability to empower a mundane weapon with Enhanced Light. The ability lasts as long as your current Brighter Light is active. By using this ability, your Empowered Weapon now gains a +1d10 Arcane Enhancement Bonus instead of +1d6. Also, against Demonic, Infernal, and Undead opponents the weapon deals +1d10 points of Ticker Value damage on a successful Combat Attack Check roll.",
    "featurePrereq": ["Shining Blade", "Improved Empower Weapon", "Brighter Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Novice Invoker",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have improved the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d6 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Invocation", "Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Enhanced Fear",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Power of Fear.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of Dread within a Living target that you can see within 50' of yourself. You gain a +1d6 bonus to all rolls made against any Living creature targeted by this ability. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 50' of you. This ability will last until the end of the Current Encounter. Also, if you succeed at a Touch Combat Check roll against the targeted opponent you can lower the target's Current Modifier value by 1d6. If this Value is lowered below 0 due to this ability, it will not also affect the target's Health. You may do this once per round as a Partial Action. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss.",
    "featurePrereq": ["Primal Fear", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Hope and negate the effects of both. This will overpower and negate the effects of Primal Hope."
  },
  {
    "featureName": "Deeper Dread",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Enhanced Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Fear. The Presence lasts until the end of the Current Encounter. Like Dreadful Guise, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else move away from you and choose a different opponent. If a Living creature does choose to enter into combat with you, you gain a +1d8 bonus to all rolls against the opponent. Additionally, while in Deeper Dread, you automatically gain the effects from the Feature Enhanced Fear without having to decrease your current Charge.",
    "featurePrereq": ["Fearful Guise", "Enhanced Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "More Dreadful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Fear to gain strength over your enemies.",
    "featureBenDesc": "As a Partial Action if you are using Deeper Dread, you may decrease your Charge Count by 1 to speak and inspire Dread in a targeted Living opponent. The ability lasts as long as your current Deeper Dread effect. By using this ability, anyone who enters Combat with this target gains a +1d8 Arcane Enhancement Bonus to all rolls against the target. Also, if the target fails at a Spiritual Defense roll agains your Use Magic check the target must decrease its Ticker and Modifier Values by 1d6.",
    "featurePrereq": ["Dreadful Words", "Deeper Dread"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Enhanced Hope",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Hope.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of affection and goodwill within a Living ally that you can see within 50' of yourself. While targeted by this ability, the target gains a +1d6 bonus to all rolls made in defense of you. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 50' of you. This ability lasts until the end of the Current Encounter. Also, by touching a Living target you may raise the target's Current Modifier value by 1d6. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of you Enhanced Hope effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Primal Hope", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Fear and negate the effects of both. This will overpower and negate the effects of Primal Fear."
  },
  {
    "featureName": "Greater Kindness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Hope to guide others and inspire affection.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Hope. The effect lasts until the end of the Current Encounter. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else decide that you not an enemy and choose a different opponent. Allies in combat directly adjacent to you gain a +1d8 bonus to all rolls while fighting near you. Additionally, while in Greater Kindness, you automatically gain the effects from the Feature Enhanced Hope without having to decrease your current Charge.",
    "featurePrereq": ["Kind Demeanor", "Enhanced Hope"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Kinder Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Hope to inspire affection in your enemies and to bolster your allies.",
    "featureBenDesc": "As a Partial Action if you are using Greater Kindness, you may decrease your Charge Count by 1 to speak and inspire Affection in a targeted Living ally. The ability lasts as long as your current Greater Kindness effect. By using this ability, the ally may add +1d8 to her Modifier Value. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["Kind Words", "Greater Kindness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Enhanced Anger",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Anger.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of rage within a Living target that you can see within 50' of yourself. While targeted by this ability, the target gains a +1d6 bonus to all additional damgage dealt on a successful Melee Combat check. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 50' of you. The effect lasts until the end of the Current Encounter. Also, by touching a Living target you may raise the target's Current Modifier value by 1d8. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of you Enhanced Anger effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Primal Anger", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Tranquility and negate the effects of both. This will overpower and negate the effects of Primal Tranquility."
  },
  {
    "featureName": "Worse Attitude",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Enhanced Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Anger. The effect lasts until the end of the Current Encounter. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become filled with hate for a different, random target. The affected opponent will immediately change direction and attack the new target. Allies in combat directly adjacent to you gain a +1d8 bonus to all damage dealt on a successful Melee Combat check while fighting near you. Additionally, while in Worse Attitude, you automatically gain the effects from the Feature Enhanced Anger without having to decrease your current Charge.",
    "featurePrereq": ["Bad Attitude", "Enhanced Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "More Hateful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Anger to empower your allies.",
    "featureBenDesc": "As a Partial Action if you are using Worse Attitude, you may decrease your Charge Count by 1 to speak and inspire Anger in a targeted Living ally. The ability lasts as long as your current Worse Attitude effect. By using this ability, the ally becomes Enraged as described in the Path of Violence Feature named Violent Rage. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["Hateful Words", "Worse Attitude"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Enhanced Tranquility",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Tranquility.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 50' of yourself. While targeted by this ability, the target no longer wishes to engage in combat and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 50' of you. The ability will last until the end of the Current Encounter. Also, if you succeed at a Melee Combat Touch attack against a Living Target, the target will disengage from Combat until the end of the Encounter. Opponents under the effect of Violent Rage will no longer be considered Enraged. The target may only benefit from this Touch once per Encounter. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Primal Tranquility", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Anger and negate the effects of both. This will overpower and negate the effects of Primal Anger."
  },
  {
    "featureName": "Greater Peace",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Enhanced Power of Tranquility to empower your actions and calm the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Tranquility. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts until the end of the Current Encounter. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and move away unless attacked. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Violent Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Greater Peace, you automatically gain the effects from the Feature Enhanced Tranquility without having to decrease your current Charge.",
    "featurePrereq": ["Calming Presence", "Enhanced Tranquility"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "More Peaceful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Tranquility to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Greater Peace, you may decrease your Charge Count by 1 to speak and inspire Tranquility in a targeted Living opponent. The ability lasts as long as your current Greater Peace effect. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat and move away. If attacked the opponent will defend, but not deal combat damage. An opponent in Violent Rage is no longer Enraged.",
    "featurePrereq": ["Peacful Words", "Greater Peace"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Sorcerer",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have become an actual Sorcerer.",
    "featureBenDesc": "Your Novice Sorcerer bonus die increases from 1d4 to 1d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Sorcery",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have advanced in your ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Expanded Arcane Powers. Your Sorcery bonus die to Charge Count has increase from 1d6 to 1d8.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Empower Weapon",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane Weapon, your Empower Weapon ability Arcane Enhancement bonus die has increased from +1d6 to +1d8.",
    "featurePrereq": ["Improved Empower Weapon", "Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Evoker",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have advanced in your ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d8 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Evoker", "Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Expanded Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Expanded Arcane Powers of Darkness.",
    "featureBenDesc": "As a standard action by spending 1 Charge, you may now direct your Darkness to a 10' radius area centered on any point that you can see within 100' of you. By spending 1 additional Charge, you may attempt a Touch attack to affect all opponents within your Darkenss. Your Darkness Touch Combat Check roll against all targeted opponents within the Darkness now lowers the Target's Ticker Value by 1d8.",
    "featurePrereq": ["Enhanced Darkness", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Light and negate the effects of both. This will overpower and negate the effects of Enhanced Light."
  },
  {
    "featureName": "Deepest Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Darkness to shroud and protect you.",
    "featureBenDesc": "Your Presence of Darkness now costs 2d4+2 charges to manifest but lasts for 8 hours or until your Current Charge Count equals 0 without having to be maintained. The Presence now provides you with 30% Concealment against all Ranged and Melee attacks. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will now suffer 1d10 points of Shadow Damage and loss from Ticker Value for each instance of contact. Additionally, while Cloaked in Darkness, you automatically gain the effects from the Feature Expanded Darkness without having to decrease your current Charge.",
    "featurePrereq": ["Deeper Darkness", "Expanded Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Darkness to attack your foes.",
    "featureBenDesc": "Once you spend 2 Charges to manifest it, Advanced Darkbolt will last for as long as you are using Deepest Darkness. The Darkbolt may now be used to target 2 opponents or one opponent twice. You will make your normal Ranged Magic Combat check roll, but the bolt will now deal +2d8 points of additional damage. If there are two targets, the additional damage from the Darkbolt will be split in half (rounded down).  Also, the targets must reduce their Ticker Values by a number equal to the additional damage dealt to each by this attack.",
    "featurePrereq": ["Improved Darkbolt", "Deepest Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Darkblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Darkness to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Deepest Darkness, you may decrease your Charge Count by 1 to use your Advanced Empower Weapon ability to empower a mundane weapon with Expanded Darkness. The ability lasts as long as your current Deepest Darkness effect. Your Empowered Weapon effect increases from +1d8 to +1d10 and the weapon deals +1d10 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Improved Darkblade", "Advanced Empower Weapon", "Deepest Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Expanded Flame",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Expanded Flame.",
    "featureBenDesc": "As a standard action, by spending 1 Charge, you may now ignite and control fires in a location that you can see up to 100' from you. Once manifested, Expanded Flame lasts until the end of the Current Encounter. Also, while using Expanded Flame, by spending an additional Charge, if you and any number of opponents are all within 30' of the same active fire and each other, as a Ranged Combat attack, you may attempt to direct sparks of flame toward the targets. The ranged attack deals Fire damage, and a damaged individual must take a Standard Action before your next Turn to roll a Physical Action check against 1d8 + fire damage suffered in order to extinquish the Flame or else suffer 1d8 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Enhanced Flame", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Frost and negate the effects of both. This will overpower and negate the effects of Enhanced Frost."
  },
  {
    "featureName": "Hottest Flames",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Flame to surround and protect you.",
    "featureBenDesc": "Your Presence of Flame now costs 2d4+2 charges to manifest but lasts for 8 hours or until your Current Charge Count equals 0 without having to be maintained. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d10 points of Fire Damage and must take a Standard Action before your next Turn to roll a Physical Action check against 1d10 + fire damage suffered in order to extinquish the Flame or else suffer 1d10 points of additional Fire damage each round until the Flame is put out. This effect now negates all Fire and 3/4 of all Cold damage dealt to you. Additionally, while in Hottest Flames, you automatically gain the effects from the Feature Expanded Flame without having to decrease your current Charge.",
    "featurePrereq": ["Hotter Flames", "Expanded Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Flame to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Hotter Flames, you may decrease your Charge Count by 2 to gain the ability to target up to two opponents each round with a ranged Magic attack. You will make your normal Ranged Magic Combat check roll, but the bolt will now deal +2d8 points of additional damage. If there are two targets, the additional damage from the Flamebolt will be split in half (rounded down). Also, affected targets must take a Standard Action before your next Turn to roll a Physical Action check against 1d8 + fire damage suffered in order to extinquish the Flame or else suffer 1d8 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Improved Flamebolt", "Hottest Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Flameblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Flame to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Hottest Flames, you may decrease your Charge Count by 1 to use your Advanced Empower Weapon ability to empower a mundane weapon with Expanded Flame. The ability lasts as long as your current Hottest Flames effect. By using this ability, your Advanced Empowered Weapon now gains a +1d10 Arcane Enhancement Bonus instead of +1d8. Also, the weapon deals +1d10 points of additional Fire damage on a successful Combat Attack Check roll and the target must take a Standard Action before your next Turn to roll a Physical Action check against 1d10 + fire damage suffered in order to extinquish the Flame or else suffer 1d10 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Improved Flameblade", "Advanced Empower Weapon", "Hottest Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Expanded Frost",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Expanded Frost.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may reduce the temperature in 10' radius area centered on a point that you can see within 100' of yourself. The effect will freeze water within the affected area and leave a hard frozen coating on other items. As a free action once per round, you may increase or decrease the temperature within the affected area from icy to only cool. The ability lasts until the end of the Current Encounter. Also, each round that a living creature remains within the area of effect, it must succeed at a Physical Activity Check roll against your Use Magic result or else suffer a decrease to Ticker value by 1d8.",
    "featurePrereq": ["Enhanced Frost", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Flame and negate the effects of both. This will overpower and negate the effects of Enhanced Flame."
  },
  {
    "featureName": "Coldest Ice",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Expanded Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Expanded Arcane Presence of Frost. The effect lasts for 8 hours or until your Current Charge Count equals 0. This effect now negates all Cold and 3/4 of all Fire damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will now suffer 1d10 points of Cold Damage and Ticker Value loss. Additionally, while using Coldest Ice, you automatically gain the effects from the Feature Expanded Frost without having to decrease your current Charge.",
    "featurePrereq": ["Colder Ice", "Expanded Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Frostbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Frost to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Coldest Ice, you may decrease your Charge Count by 2 to gain the ability to target up to two opponents each round with a ranged Magic attack. The ability lasts as long as your current Coldest Ice effect. You will make your normal Ranged Magic Combat check roll, but the bolt will now deal +2d8 points of additional damage and Ticker Value loss on a successful Magic Attack roll. If there are two targets, the additional damage from the Frostbolt will be split in half (rounded down).",
    "featurePrereq": ["Improved Frostbolt", "Coldest Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Frostblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Frost to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Coldest Ice, you may decrease your Charge Count by 1 to use your Advanced Empower Weapon ability to empower a mundane weapon with Expanded Frost. The ability lasts as long as your current Coldest Ice effect. By using this ability, your Empowered Weapon now gains a +1d10 Arcane Enhancement Bonus instead of +1d8. Also, the weapon deals +1d10 points of additional Cold damage and Ticker Value loss on a successful Magic Attack Check roll.",
    "featurePrereq": ["Improved Frostblade", "Advanced Empower Weapon", "Coldest Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Expanded Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Expanded Light.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may create or brighten radiant light from an area with a radius of up to 10' centered on a point that you can see within 100' of yourself. As a free action once per round, you may increase or decrease the level of brightness within the affected area from dim to full. The effect lasts until the end of the Current Encounter. Also, if you and other living creatures are all within the Expanded Light, you may attempt to Touch all targeted creatures in order to raise their Ticker Values by 1d8. You may do this once per round as a Partial Action. Undead, Demonic, and Infernal creatures Targeted with this Touch are allowed a Spiritual Defense Check roll against your Use Magic check or else suffer 1d8 points of loss to Ticker Value.",
    "featurePrereq": ["Enhanced Light", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Darkness and negate the effects of both. This will overpower and negate the effects of Enhanced Darkness."
  },
  {
    "featureName": "Brightest Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Expanded Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Expanded Arcane Presence of Light. This Presence radiates from you and illuminates all within your Reach. The effect lasts for 8 hours or until your Current Charge Count equals 0. This effect provides a 75% Block against all Demonic, Infernal, and Undead attackers. Such creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d10 points of Radiant Damage and loss from Ticker Value for each instance of contact. Allies who you Touch may restore 1d10 lost hit points to their Current Health Value and as many lost points from their Ticker Value. Restored Ticker points must have been lost during the Current Encounter and must have been lost due to damage not round progression. Additionally, while using Brightest Light, you automatically gain the effects from the Feature Expanded Light without having to decrease your current Charge.",
    "featurePrereq": ["Brighter Light", "Expanded Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "As a Partial Action if you are using Brightest Light, you may decrease your Charge Count by 2 to gain the ability to target up to 2 opponents each round with a ranged Magic attack. The ability lasts as long as your current Brightest Light effect. You will make your normal Ranged Magic Combat check roll, but the Shining Bolt will now deal +2d8 points of additional damage on a successful Magic Attack Check roll against Demonic, Infernal, and Undead targets. Also, the target must reduce its Ticker Value by a number equal to the additional damage dealt by this attack. If there are two targets, the additional damage or Health from the Shining Bolt will be split in half (rounded down). Living allies targeted by this ability will each restore 2d8 points of lost damage to their Current Health and Ticker Values. Such damage must have been lost within the Current Encounter and cannot have been lost due to round progression. ",
    "featurePrereq": ["Improved Shining Bolt", "Brightest Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Shining Blade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Light to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Brightest Light, you may decrease your Charge Count by 1 to use your Advanced Empower Weapon ability to empower a mundane weapon with Expanded Light. The ability lasts as long as your current Brightest Light effect. By using this ability, your Empowered Weapon now gains a +1d10 Arcane Enhancement Bonus instead of +1d8. Also, against Demonic, Infernal, and Undead opponents the weapon deals +1d10 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Improved Shining Blade", "Advanced Empower Weapon", "Brightest Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Invoker",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have advanced in the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d8 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Invoker", "Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Expanded Fear",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Power of Fear.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of Dread within a Living target that you can see within 100' of yourself. You gain a +1d8 bonus to all rolls made against any Living creature targeted by this ability. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. This ability will last until the end of the Current Encounter. Also, if you succeed at a Touch Combat Check roll against the targeted opponent you can lower the target's Current Modifier value by 1d8. If this Value is lowered below 0 due to this ability, it will not also affect the target's Health. You may do this once per round as a Partial Action. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss.",
    "featurePrereq": ["Enhanced Fear", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Hope and negate the effects of both. This will overpower and negate the effects of Enhanced Hope."
  },
  {
    "featureName": "Deepest Dread",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Arcane Presence of Fear. The Presence lasts for 8 hours or until your Current Charge Count equals 0. Like Deeper Dread, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else move away from you and choose a different opponent. If a Living creature does choose to enter into combat with you, you gain a +1d10 bonus to all rolls against the opponent. Additionally, while in Deepest Dread, you automatically gain the effects from the Feature Expanded Fear without having to decrease your current Charge.",
    "featurePrereq": ["Deeper Dread", "Expanded Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Most Dreadful Words",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Fear to gain strength over your enemies.",
    "featureBenDesc": "As a Partial Action if you are using Deepest Dread, you may decrease your Charge Count by 1 to speak and inspire Dread in a targeted Living opponent. The ability lasts as long as your current Deepest Dread effect. By using this ability, anyone who enters Combat with this target gains a +1d10 Arcane Enhancement Bonus to all rolls against the target until the end of the Current Encounter. Also, if the target fails at a Spiritual Defense roll agains your Use Magic check the target must decrease its Ticker and Modifier Values by 1d10.",
    "featurePrereq": ["More Dreadful Words", "Deepest Dread"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Expanded Hope",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Expanded Arcane Power of Hope.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of affection and goodwill within a Living ally that you can see within 100' of yourself. While targeted by this ability, the target gains a +1d8 bonus to all rolls made in defense of you. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. This ability lasts until the end of the Current Encounter. Also, by touching a Living target you may raise the target's Current Modifier value by 1d8. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of you Enhanced Hope effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Enhanced Hope", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Fear and negate the effects of both. This will overpower and negate the effects of Enhanced Fear."
  },
  {
    "featureName": "Greatest Kindness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Power of Hope to guide others and inspire affection.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Arcane Presence of Hope. The effect lasts for 8 hours or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else decide that you not an enemy and choose a different opponent. Allies in combat directly adjacent to you gain a +1d10 bonus to all rolls while fighting near you. Additionally, while in Greatest Kindness, you automatically gain the effects from the Feature Expanded Hope without having to decrease your current Charge.",
    "featurePrereq": ["Greater Kindness", "Expanded Hope"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Kindest Words",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Hope to inspire affection in your enemies and to bolster your allies.",
    "featureBenDesc": "As a Partial Action if you are using Greatest Kindness, you may decrease your Charge Count by 1 to speak and inspire Affection in a targeted Living ally. The ability lasts as long as your current Greatest Kindness effect. By using this ability, the ally may add +1d10 to her Modifier Value. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["Kinder Words", "Greatest Kindness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Expanded Anger",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Anger.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of rage within a Living target that you can see within 100' of yourself. While targeted by this ability, the target gains a +1d8 bonus to all additional damgage dealt on a successful Melee Combat check. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. The effect lasts until the end of the Current Encounter. Also, by touching a Living target you may raise the target's Current Modifier value by 1d10. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of your Expanded Anger effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Enhanced Anger", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Tranquility and negate the effects of both. This will overpower and negate the effects of Enhanced Tranquility."
  },
  {
    "featureName": "Worst Attitude",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Expanded Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Arcane Presence of Anger. The effect lasts for 8 hours or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become filled with hate for a different, random target. The affected opponent will immediately change direction and attack the new target. Allies in combat directly adjacent to you gain a +1d10 bonus to all damage dealt on a successful Melee Combat check while fighting near you. Additionally, while in Worst Attitude, you automatically gain the effects from the Feature Expanded Anger without having to decrease your current Charge.",
    "featurePrereq": ["Worse Attitude", "Expanded Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Most Hateful Words",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Anger to empower your allies.",
    "featureBenDesc": "As a Partial Action if you are using Worst Attitude, you may decrease your Charge Count by 1 to speak and inspire Anger in a targeted Living ally. The ability lasts as long as your current Worst Attitude effect. By using this ability, the ally becomes Enraged as described in the Path of Violence Feature named Blood Rage. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["More Hateful Words", "Worst Attitude"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Expanded Tranquility",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Expanded Arcane Power of Tranquility.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 100' of yourself. While targeted by this ability, the target no longer wishes to engage in combat and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. The ability will last until the end of the Current Encounter. Also, if you succeed at a Melee Combat Touch attack against a Living Target, the target will disengage from Combat until the end of the Encounter. Opponents under the effect of Blood Rage will no longer be considered Enraged. The target may only benefit from this Touch once per Encounter. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Enhanced Tranquility", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Anger and negate the effects of both. This will overpower and negate the effects of Enhanced Anger."
  },
  {
    "featureName": "Greatest Peace",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Expanded Power of Tranquility to empower your actions and calm the minds of your enemies.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Arcane Presence of Tranquility. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts for 8 hours or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and move away unless attacked. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Blood Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Greatest Peace, you automatically gain the effects from the Feature Expanded Tranquility without having to decrease your current Charge.",
    "featurePrereq": ["Greater Peace", "Expanded Tranquility"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Most Peaceful Words",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Tranquility to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Greatest Peace, you may decrease your Charge Count by 1 to speak and inspire Tranquility in 2 targeted Living opponents. The ability lasts as long as your current Greatest Peace effect. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat and move away. If attacked the opponent will defend, but not deal combat damage. An opponent in Blood Rage is no longer Enraged.",
    "featurePrereq": ["More Peaceful Words", "Greatest Peace"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Master Sorcerer",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have become a Master Sorcerer.",
    "featureBenDesc": "Your Sorcerer bonus die increases from 1d8 to 1d10.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Sorcery",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have mastered the ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Superior Arcane Powers. Your Sorcery bonus die to Charge Count has increase from 1d10 to 1d12.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Master Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Empower Weapon",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane Weapon, your Empower Weapon ability Arcane Enhancement bonus die has increased from +1d10 to +1d12.",
    "featurePrereq": ["Advanced Empower Weapon", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Master Evoker",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have mastered the ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d10 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Evoker", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Darkness",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Superior Arcane Powers of Darkness.",
    "featureBenDesc": "Your Superior Darkness now has a 15' radius centered on any point that you can see within 100' of you. Your Darkness Touch Combat Check roll against all opponents within the Darkness now lowers the affected creatures' Ticker Values by 1d10.",
    "featurePrereq": ["Expanded Darkness", "Master Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Light and negate the effects of both. This will overpower and negate the effects of Expanded Light."
  },
  {
    "featureName": "Complete Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Darkness to shroud and protect you.",
    "featureBenDesc": "Your Presence of Darkness now costs 3d4+3 charges to manifest but lasts until you lose conciousness or until your Current Charge Count equals 0 without having to be maintained. The Presence now provides you with 50% Concealment against all Ranged and Melee attacks. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will now suffer 1d12 points of Shadow Damage and loss from Ticker Value for each instance of contact. Additionally, while Cloaked in Darkness, you automatically gain the effects from the Feature Superior Darkness without having to decrease your current Charge.",
    "featurePrereq": ["Deepest Darkness", "Superior Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Superior Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Darkness to attack your foes.",
    "featureBenDesc": "Once you spend 2 Charges to manifest it, Superior Darkbolt will last for as long as you are using Complete Darkness. The Darkbolt may now be used to target up to 3 opponents. You will make your normal Ranged Magic Combat check roll, but the bolt has increased to deal +3d8 points of additional damage. If there is more than one target, the additional damage from the Darkbolt will be divided you you wish among the affected targets (rounded down). Also, the targets must reduce their Ticker Values by a number equal to the additional damage dealt to each by this attack.",
    "featurePrereq": ["Advanced Darkbolt", "Complete Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Darkblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Darkness to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Complete Darkness, you may decrease your Charge Count by 1 to use your Superior Empower Weapon ability to empower a mundane weapon with Superior Darkness. The ability lasts as long as your current Complete Darkness effect. Your Empowered Weapon effect increases from +1d10 to +1d12 and the weapon deals +1d12 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Advanced Darkblade", "Superior Empower Weapon", "Complete Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Superior Flame",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Superior Flame.",
    "featureBenDesc": "You may now ignite and control fires in a location that you can see up to 100' from you. Also, if you and an any opponents are all within 50' of the same active fire, as a Ranged Combat attack, you may spend an attitional charge and attempt to direct a spark of flame toward the opponents. The ranged attack deals Fire damage, and a damaged individual must take a Standard Action before your next Turn to roll a Physical Action check against 1d10 + fire damage suffered in order to extinquish the Flame or else suffer 1d10 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Expanded Flame", "Master Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Frost and negate the effects of both. This will overpower and negate the effects of Expanded Frost."
  },
  {
    "featureName": "Inferno",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Flame to surround and protect you.",
    "featureBenDesc": "Your Presence of Flame now costs 3d4+3 charges to manifest but lasts until you lose conciousness or until your Current Charge Count equals 0 without having to be maintained. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d12 points of Fire Damage and must take a Standard Action before your next Turn to roll a Physical Action check against 1d12 + fire damage suffered in order to extinquish the Flame or else suffer 1d12 points of additional Fire damage each round until the Flame is put out. Additionally, while using Inferno, you automatically gain the effects from the Feature Superior Flame without having to decrease your current Charge.",
    "featurePrereq": ["Hottest Flames", "Superior Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Superior Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Flame to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Hotter Flames, you may decrease your Charge Count by 2 to gain the ability to target up to three opponents each round with a ranged Magic attack. You will make your normal Ranged Magic Combat check roll, but the bolt will now deal +3d8 points of additional damage. Any additional damage from the Flamebolt will be divided as you wish among all affected targets (rounded down). Also, affected targets must take a Standard Action before your next Turn to roll a Physical Action check against 1d8 + fire damage suffered in order to extinquish the Flame or else suffer 1d8 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Advanced Flamebolt", "Inferno"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Flameblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Flame to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Inferno, you may decrease your Charge Count by 1 to use your Superior Empower Weapon ability to empower a mundane weapon with Superior Flame. The ability lasts as long as your current Inferno effect. By using this ability, your Superior Empowered Weapon now gains a +1d12 Arcane Enhancement Bonus instead of +1d10. Also, the weapon deals +1d12 points of additional Fire damage on a successful Combat Attack Check roll and the target must take a Standard Action before your next Turn to roll a Physical Action check against 1d12 + fire damage suffered in order to extinquish the Flame or else suffer 1d12 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Advanced Flameblade", "Superior Empower Weapon", "Inferno"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Superior Frost",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Superior Frost.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may reduce the temperature in 15' radius area centered on a point that you can see within 100' of yourself. The effect will freeze water within the affected area and leave a hard frozen coating on other items. As a free action once per round, you may increase or decrease the temperature within the affected area from icy to only cool. The ability lasts until the end of the Current Encounter. Also, each round that a living creature remains within the area of effect, it must succeed at a Physical Activity Check roll against your Use Magic result or else suffer a decrease to Ticker value by 1d10.",
    "featurePrereq": ["Expanded Frost", "Master Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Flame and negate the effects of both. This will overpower and negate the effects of Expanded Flame."
  },
  {
    "featureName": "Freeze",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Expanded Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 3d4+3, you may manifest an Expanded Arcane Presence of Frost. The effect lasts until you lose conciousness or until your Current Charge Count equals 0. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will now suffer 1d12 points of Cold Damage and Ticker Value loss. Additionally, while using Colder Ice, you automatically gain the effects from the Feature Superior Frost without having to decrease your current Charge.",
    "featurePrereq": ["Colder Ice", "Superior Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Superior Frostbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Frost to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Freeze, you may decrease your Charge Count by 2 to gain the ability to target up to three opponents each round with a ranged Magic attack. The ability lasts as long as your current Freeze effect. You will make your normal Ranged Magic Combat check roll, but the bolt will now deal +3d8 points of additional damage and Ticker Value loss on a successful Magic Attack roll. If there is more than one target, the additional damage from the Frostbolt will be among the affected targets. (rounded down).",
    "featurePrereq": ["Advanced Frostbolt", "Freeze"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Frostblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Frost to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Freeze, you may decrease your Charge Count by 1 to use your Superior Empower Weapon ability to empower a mundane weapon with Superior Frost. The ability lasts as long as your current Freeze effect. By using this ability, your Empowered Weapon now gains a +1d12 Arcane Enhancement Bonus instead of +1d10. Also, the weapon deals +1d12 points of additional Cold damage and Ticker Value loss on a successful Magic Attack Check roll.",
    "featurePrereq": ["Advanced Frostblade", "Superior Empower Weapon", "Freeze"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Superior Light",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Superior Light.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may create or brighten radiant light from an area with a radius of up to 15' centered on a point that you can see within 100' of yourself. As a free action once per round, you may increase or decrease the level of brightness within the affected area from dim to full. The effect lasts until the end of the Current Encounter. Also, if you and other living creatures are all within the Superior Light, you may attempt to Touch all targeted creatures in order to raise their Ticker Values by 1d10. You may do this once per round as a Partial Action. Undead, Demonic, and Infernal creatures Targeted with this Touch are allowed a Spiritual Defense Check roll against your Use Magic check or else suffer 1d10 points of loss to Ticker Value.",
    "featurePrereq": ["Expanded Light", "Master Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Darkness and negate the effects of both. This will overpower and negate the effects of Expanded Darkness."
  },
  {
    "featureName": "Illuminate",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Expanded Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 3d4+3, you may manifest an Expanded Arcane Presence of Light. This Presence radiates from you and illuminates all within your Reach. The effect lasts until you lose conciousness or until your Current Charge Count equals 0. This effect provides a 90% Block against all Demonic, Infernal, and Undead attackers. Such creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d12 points of Radiant Damage and loss from Ticker Value for each instance of contact. Allies who you Touch may restore 1d12 lost hit points to their Current Health Value and as many lost points from their Ticker Value. Restored Ticker points must have been lost during the Current Encounter and must have been lost due to damage not round progression. Additionally, while using Brightest Light, you automatically gain the effects from the Feature Superior Light without having to decrease your current Charge.",
    "featurePrereq": ["Brighter Light", "Superior Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Superior Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "As a Partial Action if you are using Brightest Light, you may decrease your Charge Count by 2 to gain the ability to target up to three opponents each round with a ranged Magic attack. The ability lasts as long as your current Brightest Light effect. You will make your normal Ranged Magic Combat check roll, but the Shining Bolt will now deal +3d8 points of additional damage on a successful Magic Attack Check roll against Demonic, Infernal, and Undead targets. Also, the target must reduce its Ticker Value by a number equal to the additional damage dealt by this attack. All such additional damage will be divided among all affected targets (round down). Living allies targeted by this ability will each restore 3d8 points of lost damage to their Current Health and Ticker Values. Such damage must have been lost within the Current Encounter and cannot have been lost due to round progression.",
    "featurePrereq": ["Advanced Shining Bolt", "Brightest Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Shining Blade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Superior Light to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Brightest Light, you may decrease your Charge Count by 1 to use your Superior Empower Weapon ability to empower a mundane weapon with Superior Light. The ability lasts as long as your current Brightest Light effect. By using this ability, your Empowered Weapon now gains a +1d12 Arcane Enhancement Bonus instead of +1d2. Also, against Demonic, Infernal, and Undead opponents the weapon deals +1d12 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Advanced Shining Blade", "Superior Empower Weapon", "Brightest Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Master Invoker",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have mastered the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d10 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Invoker", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Fear",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Power of Fear.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of Dread within a Living target that you can see within 100' of yourself. You gain a +1d10 bonus to all rolls made against any Living creature targeted by this ability. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. This ability will last until the end of the Current Encounter. Also, if you succeed at a Touch Combat Check roll against the targeted opponent you can lower the target's Current Modifier value by 1d10. If this Value is lowered below 0 due to this ability, it will not also affect the target's Health. You may do this once per round as a Partial Action. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss.",
    "featurePrereq": ["Expanded Fear", "Master Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Hope and negate the effects of both. This will overpower and negate the effects of Expanded Hope."
  },
  {
    "featureName": "Complete Dread",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 3d4+3, you may manifest an Arcane Presence of Fear. The Presence lasts until you become unconscious or until your Current Charge Count equals 0. Like Deepest Dread, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else move away from you and choose a different opponent. If a Living creature does choose to enter into combat with you, you gain a +1d12 bonus to all rolls against the opponent. Additionally, while in Complete Dread, you automatically gain the effects from the Feature Superior Fear without having to decrease your current Charge.",
    "featurePrereq": ["Deepest Dread", "Superior Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Panic",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Fear to gain strength over your enemies.",
    "featureBenDesc": "As a Partial Action if you are using Complete Dread, you may decrease your Charge Count by 1 to speak and inspire Dread in all targeted Living opponents within 30' of you and each other. The ability lasts as long as your current Complete Dread effect. By using this ability, anyone who enters Combat with this target gains a +1d12 Arcane Enhancement Bonus to all rolls against the target until the end of the Current Encounter. Also, if the target fails at a Spiritual Defense roll agains your Use Magic check the target must decrease its Ticker and Modifier Values by 1d12.",
    "featurePrereq": ["Most Dreadful Words", "Complete Dread"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Superior Hope",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Superior Arcane Power of Hope.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of affection and goodwill within a Living ally that you can see within 100' of yourself. While targeted by this ability, the target gains a +1d10 bonus to all rolls made in defense of you. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. This ability lasts until the end of the Current Encounter. Also, by touching a Living target you may raise the target's Current Modifier value by 1d10. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of you Superior Hope effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Expanded Hope", "Master Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Fear and negate the effects of both. This will overpower and negate the effects of Expanded Fear."
  },
  {
    "featureName": "Complete Kindness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Power of Hope to guide others and inspire affection.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 3d4+3, you may manifest an Arcane Presence of Hope. The effect lasts until you become unconscious or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else decide that you not an enemy and choose a different opponent. Allies in combat directly adjacent to you gain a +1d12 bonus to all rolls while fighting near you. Additionally, while in Greatest Kindness, you automatically gain the effects from the Feature Superior Hope without having to decrease your current Charge.",
    "featurePrereq": ["Greatest Kindness", "Superior Hope"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Altruism",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Hope to inspire affection in your enemies and to bolster your allies.",
    "featureBenDesc": "As a Partial Action if you are using Complete Kindness, you may decrease your Charge Count by 1 to speak and inspire Affection in all targeted Living allies within 30' of you and each other. The ability lasts as long as your current Complete Kindness effect. By using this ability, the ally may add +1d12 to her Modifier Value. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["Kindest Words", "Complete Kindness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Superior Anger",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Superior Arcane Power of Anger.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of rage within a Living target that you can see within 100' of yourself. While targeted by this ability, the target gains a +1d10 bonus to all additional damgage dealt on a successful Melee Combat check. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. The effect lasts until the end of the Current Encounter. Also, by touching a Living target you may raise the target's Current Modifier value by 1d12. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of your Superior Anger effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Superior Anger", "Master Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Tranquility and negate the effects of both. This will overpower and negate the effects of Expanded Tranquility."
  },
  {
    "featureName": "Complete Anger",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Superior Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 3d4+3, you may manifest an Arcane Presence of Anger. The effect lasts until you become unconscious or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become filled with hate for a different, random target. The affected opponent will immediately change direction and attack the new target. Allies in combat directly adjacent to you gain a +1d12 bonus to all damage dealt on a successful Melee Combat check while fighting near you. Additionally, while in Complete Anger, you automatically gain the effects from the Feature Superior Anger without having to decrease your current Charge.",
    "featurePrereq": ["Worst Attitude", "Superior Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Fury",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Anger to empower your allies.",
    "featureBenDesc": "As a Partial Action if you are using Complete Anger, you may decrease your Charge Count by 1 to speak and inspire Anger in all targeted Living allies within 30' of you and each other. By using this ability, the ally becomes Enraged as described in the Path of Violence Feature named Blind Rage. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter.",
    "featurePrereq": ["Most Hateful Words", "Complete Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Superior Tranquility",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Superior Arcane Power of Tranquility.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 100' of yourself. While targeted by this ability, the target no longer wishes to engage in combat and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. The ability will last until the end of the Current Encounter. Also, if you succeed at a Melee Combat Touch attack against a Living Target, the target will disengage from Combat until the end of the Encounter. Opponents under the effect of Blind Rage will no longer be considered Enraged. The target may only benefit from this Touch once per Encounter. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Expanded Tranquility", "Master Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Anger and negate the effects of both. This will overpower and negate the effects of Expanded Anger."
  },
  {
    "featureName": "Complete Tranquility",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Superior Power of Tranquility to empower your actions and calm the minds of your enemies.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 3d4+3, you may manifest an Arcane Presence of Tranquility. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts until you become unconscious or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and attempt to convince any nearby allies to also end hostilies. The target will attempt to physically block an ally from attacking, causing the creature to be unable to attack while the target is blocking them. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Blind Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Peaceful, you automatically gain the effects from the Feature Superior Tranquility without having to decrease your current Charge.",
    "featurePrereq": ["Greatest Peace", "Superior Tranquility"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Peaceful",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Superior Tranquility to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Complete Tranquility, you may decrease your Charge Count by 1 to speak and inspire Tranquility in all targeted Living opponents within 30' of you and each other. The ability lasts as long as your current Complete Tranquility effect. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat, have a seat, and rest. If attacked the opponent will defend, but not deal combat damage. An opponent in Blind Rage is no longer Enraged.",
    "featurePrereq": ["Most Peaceful Words", "Complete Tranquility"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Elite Sorcerer",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You are one of the greatest Sorcerers of your time.",
    "featureBenDesc": "Your Sorcerer bonus die increases from 1d10 to 1d12.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Sorcery",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have excelled in the ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Elite Arcane Powers. Your Sorcery bonus die to Charge Count is now 2d10 instead of 1d12.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Elite Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Unbound Sorcery",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "Your skills in Sorcery allow you to transcend the limits of Arcane Power.",
    "featureBenDesc": "If you have Evocation as a trained Feature, you now also have Invocation as a trained Feature. If you have Invocation as a trained Feature, you now also have Evocation as a trained Feature.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Elite Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Empower Weapon",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane Weapon, your Empower Weapon ability Arcane Enhancement bonus die is now 2d10 instead of 1d12.",
    "featurePrereq": ["Advanced Empower Weapon", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Dreaded Darkness",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bring Darkness and Fear to your enemies.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 4d4+4, you may manifest an Arcane Presence of Dreaded Darkness which combines all of the abilites from Complete Darkness and Complete Fear.",
    "featurePrereq": ["Complete Darkness", "Complete Fear", "Unbound Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Hopeful Light and negate the effects of both. This will overpower and negate the effects of all lesser Light and Hope Arcane Powers."
  },
  {
    "featureName": "Hopeful Light",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bring Light and Hope to your allies.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 4d4+4, you may manifest an Arcane Presence of Hopeful Light which combines all of the abilites from Complete Light and Complete Hope.",
    "featurePrereq": ["Complete Light", "Complete Hope", "Unbound Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Light of Hope and negate the effects of both. This will overpower and negate the effects of all lesser Light and Hope Arcane Powers."
  },
  {
    "featureName": "Elite Evoker",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have excelled in the ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d12 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Master Evoker", "Elite Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Elite Darkness",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Elite Arcane Powers of Darkness.",
    "featureBenDesc": "Your Elite Darkness now has a 15' radius centered on any point that you can see within 100' of you. Your Darkness Touch Combat Check roll against a targeted opponent within the Darkness now lowers the Target's Ticker Value by 1d12.",
    "featurePrereq": ["Superior Darkness", "Elite Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Elite Light and negate the effects of both. This will overpower and negate the effects from all lesser Arcane Powers of Light."
  },
  {
    "featureName": "Absolute Darkness",
    "featureCost": 6,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Absolute Darkness to shroud and protect you.",
    "featureBenDesc": "Your Presence of Darkness now costs 4d4+4 charges to manifest but lasts until you lose conciousness or until your Current Charge Count equals 0 without having to be maintained. While in the Presence of Absolute Darkness you now also automaically manifest the abilities of Elite Darkness, Complete Darkness, Superior Darkbolt, and Superior Darkblade without spending any additional Charges to do so.",
    "featurePrereq": ["Complete Darkness", "Superior Darkbolt", "Superior Darkblade", "Elite Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Elite Flame",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Elite Flame.",
    "featureBenDesc": "As a standard action if you spend 1 charge, you may now ignite and control fires in a location that you can see up to 100' from you until the end of the Current Encouter. Also, if any number of opponents are all within 100' of any active fire and each other, as a Ranged Combat attack, you may spend an additional charge in the attempt to direct sparks of flame toward those targets. The single ranged attack is rolled and deals Fire damage. All damaged individuals must take a Standard Action before your next Turn to roll a Physical Action check against 1d12 + fire damage suffered in order to extinquish the Flame or else suffer 1d12 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Superior Flame", "Elite Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Frost and negate the effects of both. This will overpower and negate the effects from all lesser Arcane Powers of Frost."
  },
  {
    "featureName": "Absolute Inferno",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Flame to surround and protect you.",
    "featureBenDesc": "Your Presence of Flame now costs 4d4+4 charges to manifest but lasts until you lose conciousness or until your Current Charge Count equals 0 without having to be maintained. While in the Presence of Absolute Inferno you now also automaically manifest the abilities of Elite Flame, Inferno, Superior Flamebolt, and Superior Flameblade without having to spend additional Charges to do so.",
    "featurePrereq": ["Inferno", "Superior Flamebolt", "Superior Flameblade", "Elite Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Elite Frost",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Elite Frost.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may reduce the temperature in 20' radius area centered on a point that you can see within 100' of yourself. The effect will freeze water within the affected area and leave a hard frozen coating on other items. As a free action once per round, you may increase or decrease the temperature within the affected area from icy to only cool. The ability lasts until the end of the Current Encounter. Also, each round that a living creature remains within the area of effect, it must succeed at a Physical Activity Check roll against your Use Magic result or else suffer a decrease to Ticker value by 1d12.",
    "featurePrereq": ["Superior Frost", "Elite Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Superior Frost and negate the effects of both. This will overpower and negate the effects from all lesser Arcane Powers of Frost."
  },
  {
    "featureName": "Absolute Inferno",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Elite Frost to surround and protect you.",
    "featureBenDesc": "Your Presence of Frost now costs 4d4+4 charges to manifest but lasts until you lose conciousness or until your Current Charge Count equals 0 without having to be maintained. While in the Presence of Absolute Inferno you now also automaically manifest the abilities of Elite Frost, Inferno, Superior Frostbolt, and Superior Frostblade without having to spend additional Charges to do so.",
    "featurePrereq": ["Inferno", "Superior Frostbolt", "Superior Frostblade", "Elite Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Elite Invoker",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have excelled in the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d12 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Master Invoker", "Elite Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  }





]