[
  {
    "featureName": "Sorcery",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have developed an ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Primal Arcane Powers. Add +1 Charge to your Charge roll result.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Self-Awareness", "Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Evocation",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have learned to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you may add +1d4 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Kinetomancy",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have harnessed your physical being and its movements to capture and control Arcane Energy.",
    "featureBenDesc": "You will now use your Physical Ability modifier dice instead of your Mental Ability modifier dice when making any Magic Use/Attack check rolls for Arcane Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Kinetic Charge",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can burn stored physical reserves as temporary Arcane Energy.",
    "featureBenDesc": "If your Current Charge Value has been reduced to 0, you may reduce your Ticker Value and Current Health Value each by 1d4 in order to increase your Current Charge Count by 1.  You may do this as many times during an Encounter as you like until your Ticker or Health has been reduced to 0. All temporary Charges gained in this way are lost at the end of the Encounter.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Kinetomancy"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If you use this ability during an Encounter, you will be considered Exhasted at the end of the Encounter."
  },
  {
    "featureName": "Empower Weapon",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "As a Partial Action, if you spend one Charge, you may empower a mundane weapon (melee, ranged, or unarmed attack) with a +1d4 Arcane Enhancement bonus to Combat Attack check rolls 10 full rounds. As a free action, you may maintain a weapon so empowered by spending another 1 Charge for each additional 10 rounds. As long as a weapon is empowered, it is considered to be a Magic Weapon.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If you use this ability during an Encounter, you will be considered Exhasted at the end of the Encounter."
  },
  {
    "featureName": "Primal Darkness",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "ArcanePower",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Darkness.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may diminish or remove light from an area with a radius of up to 5' centered on a point that you can see within 30' of yourself. As a free action once per round, you may increase or decrease the level of darkenss within the affected area from dim to complete darkness. As part of this Power, you are able to see within the affected area as though the effect were not present. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be extended as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, if you and an opponent are both within the Primal Darkness, you may attempt a Touch Combat Check roll against the targeted opponent in order to lower her Ticker Value by 1d4. You may do this once per round as a Partial Action. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss.",
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Light and negate the effects of both."
  },
  {
    "featureName": "Cloaked in Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "ArcanePower",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to shroud and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest a Presence of Darkness. This Presence rises up around you to dim the level of all light within your Reach. While near you, others feel a little nervous. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Cloaked in Darkness ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. This Power provides you with 10% Concealment against all Ranged and Melee attacks. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of Shadow Damage and loss from Ticker Value for each instance of contact. Additionally, while Cloaked in Darkness, you automatically gain the effects from the Feature Primal Darkness without having to decrease your current Charge.",
    "featurePrereq": ["Evocation", "Primal Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "ArcanePower",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Cloaked by Darkness, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Cloaked in Darkness effect. Darkbolt must be re-manifested with 1 additional Charge each time your Cloak is renewed. The Darkbolt deals +1d6 points of additional damage on a successful Magic Attack Check roll. Also, the target must reduce her Ticker Value by a number equal to the additional damage dealt by this attack.",
    "featurePrereq": ["Evocation", "Cloaked by Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Darkblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "ArcanePower",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Cloaked by Darkness, you may decrease your Charge Count by 1 to use your Empower Weapon ability empower a mundane weapon with Primal Darkness. The ability lasts as long as your current Cloaked in Darkness effect. Darkblade must be re-manifested with 1 additional Charge each time your Cloak is renewed. By using this ability, your Empowered Weapon now gains a +1d6 Arcane Enhancement Bonus instead of +1d4. Also, the weapon deals +1d6 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Empower Weapon", "Cloaked in Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Primal Flame",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "ArcanePower",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Flame.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may ignite a flame centered on a point that you can see within 30' of yourself. Unattended combustable material will catch fire. As a free action once per round, you may increase or decrease the size of an active fire within the affected area from embers to a complete blaze.  Increasing a fire's size in this way will cause it to burn through its fuel at a faster rate. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be extended as a Free Action beyond the initial limit by spending 1 additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, if you and an opponent are both within 10 of the same active fire, as a Ranged Combat attack, you may attempt to direct a spark of flame toward the target. The ranged attack deals Fire damage, and a damaged individual must take a Standard Action before your next Turn to roll a Physical Action check against 1d4 + fire damage suffered in order to extinquish the Flame or else suffer 1d4 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Frost and negate the effects of both."
  },
  {
    "featureName": "Wreathed in Flames",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "ArcanePower",
    "featureDesc": "You can use the Arcane Power of Primal Flame to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest a Presence of Flame. This Presence ignites around you and wraps your form in spectral fire.  While near you, others feel a bit warmer. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Wreathed in Flames ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. This effect negates ½ of all Fire and Cold damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of Fire Damage and must take a Standard Action before your next Turn to roll a Physical Action check against 1d6 + fire damage suffered in order to extinquish the Flame or else suffer 1d6 points of additional Fire damage each round until the Flame is put out. Additionally, while Wreathed in Flames, you automatically gain the effects from the Feature Primal Flame without having to decrease your current Charge.",
    "featurePrereq": ["Evocation", "Primal Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "ArcanePower",
    "featureDesc": "You can use the Arcane Power of Primal Flame to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Wreathed in Flames, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Wreathed in Flames effect. Flamebolt must be re-manifested with an additional Charge each time your Cloak is renewed. The Flamebolt deals +1d6 points of additional Fire damage on a successful Magic Attack Check roll. Also, the target must take a Standard Action before your next Turn to roll a Physical Action check against 1d6 + fire damage suffered in order to extinquish the Flame or else suffer 1d6 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Evocation", "Wreathed in Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Flameblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "ArcanePower",
    "featureDesc": "You can use the Arcane Power of Primal Flame to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Wreathed in Flames, you may decrease your Charge Count by 1 to use your Empower Weapon ability empower a mundane weapon with Primal Flame. The ability lasts as long as your current Wreathed in Flames effect. Flameblade must be re-manifested with an additional Charge each time your Cloak is renewed. By using this ability, your Empowered Weapon now gains a +1d6 Arcane Enhancement Bonus instead of +1d4. Also, the weapon deals +1d6 points of additional Fire damage on a successful Combat Attack Check roll and the target must take a Standard Action before your next Turn to roll a Physical Action check against 1d6 + fire damage suffered in order to extinquish the Flame or else suffer 1d6 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Empower Weapon", "Wreathed in Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  }
  

]