[{
    "featureName": "Sorcery",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have developed an ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Primal Arcane Powers. Add +1d4 Charge to your Charge roll result.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Self-Awareness", "Bind Arcana"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Kinetomancy",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have harnessed your physical being and its movements to capture and control Arcane Energy.",
    "featureBenDesc": "You may now use your Physical Ability modifier dice instead of your Mental Ability modifier dice when making any Magic Use/Attack check rolls for Arcane Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Ectomancy",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have harnessed your spiritual being and its emotions to capture and control Arcane Energy.",
    "featureBenDesc": "You may now use your Spiritual Ability modifier dice instead of your Mental Ability modifier dice when making any Magic Use/Attack check rolls for Arcane Magic.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Empower Weapon",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "As a Partial Action, if you spend one Charge, you may empower a mundane weapon (melee, ranged, or unarmed attack) with a +1d4 Arcane Enhancement bonus to Combat Attack check rolls 10 full rounds. As a free action, you may maintain a weapon so empowered by spending another 1 Charge for each additional 10 rounds. As long as a weapon is empowered, it is considered to be a Magic Weapon.",
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Evocation",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have learned to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you may add +1d4 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Kinetomancy"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may not take this Feature if you have already taken the Feature Invocation."
  },
  {
    "featureName": "Primal Darkness",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Darkness.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may diminish or remove light from an area with a radius of up to 5' centered on a point that you can see within 30' of yourself. As a free action once per round, you may increase or decrease the level of darkenss within the affected area from dim to complete darkness. As part of this Power, you are able to see within the affected area as though the effect were not present. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, if you and an opponent are both within the Primal Darkness, you may attempt a Touch Combat Check roll against the targeted opponent in order to lower her Ticker Value by 1d4. You may do this once per round as a Partial Action. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Light and negate the effects of both."
  },
  {
    "featureName": "Cloaked in Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to shroud and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Darkness. This Presence rises up around you to dim the level of all light within your Reach. While near you, others feel a little unsure. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Cloaked in Darkness ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. This Power provides you with 10% Concealment against all Ranged and Melee attacks. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of Shadow Damage and loss from Ticker Value for each instance of contact. Additionally, while Cloaked in Darkness, you automatically gain the effects from the Feature Primal Darkness without having to decrease your current Charge.",
    "featurePrereq": ["Primal Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Cloaked by Darkness, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Cloaked in Darkness effect. Darkbolt must be re-manifested with 1 additional Charge each time your Cloak is renewed. The Darkbolt deals +1d6 points of additional damage on a successful Magic Attack Check roll. Also, the target must reduce her Ticker Value by a number equal to the additional damage dealt by this attack.",
    "featurePrereq": ["Cloaked by Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Darkblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Darkness to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Cloaked by Darkness, you may decrease your Charge Count by 1 to use your Empower Weapon ability empower a mundane weapon with Primal Darkness. The ability lasts as long as your current Cloaked in Darkness effect. Darkblade must be re-manifested with 1 additional Charge each time your Cloak is renewed. By using this ability, your Empowered Weapon now gains a +1d6 Arcane Enhancement Bonus instead of +1d4. Also, the weapon deals +1d6 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Empower Weapon", "Cloaked in Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Primal Flame",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Flame.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may ignite a flame centered on a point that you can see within 30' of yourself. Unattended combustable material will catch fire. As a free action once per round, you may increase or decrease the size of an active fire within the affected area from embers to a complete blaze.  Increasing a fire's size in this way will cause it to burn through its fuel at a faster rate. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending 1 additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, if you and an opponent are both within 10' of the same active fire, as a Ranged Combat attack, you may attempt to direct a spark of flame toward the target. The ranged attack deals Fire damage, and a damaged individual must take a Standard Action before your next Turn to roll a Physical Action check against 1d4 + fire damage suffered in order to extinquish the Flame or else suffer 1d4 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Frost and negate the effects of both."
  },
  {
    "featureName": "Wreathed in Flames",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Flame to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Flame. This Presence ignites around you and wraps your form in spectral fire.  While near you, others feel a bit warmer. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Wreathed in Flames ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. This effect negates ½ of all Fire and Cold damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of Fire Damage and must take a Standard Action before your next Turn to roll a Physical Action check against 1d6 + fire damage suffered in order to extinquish the Flame or else suffer 1d6 points of additional Fire damage each round until the Flame is put out. Additionally, while Wreathed in Flames, you automatically gain the effects from the Feature Primal Flame without having to decrease your current Charge.",
    "featurePrereq": ["Primal Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Flame to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Wreathed in Flames, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Wreathed in Flames effect. Flamebolt must be re-manifested with an additional Charge each time your Presence is renewed. The Flamebolt deals +1d6 points of additional Fire damage on a successful Magic Attack Check roll. Also, the target must take a Standard Action before your next Turn to roll a Physical Action check against 1d6 + fire damage suffered in order to extinquish the Flame or else suffer 1d6 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Wreathed in Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Flameblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Flame to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Wreathed in Flames, you may decrease your Charge Count by 1 to use your Empower Weapon ability empower a mundane weapon with Primal Flame. The ability lasts as long as your current Wreathed in Flames effect. Flameblade must be re-manifested with an additional Charge each time your Presence is renewed. By using this ability, your Empowered Weapon now gains a +1d6 Arcane Enhancement Bonus instead of +1d4. Also, the weapon deals +1d6 points of additional Fire damage on a successful Combat Attack Check roll and the target must take a Standard Action before your next Turn to roll a Physical Action check against 1d6 + fire damage suffered in order to extinquish the Flame or else suffer 1d6 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Empower Weapon", "Wreathed in Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Primal Frost",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Frost.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may reduce the temperature in 5' radiius area centered on a point that you can see within 30' of yourself. The effect will freeze water within the affected area and leave an frosty coating on other items. As a free action once per round, you may increase or decrease the temperature within the affected area from icy to only cool. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending 1 additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, each round that a living creature remains within the area of effect, it must succeed at a Physical Activity Check roll against your Use Magic result or else suffer a decrease to Ticker value by 1d4.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Flame and negate the effects of both."
  },
  {
    "featureName": "Encased in Ice",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Primal Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Frost. This Presence condenses around you and covers your form in spectral ice.  While near you, others feel a bit cold. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Encased in Ice ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. This effect negates ½ of all Cold and Fire damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of Cold Damage and Ticker Value loss. Additionally, while Encased in Ice, you automatically gain the effects from the Feature Primal Frost without having to decrease your current Charge.",
    "featurePrereq": ["Primal Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Frostbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Frost to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Encased in Ice, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Encased in Ice effect. Frostbolt must be re-manifested with an additional Charge each time your Presence is renewed. The Frostbolt deals +1d6 points of additional Cold damage and Ticker Value loss on a successful Magic Attack Check roll.",
    "featurePrereq": ["Encased in Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Frostblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Frost to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Encased in Ice, you may decrease your Charge Count by 1 to use your Empower Weapon ability empower a mundane weapon with Primal Frost. The ability lasts as long as your current Encased in Ice effect. Frostblade must be re-manifested with an additional Charge each time your Presence is renewed. By using this ability, your Empowered Weapon now gains a +1d6 Arcane Enhancement Bonus instead of +1d4. Also, the weapon deals +1d6 points of additional Cold damage and Ticker Value loss on a successful Magic Attack Check roll.",
    "featurePrereq": ["Empower Weapon", "Encased in Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Primal Light",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Primal Light.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may create or brighten radiant light from an area with a radius of up to 5' centered on a point that you can see within 30' of yourself. As a free action once per round, you may increase or decrease the level of brightness within the affected area from dim to full. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, if you and another living creature are both within the Primal Light, you may attempt to Touch the targeted creature in order to raise her Ticker Value by 1d4. You may do this once per round as a Partial Action. Undead, Demonic, and Infernal creatures Targeted with this Touch are allowed a Spiritual Defense Check roll against your Use Magic check or else suffer 1d4 points of loss to Ticker Value.",
    "featurePrereq": ["Evocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Darkness and negate the effects of both."
  },
  {
    "featureName": "Bathed in Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Primal Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Light. This Presence radiates from you and illuminates all within your Reach.  While near you, others feel a bit cheered. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Bathed in Light ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. This effect provides a 20% Block against all Demonic, Infernal, and Undead attackers. Such creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d6 points of Radiant Damage and loss from Ticker Value for each instance of contact. Allies who you Touch may restore 1d6 lost hit points to their Current Health Value and as many lost points from their Ticker Value. Restored Ticker points must have been lost during the Current Encounter and must have been lost due to damage not round progression. Additionally, while Bathed in Light, you automatically gain the effects from the Feature Primal Light without having to decrease your current Charge.",
    "featurePrereq": ["Primal Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "As a Partial Action if you are using Bathed in Light, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Bathed in Light effect. Shining Bolt must be re-manifested with 1 additional Charge each time your Cloak is renewed. The Shining Bolt deals +1d6 points of additional damage on a successful Magic Attack Check roll against Demonic, Infernal, and Undead targets. Also, the target must reduce its Ticker Value by a number equal to the additional damage dealt by this attack. Living allies targeted by this ability will restore 1d6 points of lost damage to their Current Health and Ticker Values.  Such damage must have been lost within the Current Encounter and cannot have been lost due to round progression.",
    "featurePrereq": ["Bathed in Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Shining Blade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Primal Light to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Bathed in Light, you may decrease your Charge Count by 1 to use your Empower Weapon ability empower a mundane weapon with Primal Light. The ability lasts as long as your current Bathed in Light effect. Shining Blade must be re-manifested with 1 additional Charge each time your Cloak is renewed. By using this ability, your Empowered Weapon now gains a +1d6 Arcane Enhancement Bonus instead of +1d4. Also, against Demonic, Infernal, and Undead opponents the weapon deals +1d6 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Empower Weapon", "Bathed in Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Invocation",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, you may add +1d4 to your Use Magic check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Ectomancy"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may not take this Feature if you have already taken the Feature Evocation."
  },
  {
    "featureName": "Primal Fear",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Power of Fear.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of Dread within a Living target that you can see within 30' of yourself. You appear Fearsome and Intimidating to the target. You gain a +1d4 bonus to all rolls made against any Living creature targeted by this ability. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 30' of you. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, if you succeed at a Touch Combat Check roll against the targeted opponent you can lower the target's Current Modifier value by 1d4. If this Value is lowered below 0 due to this ability, it will not also affect the target's Health. You may do this once per round as a Partial Action. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Friendship and negate the effects of both."
  },
  {
    "featureName": "Dreadful Guise",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Primal Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Fear. This Presence inspires dread in those who see you.  While near you, others feel a bit frightened. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Dreadful Guise ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else move away from you and choose a different opponent. If a Living creature does choose to enter into combat with you, you gain a +1d6 bonus to all rolls against the opponent. Additionally, while in Dreadful Guise, you automatically gain the effects from the Feature Primal Fear without having to decrease your current Charge.",
    "featurePrereq": ["Invocation", "Primal Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Dreadful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Fear to gain strength over your enemies.",
    "featureBenDesc": "As a Partial Action if you are using Dreadful Guise, you may decrease your Charge Count by 1 to speak and inspire Dread in a targeted Living opponent. The ability lasts as long as your current Dreadful Guise effect. Dreadful Words must be re-manifested with 1 additional Charge each time your Presence is renewed. By using this ability, anyone who enters Combat with this target gains a +1d6 Arcane Enhancement Bonus to all rolls against the target. Also, if the target fails at a Spiritual Defense roll agains your Use Magic check the target must decrease its Ticker and Modifier Values by 1d4.",
    "featurePrereq": ["Dreadful Guise"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Primal Friendship",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Arcane Power of Friendship.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of affection and goodwill within a Living ally that you can see within 30' of yourself. While targeted by this ability, the target gains a +1d4 bonus to all rolls made in defense of you. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 30' of you. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, by touching a Living target you may raise the target's Current Modifier value by 1d4. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of you Primal Friendship effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Fear and negate the effects of both."
  },
  {
    "featureName": "Kind Demeanor",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Friendship to guide others and inspire affection.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Friendship. This Presence inspires enthusiasm in those who see you. While near you, others feel a bit cheered. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Kind Demeanor ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else decide that you not an enemy and choose a different opponent. Allies in combat directly adjacent to you gain a +1d6 bonus to all rolls while fighting near you. Additionally, while in Kind Demeanor, you automatically gain the effects from the Feature Primal Friendship without having to decrease your current Charge.",
    "featurePrereq": ["Invocation", "Primal Friendship"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Kind Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Friendship to inspire affection in your enemies and to bolster your allies.",
    "featureBenDesc": "As a Partial Action if you are using Kind Demeanor, you may decrease your Charge Count by 1 to speak and inspire Affection in a targeted Living ally. The ability lasts as long as your current Kind Demeanor effect. Kind Words must be re-manifested with 1 additional Charge each time your Presence is renewed. By using this ability, the ally may add +1d6 to her Modifier Value. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["Kind Demeanor"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Primal Anger",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Arcane Power of Anger.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of rage within a Living target that you can see within 30' of yourself. While targeted by this ability, the target gains a +1d4 bonus to all additional damgage dealt on a successful Melee Combat check. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 30' of you. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, by touching a Living target you may raise the target's Current Modifier value by 1d4. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of you Primal Anger effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Serenity and negate the effects of both."
  },
  {
    "featureName": "Bad Attitude",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Anger. This Presence inspires rage in those who see you. While near you, others feel frustrated and angry. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Bad Attitude ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become filled with hate for a different, random target. The affected opponent will immediately change direction and attack the new target. Allies in combat directly adjacent to you gain a +1d6 bonus to all damage dealt on a successful Melee Combat check while fighting near you. Additionally, while in Bad Attitude, you automatically gain the effects from the Feature Primal Anger without having to decrease your current Charge.",
    "featurePrereq": ["Invocation", "Primal Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Hateful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Anger to empower your allies.",
    "featureBenDesc": "As a Partial Action if you are using Bad Attitude, you may decrease your Charge Count by 1 to speak and inspire Anger in a targeted Living ally. The ability lasts as long as your current Bad Attitude effect. Hateful Words must be re-manifested with 1 additional Charge each time your Presence is renewed. By using this ability, the ally becomes Enraged as described in the Warrior Feature named Battle Rage. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["Bad Attitude"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Primal Serenity",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Arcane Power of Serenity.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 30' of yourself. While targeted by this ability, the target no longer wishes to engage in combat and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 30' of you. Initially, the effect lasts for a number of rounds equal to your Use Magic Check roll result, but may be Expanded as a Free Action beyond the initial limit by spending an additional Charge for a further number of rounds equal to a new Use Magic Check roll result. Also, if you succeed at a Melee Combat Touch attack against a Living Target, the target will disengage from Combat until the end of the Encounter. Opponents under the effect of Battle Rage will no longer be considered Enraged. The target may only benefit from this Touch once per Encounter. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Invocation"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Primal Anger and negate the effects of both."
  },
  {
    "featureName": "Calming Presence",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Serenity to empower your actions and calm the minds of your enemies.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Serenity. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts for a number of rounds equal to your Use Magic Check roll result + the Charge cost. Before Calming Presence ends, you may continue the effect as a Free Action by spending 1 additional Charge and making a new Use Magic Check roll to establish how many rounds the effect will continue. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and move away unless attacked. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Battle Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Calming Presence, you automatically gain the effects from the Feature Primal Serenity without having to decrease your current Charge.",
    "featurePrereq": ["Invocation", "Primal Serenity"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Peaceful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Primal Serenity to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Calming Presence, you may decrease your Charge Count by 1 to speak and inspire Serenity in a targeted Living opponent. The ability lasts as long as your current Calming Presence effect. Peaceful Words must be re-manifested with 1 additional Charge each time your Presence is renewed. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat and move away. If attacked the opponent will defend, but not deal combat damage. An opponent in Battle Rage is no longer Enraged.",
    "featurePrereq": ["Calming Presence"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Novice Sorcerer",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have learned what it is to be a Sorcerer.",
    "featureBenDesc": "Gain a +1d4 bonus to your Use Magic Check rolls when attempting to use an Arcane Power ability.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Sorcery",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have improved your ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Enhanced Arcane Powers. Your Sorcery bonus die to Charge Count has increase from 1d4 to 1d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Empower Weapon",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane Weapon, your Empower Weapon ability Arcane Enhancement bonus die has increased from +1d4 to +1d6. The effect now lasts until the end of the Current Encounter.",
    "featurePrereq": ["Empower Weapon", "Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Novice Evoker",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have improved your ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d6 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Evocation", "Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Enhanced Darkness",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Enhanced Arcane Powers of Darkness.",
    "featureBenDesc": "You may now direct your Primal Darkness to any point that you can see within 50' of you. Your Primal Darkness Touch Combat Check roll against a targeted opponent within the Primal Darkness now lowers the Target's Ticker Value by 1d6.",
    "featurePrereq": ["Primal Darkness", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Light and negate the effects of both. This will overpower and negate the effects of Primal Light."
  },
  {
    "featureName": "Deeper Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Darkness to shroud and protect you.",
    "featureBenDesc": "Your Cloak of Darkness now lasts until the end of the Current Encounter without having to be maintained. The Presence now provides you with 20% Concealment against all Ranged and Melee attacks. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will now suffer 1d8 points of Shadow Damage and loss from Ticker Value for each instance of contact. Additionally, while Cloaked in Darkness, you automatically gain the effects from the Feature Enhanced Darkness without having to decrease your current Charge.",
    "featurePrereq": ["Cloaked by Darkness", "Enhanced Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Darkness to attack your foes.",
    "featureBenDesc": "Once you spend the Charge to manifest it, Darkbolt will now last for as long as you are using Deeper Darkness. The Darkbolt now deals +1d8 points of additional damage on a successful Magic Attack Check roll. Also, the target must reduce her Ticker Value by a number equal to the additional damage dealt by this attack.",
    "featurePrereq": ["Darkbolt", "Deeper Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Darkblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Darkness to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Deeper Darkness, you may decrease your Charge Count by 1 to use your Empower Weapon ability to empower a mundane weapon with Enhanced Darkness. The ability lasts as long as your current Deeper Darkness effect. Your Empowered Weapon effect increases from +1d6 to +1d8 and the weapon deals +1d8 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Darkblade", "Improved Empower Weapon", "Deeper Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Enhanced Flame",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Enhanced Flame.",
    "featureBenDesc": "Your Primal Flame may now be within 50' of yourself. Enhanced Flame lasts until the end of the Current Encounter and does not need to be maintained. Also, if you and an opponent are both within 20' of the same active fire, as a Ranged Combat attack, you may attempt to direct a spark of flame toward the target. The ranged attack deals Fire damage, and a damaged individual must take a Standard Action before your next Turn to roll a Physical Action check against 1d6 + fire damage suffered in order to extinquish the Flame or else suffer 1d6 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Primal Flame", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Frost and negate the effects of both. This will overpower and negate the effects of Primal Frost."
  },
  {
    "featureName": "Hotter Flames",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Flame to surround and protect you.",
    "featureBenDesc": "Your Flame Presence now lasts until the end of the current Encounter and does not need to be maintained. This effect now negates 3/4 of all Fire and 1/2 of all Cold damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d8 points of Fire Damage and must take a Standard Action before your next Turn to roll a Physical Action check against 1d8 + fire damage suffered in order to extinquish the Flame or else suffer 1d6 points of additional Fire damage each round until the Flame is put out. Additionally, while Wreathed in Flames, you automatically gain the effects from the Feature Enhanced Flame without having to decrease your current Charge.",
    "featurePrereq": ["Wreathed in Flames", "Enhanced Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Flame to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Hotter Flames, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Hotter Flames effect. The Flamebolt deals +1d8 points of additional Fire damage on a successful Magic Attack Check roll. Also, the target must take a Standard Action before your next Turn to roll a Physical Action check against 1d8 + fire damage suffered in order to extinquish the Flame or else suffer 1d8 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Flamebolt", "Hotter Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Flameblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Flame to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Hotter Flames, you may decrease your Charge Count by 1 to use your Improved Empower Weapon ability to empower a mundane weapon with Enhanced Flame. The ability lasts as long as your current Hotter Flames effect. By using this ability, your Improved Empowered Weapon now gains a +1d8 Arcane Enhancement Bonus instead of +1d6. Also, the weapon deals +1d8 points of additional Fire damage on a successful Combat Attack Check roll and the target must take a Standard Action before your next Turn to roll a Physical Action check against 1d8 + fire damage suffered in order to extinquish the Flame or else suffer 1d8 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Flameblade", "Improved Empower Weapon", "Hotter Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Enhanced Frost",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Enhanced Frost.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may reduce the temperature in 5' radiius area centered on a point that you can see within 50' of yourself. The effect will freeze water within the affected area and leave an icy coating on other items. As a free action once per round, you may increase or decrease the temperature within the affected area from icy to only cool. The ability lasts until the end of the Current Encounter. Also, each round that a living creature remains within the area of effect, it must succeed at a Physical Activity Check roll against your Use Magic result or else suffer a decrease to Ticker value by 1d6.",
    "featurePrereq": ["Primal Frost", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Flame and negate the effects of both. This will overpower and negate the effects of Primal Flame."
  },
  {
    "featureName": "Colder Ice",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Enhanced Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Enhanced Arcane Presence of Frost. The effect lasts untile the end of the current Encounter. This effect now negates 3/4 of all Cold and 1/2 of all Fire damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will now suffer 1d8 points of Cold Damage and Ticker Value loss. Additionally, while using Colder Ice, you automatically gain the effects from the Feature Enhanced Frost without having to decrease your current Charge.",
    "featurePrereq": ["Encased in Ice", "Enhanced Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Frostbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Frost to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Colder Ice, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Colder Ice effect. Frostbolt must be re-manifested with an additional Charge each time your Presence is renewed. The Frostbolt deals +1d8 points of additional Cold damage and Ticker Value loss on a successful Magic Attack Check roll.",
    "featurePrereq": ["Frostbolt", "Colder Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Frostblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Frost to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Colder Ice, you may decrease your Charge Count by 1 to use your Improved Empower Weapon ability to empower a mundane weapon with Enhanced Frost. The ability lasts as long as your current Colder Ice effect. By using this ability, your Empowered Weapon now gains a +1d8 Arcane Enhancement Bonus instead of +1d6. Also, the weapon deals +1d8 points of additional Cold damage and Ticker Value loss on a successful Magic Attack Check roll.",
    "featurePrereq": ["Frostblade", "Improved Empower Weapon", "Colder Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Enhanced Light",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Enhanced Light.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may create or brighten radiant light from an area with a radius of up to 5' centered on a point that you can see within 50' of yourself. As a free action once per round, you may increase or decrease the level of brightness within the affected area from dim to full. The effect lasts until the end of the Current Encounter. Also, if you and another living creature are both within the Enhanced Light, you may attempt to Touch the targeted creature in order to raise her Ticker Value by 1d6. You may do this once per round as a Partial Action. Undead, Demonic, and Infernal creatures Targeted with this Touch are allowed a Spiritual Defense Check roll against your Use Magic check or else suffer 1d6 points of loss to Ticker Value.",
    "featurePrereq": ["Primal Light", "Novice Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Darkness and negate the effects of both. This will overpower and negate the effects of Primal Darkness."
  },
  {
    "featureName": "Brighter Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Primal Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Enhanced Arcane Presence of Light. This Presence radiates from you and illuminates all within your Reach. The effect lasts until the end of the Current Encounter. This effect provides a 50% Block against all Demonic, Infernal, and Undead attackers. Such creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d8 points of Radiant Damage and loss from Ticker Value for each instance of contact. Allies who you Touch may restore 1d8 lost hit points to their Current Health Value and as many lost points from their Ticker Value. Restored Ticker points must have been lost during the Current Encounter and must have been lost due to damage not round progression. Additionally, while using Brighter Light, you automatically gain the effects from the Feature Enhanced Light without having to decrease your current Charge.",
    "featurePrereq": ["Bathed in Light", "Enhanced Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Improved Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "As a Partial Action if you are using Brighter Light, you may decrease your Charge Count by 1 to gain the ability to target one opponent each round with a ranged Magic attack. The ability lasts as long as your current Brighter Light effect. The Shining Bolt deals +1d8 points of additional damage on a successful Magic Attack Check roll against Demonic, Infernal, and Undead targets. Also, the target must reduce its Ticker Value by a number equal to the additional damage dealt by this attack. Living allies targeted by this ability will restore 1d8 points of lost damage to their Current Health and Ticker Values.  Such damage must have been lost within the Current Encounter and cannot have been lost due to round progression.",
    "featurePrereq": ["Shining Bolt", "Brighter Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Shining Blade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Light to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Brighter Light, you may decrease your Charge Count by 1 to use your Improved Empower Weapon ability to empower a mundane weapon with Enhanced Light. The ability lasts as long as your current Brighter Light effect. By using this ability, your Empowered Weapon now gains a +1d8 Arcane Enhancement Bonus instead of +1d6. Also, against Demonic, Infernal, and Undead opponents the weapon deals +1d8 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Shining Blade", "Improved Empower Weapon", "Brighter Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Novice Invoker",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have improved the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d6 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Invocation", "Improved Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Enhanced Fear",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Primal Power of Fear.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of Dread within a Living target that you can see within 50' of yourself. You gain a +1d6 bonus to all rolls made against any Living creature targeted by this ability. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 50' of you. This ability will last until the end of the Current Encounter. Also, if you succeed at a Touch Combat Check roll against the targeted opponent you can lower the target's Current Modifier value by 1d6. If this Value is lowered below 0 due to this ability, it will not also affect the target's Health. You may do this once per round as a Partial Action. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss.",
    "featurePrereq": ["Primal Fear", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Friendship and negate the effects of both. This will overpower and negate the effects of Primal Friendship."
  },
  {
    "featureName": "Deeper Dread",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Enhanced Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Fear. The Presence lasts until the end of the Current Encounter. Like Dreadful Guise, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else move away from you and choose a different opponent. If a Living creature does choose to enter into combat with you, you gain a +1d8 bonus to all rolls against the opponent. Additionally, while in Deeper Dread, you automatically gain the effects from the Feature Enhanced Fear without having to decrease your current Charge.",
    "featurePrereq": ["Fearful Guise", "Enhanced Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "More Dreadful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Fear to gain strength over your enemies.",
    "featureBenDesc": "As a Partial Action if you are using Deeper Dread, you may decrease your Charge Count by 1 to speak and inspire Dread in a targeted Living opponent. The ability lasts as long as your current Deeper Dread effect. By using this ability, anyone who enters Combat with this target gains a +1d8 Arcane Enhancement Bonus to all rolls against the target. Also, if the target fails at a Spiritual Defense roll agains your Use Magic check the target must decrease its Ticker and Modifier Values by 1d6.",
    "featurePrereq": ["Deeper Dread"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Enhanced Friendship",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Friendship.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of affection and goodwill within a Living ally that you can see within 50' of yourself. While targeted by this ability, the target gains a +1d6 bonus to all rolls made in defense of you. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 50' of you. This ability lasts until the end of the Current Encounter. Also, by touching a Living target you may raise the target's Current Modifier value by 1d6. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of you Enhanced Friendship effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Primal Friendship", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Fear and negate the effects of both. This will overpower and negate the effects of Primal Fear."
  },
  {
    "featureName": "Greater Kindness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Primal Power of Friendship to guide others and inspire affection.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Friendship. The effect lasts until the end of the Current Encounter. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else decide that you not an enemy and choose a different opponent. Allies in combat directly adjacent to you gain a +1d8 bonus to all rolls while fighting near you. Additionally, while in Greater Kindness, you automatically gain the effects from the Feature Enhanced Friendship without having to decrease your current Charge.",
    "featurePrereq": ["Kind Demeanor", "Enhanced Friendship"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Kinder Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Friendship to inspire affection in your enemies and to bolster your allies.",
    "featureBenDesc": "As a Partial Action if you are using Greater Kindness, you may decrease your Charge Count by 1 to speak and inspire Affection in a targeted Living ally. The ability lasts as long as your current Greater Kindness effect. By using this ability, the ally may add +1d8 to her Modifier Value. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["Kind Words", "Greater Kindness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Enhanced Anger",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Anger.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of rage within a Living target that you can see within 50' of yourself. While targeted by this ability, the target gains a +1d6 bonus to all additional damgage dealt on a successful Melee Combat check. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 50' of you. The effect lasts until the end of the Current Encounter. Also, by touching a Living target you may raise the target's Current Modifier value by 1d8. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of you Enhanced Anger effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Primal Anger", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Serenity and negate the effects of both. This will overpower and negate the effects of Primal Serenity."
  },
  {
    "featureName": "Worse Attitude",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Enhanced Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Anger. The effect lasts until the end of the Current Encounter. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become filled with hate for a different, random target. The affected opponent will immediately change direction and attack the new target. Allies in combat directly adjacent to you gain a +1d8 bonus to all damage dealt on a successful Melee Combat check while fighting near you. Additionally, while in Worse Attitude, you automatically gain the effects from the Feature Enhanced Anger without having to decrease your current Charge.",
    "featurePrereq": ["Bad Attitude", "Enhanced Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "More Hateful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Anger to empower your allies.",
    "featureBenDesc": "As a Partial Action if you are using Worse Attitude, you may decrease your Charge Count by 1 to speak and inspire Anger in a targeted Living ally. The ability lasts as long as your current Worse Attitude effect. By using this ability, the ally becomes Enraged as described in the Path of Violence Feature named Violent Rage. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["Hateful Words", "Worse Attitude"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Enhanced Serenity",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Serenity.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 50' of yourself. While targeted by this ability, the target no longer wishes to engage in combat and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 50' of you. The ability will last until the end of the Current Encounter. Also, if you succeed at a Melee Combat Touch attack against a Living Target, the target will disengage from Combat until the end of the Encounter. Opponents under the effect of Violent Rage will no longer be considered Enraged. The target may only benefit from this Touch once per Encounter. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Primal Serenity", "Novice Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Enhanced Anger and negate the effects of both. This will overpower and negate the effects of Primal Anger."
  },
  {
    "featureName": "Greater Peace",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Enhanced Power of Serenity to empower your actions and calm the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 1d4+1, you may manifest an Arcane Presence of Serenity. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts until the end of the Current Encounter. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and move away unless attacked. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Violent Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Greater Peace, you automatically gain the effects from the Feature Enhanced Serenity without having to decrease your current Charge.",
    "featurePrereq": ["Calming Presence", "Enhanced Serenity"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "More Peaceful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Serenity to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Greater Peace, you may decrease your Charge Count by 1 to speak and inspire Serenity in a targeted Living opponent. The ability lasts as long as your current Greater Peace effect. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat and move away. If attacked the opponent will defend, but not deal combat damage. An opponent in Violent Rage is no longer Enraged.",
    "featurePrereq": ["Greater Peace"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Sorcerer",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have become an actual Sorcerer.",
    "featureBenDesc": "Your Novice Sorcerer bonus die increases from 1d4 to 1d6.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Sorcery",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have advanced in your ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Expanded Arcane Powers. Your Sorcery bonus die to Charge Count has increase from 1d6 to 1d8.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Empower Weapon",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane Weapon, your Empower Weapon ability Arcane Enhancement bonus die has increased from +1d6 to +1d8.",
    "featurePrereq": ["Improved Empower Weapon", "Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Evoker",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have advanced in your ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d8 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Evoker", "Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Expanded Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Expanded Arcane Powers of Darkness.",
    "featureBenDesc": "You may now direct your Darkness to any point that you can see within 100' of you. Your Darkness Touch Combat Check roll against a targeted opponent within the Darkness now lowers the Target's Ticker Value by 1d8.",
    "featurePrereq": ["Enhanced Darkness", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Light and negate the effects of both. This will overpower and negate the effects of Enhanced Light."
  },
  {
    "featureName": "Deepest Darkness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Darkness to shroud and protect you.",
    "featureBenDesc": "Your Presence of Darkness now costs 2d4+2 charges to manifest but lasts for 8 hours or until your Current Charge Count equals 0 without having to be maintained. The Presence now provides you with 30% Concealment against all Ranged and Melee attacks. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will now suffer 1d10 points of Shadow Damage and loss from Ticker Value for each instance of contact. Additionally, while Cloaked in Darkness, you automatically gain the effects from the Feature Expanded Darkness without having to decrease your current Charge.",
    "featurePrereq": ["Deeper Darkness", "Expanded Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Darkbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Darkness to attack your foes.",
    "featureBenDesc": "Once you spend 2 Charges to manifest it, Advanced Darkbolt will last for as long as you are using Deepest Darkness. The Darkbolt may now be used to target 2 opponents or one opponent twice. You will make your normal Ranged Magic Combat check roll, but the bolt will now deal +2d8 points of additional damage. If there are two targets, the additional damage from the Darkbolt will be split in half (rounded down).  Also, the targets must reduce their Ticker Values by a number equal to the additional damage dealt to each by this attack.",
    "featurePrereq": ["Improved Darkbolt", "Deepest Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Darkblade",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Darkness to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Deepest Darkness, you may decrease your Charge Count by 1 to use your Advanced Empower Weapon ability to empower a mundane weapon with Expanded Darkness. The ability lasts as long as your current Deepest Darkness effect. Your Empowered Weapon effect increases from +1d8 to +1d10 and the weapon deals +1d10 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Improved Darkblade", "Advanced Empower Weapon", "Deepest Darkness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Expanded Flame",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Expanded Flame.",
    "featureBenDesc": "You may now ignite and control fires in a location that you can see up to 100' from you. Also, if you and an opponent are both within 50' of the same active fire, as a Ranged Combat attack, you may attempt to direct a spark of flame toward the target. The ranged attack deals Fire damage, and a damaged individual must take a Standard Action before your next Turn to roll a Physical Action check against 1d8 + fire damage suffered in order to extinquish the Flame or else suffer 1d8 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Enhanced Flame", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Frost and negate the effects of both. This will overpower and negate the effects of Enhanced Frost."
  },
  {
    "featureName": "Hottest Flames",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Flame to surround and protect you.",
    "featureBenDesc": "Your Presence of Flame now costs 2d4+2 charges to manifest but lasts for 8 hours or until your Current Charge Count equals 0 without having to be maintained. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d10 points of Fire Damage and must take a Standard Action before your next Turn to roll a Physical Action check against 1d10 + fire damage suffered in order to extinquish the Flame or else suffer 1d8 points of additional Fire damage each round until the Flame is put out. Additionally, while Wreathed in Flames, you automatically gain the effects from the Feature Expanded Flame without having to decrease your current Charge.",
    "featurePrereq": ["Hotter Flames", "Expanded Flame"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Flamebolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Flame to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Hotter Flames, you may decrease your Charge Count by 2 to gain the ability to target up to two opponents each round with a ranged Magic attack. You will make your normal Ranged Magic Combat check roll, but the bolt will now deal +2d8 points of additional damage. If there are two targets, the additional damage from the Flamebolt will be split in half (rounded down). Also, affected targets must take a Standard Action before your next Turn to roll a Physical Action check against 1d8 + fire damage suffered in order to extinquish the Flame or else suffer 1d8 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Improved Flamebolt", "Hottest Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Flameblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Flame to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Hottest Flames, you may decrease your Charge Count by 1 to use your Advanced Empower Weapon ability to empower a mundane weapon with Expanded Flame. The ability lasts as long as your current Hottest Flames effect. By using this ability, your Advanced Empowered Weapon now gains a +1d10 Arcane Enhancement Bonus instead of +1d8. Also, the weapon deals +1d10 points of additional Fire damage on a successful Combat Attack Check roll and the target must take a Standard Action before your next Turn to roll a Physical Action check against 1d10 + fire damage suffered in order to extinquish the Flame or else suffer 1d10 points of additional Fire damage each round until the Flame is put out.",
    "featurePrereq": ["Improved Flameblade", "Advanced Empower Weapon", "Hottest Flames"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Expanded Frost",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Expanded Frost.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may reduce the temperature in 5' radiius area centered on a point that you can see within 100' of yourself. The effect will freeze water within the affected area and leave a hard frozen coating on other items. As a free action once per round, you may increase or decrease the temperature within the affected area from icy to only cool. The ability lasts until the end of the Current Encounter. Also, each round that a living creature remains within the area of effect, it must succeed at a Physical Activity Check roll against your Use Magic result or else suffer a decrease to Ticker value by 1d8.",
    "featurePrereq": ["Enhanced Frost", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Flame and negate the effects of both. This will overpower and negate the effects of Enhanced Flame."
  },
  {
    "featureName": "Coldest Ice",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Expanded Power of Frost to encase and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Expanded Arcane Presence of Frost. The effect lasts for 8 hours or until your Current Charge Count equals 0. This effect now negates all Cold and 3/4 of all Fire damage dealt to you. Creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will now suffer 1d10 points of Cold Damage and Ticker Value loss. Additionally, while using Colder Ice, you automatically gain the effects from the Feature Expanded Frost without having to decrease your current Charge.",
    "featurePrereq": ["Colder Ice", "Expanded Frost"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Frostbolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Frost to attack your foes.",
    "featureBenDesc": "As a Partial Action if you are using Coldest Ice, you may decrease your Charge Count by 2 to gain the ability to target up to two opponents each round with a ranged Magic attack. The ability lasts as long as your current Coldest Ice effect. You will make your normal Ranged Magic Combat check roll, but the bolt will now deal +2d8 points of additional damage and Ticker Value loss on a successful Magic Attack roll. If there are two targets, the additional damage from the Frostbolt will be split in half (rounded down).",
    "featurePrereq": ["Improved Frostbolt", "Coldest Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Advanced Frostblade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Frost to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Coldest Ice, you may decrease your Charge Count by 1 to use your Advanced Empower Weapon ability to empower a mundane weapon with Expanded Frost. The ability lasts as long as your current Coldest Ice effect. By using this ability, your Empowered Weapon now gains a +1d10 Arcane Enhancement Bonus instead of +1d8. Also, the weapon deals +1d10 points of additional Cold damage and Ticker Value loss on a successful Magic Attack Check roll.",
    "featurePrereq": ["Improved Frostblade", "Advanced Empower Weapon", "Coldest Ice"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Expanded Light",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You may use Sorcery to Bind and Use Arcane Powers of Expanded Light.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may create or brighten radiant light from an area with a radius of up to 5' centered on a point that you can see within 100' of yourself. As a free action once per round, you may increase or decrease the level of brightness within the affected area from dim to full. The effect lasts until the end of the Current Encounter. Also, if you and another living creature are both within the Expanded Light, you may attempt to Touch the targeted creature in order to raise her Ticker Value by 1d8. You may do this once per round as a Partial Action. Undead, Demonic, and Infernal creatures Targeted with this Touch are allowed a Spiritual Defense Check roll against your Use Magic check or else suffer 1d8 points of loss to Ticker Value.",
    "featurePrereq": ["Enhanced Light", "Evoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Darkness and negate the effects of both. This will overpower and negate the effects of Enhanced Darkness."
  },
  {
    "featureName": "Brightest Light",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Expanded Power of Light to surround and protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Expanded Arcane Presence of Light. This Presence radiates from you and illuminates all within your Reach. The effect lasts for 8 hours or until your Current Charge Count equals 0. This effect provides a 75% Block against all Demonic, Infernal, and Undead attackers. Such creatures who you touch, who touch you without your consent, or who succeed at a Melee Combat Check against you will suffer 1d10 points of Radiant Damage and loss from Ticker Value for each instance of contact. Allies who you Touch may restore 1d10 lost hit points to their Current Health Value and as many lost points from their Ticker Value. Restored Ticker points must have been lost during the Current Encounter and must have been lost due to damage not round progression. Additionally, while using Brightest Light, you automatically gain the effects from the Feature Expanded Light without having to decrease your current Charge.",
    "featurePrereq": ["Brighter Light", "Expanded Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Advanced Shining Bolt",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Light to attack Evil foes and to aid your allies.",
    "featureBenDesc": "As a Partial Action if you are using Brightest Light, you may decrease your Charge Count by 2 to gain the ability to up to 2 opponents each round with a ranged Magic attack. The ability lasts as long as your current Brightest Light effect. You will make your normal Ranged Magic Combat check roll, but the Shining Bolt will now deal +2d8 points of additional damage on a successful Magic Attack Check roll against Demonic, Infernal, and Undead targets. Also, the target must reduce its Ticker Value by a number equal to the additional damage dealt by this attack. Living allies targeted by this ability will restore 2d8 points of lost damage to their Current Health and Ticker Values. Such damage must have been lost within the Current Encounter and cannot have been lost due to round progression. If there are two targets, the additional damage or Health from the Shining Bolt will be split in half (rounded down). ",
    "featurePrereq": ["Shining Bolt", "Brightest Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Improved Shining Blade",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You can use the Arcane Power of Expanded Light to enhance your weapon.",
    "featureBenDesc": "As a Partial Action if you are using Brightest Light, you may decrease your Charge Count by 1 to use your Improved Empower Weapon ability to empower a mundane weapon with Expanded Light. The ability lasts as long as your current Brightest Light effect. By using this ability, your Empowered Weapon now gains a +1d10 Arcane Enhancement Bonus instead of +1d8. Also, against Demonic, Infernal, and Undead opponents the weapon deals +1d10 points of additional damage on a successful Combat Attack Check roll and causes the damaged opponent to lose an equal amount of points from her Ticker Value.",
    "featurePrereq": ["Shining Blade", "Improved Empower Weapon", "Brightest Light"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "If the weapon leaves your hand for more than one round, the effect is negated. This effect may only be used once per Encounter and only on a single weapon."
  },
  {
    "featureName": "Invoker",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have advanced in the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d8 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Invoker", "Advanced Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Expanded Fear",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Power of Fear.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of Dread within a Living target that you can see within 100' of yourself. You gain a +1d8 bonus to all rolls made against any Living creature targeted by this ability. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. This ability will last until the end of the Current Encounter. Also, if you succeed at a Touch Combat Check roll against the targeted opponent you can lower the target's Current Modifier value by 1d8. If this Value is lowered below 0 due to this ability, it will not also affect the target's Health. You may do this once per round as a Partial Action. Targeted individuals are allowed a Spiritual Defense Check roll against your Use Magic check in order to negate this loss.",
    "featurePrereq": ["Enhanced Fear", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Friendship and negate the effects of both. This will overpower and negate the effects of Enhanced Friendship."
  },
  {
    "featureName": "Deepest Dread",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Fear to protect you.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Arcane Presence of Fear. The Presence lasts for 8 hours or until your Current Charge Count equals 0. Like Deeper Dread, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else move away from you and choose a different opponent. If a Living creature does choose to enter into combat with you, you gain a +1d10 bonus to all rolls against the opponent. Additionally, while in Deepest Dread, you automatically gain the effects from the Feature Expanded Fear without having to decrease your current Charge.",
    "featurePrereq": ["Deeper Dread", "Expanded Fear"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Most Dreadful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Fear to gain strength over your enemies.",
    "featureBenDesc": "As a Partial Action if you are using Deepest Dread, you may decrease your Charge Count by 1 to speak and inspire Dread in a targeted Living opponent. The ability lasts as long as your current Deepest Dread effect. By using this ability, anyone who enters Combat with this target gains a +1d10 Arcane Enhancement Bonus to all rolls against the target until the end of the Current Encounter. Also, if the target fails at a Spiritual Defense roll agains your Use Magic check the target must decrease its Ticker and Modifier Values by 1d8.",
    "featurePrereq": ["Deeper Dread"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Enhanced Friendship",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Friendship.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of affection and goodwill within a Living ally that you can see within 100' of yourself. While targeted by this ability, the target gains a +1d8 bonus to all rolls made in defense of you. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. This ability lasts until the end of the Current Encounter. Also, by touching a Living target you may raise the target's Current Modifier value by 1d8. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of you Enhanced Friendship effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Enhanced Friendship", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Fear and negate the effects of both. This will overpower and negate the effects of Enhanced Fear."
  },
  {
    "featureName": "Greatest Kindness",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Power of Friendship to guide others and inspire affection.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Arcane Presence of Friendship. The effect lasts for 8 hours or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check against your Use Magic Check or else decide that you not an enemy and choose a different opponent. Allies in combat directly adjacent to you gain a +1d10 bonus to all rolls while fighting near you. Additionally, while in Greatest Kindness, you automatically gain the effects from the Feature Enhanced Friendship without having to decrease your current Charge.",
    "featurePrereq": ["Greater Kindness", "Enhanced Friendship"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may only have one Arcane Presence active at a time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Kindest Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Enhanced Friendship to inspire affection in your enemies and to bolster your allies.",
    "featureBenDesc": "As a Partial Action if you are using Greatest Kindness, you may decrease your Charge Count by 1 to speak and inspire Affection in a targeted Living ally. The ability lasts as long as your current Greatest Kindness effect. By using this ability, the ally may add +1d10 to her Modifier Value. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["Kindest Words", "Greatest Kindness"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Expanded Anger",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Enhanced Arcane Power of Anger.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of rage within a Living target that you can see within 100' of yourself. While targeted by this ability, the target gains a +1d8 bonus to all additional damgage dealt on a successful Melee Combat check. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. The effect lasts until the end of the Current Encounter. Also, by touching a Living target you may raise the target's Current Modifier value by 1d10. The target may only benefit from this Touch once per Encounter and the bonus lasts only until the end of you Expanded Anger effect. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Enhanced Anger", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Serenity and negate the effects of both. This will overpower and negate the effects of Enhanced Serenity."
  },
  {
    "featureName": "Worst Attitude",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Expanded Power of Anger to empower your actions and cloud the minds of your enemies with frustration.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Arcane Presence of Anger. The effect lasts for 8 hours or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become filled with hate for a different, random target. The affected opponent will immediately change direction and attack the new target. Allies in combat directly adjacent to you gain a +1d10 bonus to all damage dealt on a successful Melee Combat check while fighting near you. Additionally, while in Worse Attitude, you automatically gain the effects from the Feature Expanded Anger without having to decrease your current Charge.",
    "featurePrereq": ["Worse Attitude", "Expanded Anger"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Most Hateful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Anger to empower your allies.",
    "featureBenDesc": "As a Partial Action if you are using Worst Attitude, you may decrease your Charge Count by 1 to speak and inspire Anger in a targeted Living ally. The ability lasts as long as your current Worst Attitude effect. By using this ability, the ally becomes Enraged as described in the Path of Violence Feature named Blood Rage. The target may only benefit from this ability once per Encounter. The bonus lasts until the end of the current Encounter. ",
    "featurePrereq": ["More Hateful Words", "Worst Attitude"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Expanded Serenity",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use Sorcery to Invoke the Expanded Arcane Power of Serenity.",
    "featureBenDesc": "As a standard action, by decreasing your Charge Count by 1, you may manifest a feeling of peace and contentment within a Living target that you can see within 100' of yourself. While targeted by this ability, the target no longer wishes to engage in combat and will not take any agressive actions while affected. If attacked, the target will defend, but not deal damage. As a free action once per round, you may change the target of this ability to another Living opponent that you can see within 100' of you. The ability will last until the end of the Current Encounter. Also, if you succeed at a Melee Combat Touch attack against a Living Target, the target will disengage from Combat until the end of the Encounter. Opponents under the effect of Blood Rage will no longer be considered Enraged. The target may only benefit from this Touch once per Encounter. You may do this once per round as a Partial Action.",
    "featurePrereq": ["Enhanced Serenity", "Invoker"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "The effects of this Power will counter the effects from Expanded Anger and negate the effects of both. This will overpower and negate the effects of Enhanced Anger."
  },
  {
    "featureName": "Greatest Peace",
    "featureCost": 3,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Expanded Power of Serenity to empower your actions and calm the minds of your enemies.",
    "featureBenDesc": "As a Full Round Action, by decreasing your Charge Count by 2d4+2, you may manifest an Arcane Presence of Serenity. This Presence inspires contentment in those who see you. While near you, others feel peaceful. The effect lasts for 8 hours or until your Current Charge Count equals 0. While using this Presence, opponents who choose to engage with you during Combat must succeed at a Spiritual Defense Check agains your Use Magic Check or else become peaceful and leave Combat. The affected opponent will immediately break from Combat and move away unless attacked. If attacked, the target will defend, but not deal combat damage. If the affected opponent was under the influence of Blood Rage, or an effect that mimics it, the opponent is no longer Enraged. Additionally, while in Greatest Peace, you automatically gain the effects from the Feature Expanded Serenity without having to decrease your current Charge.",
    "featurePrereq": ["Greater Peace", "Expanded Serenity"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "You may have only one Presense active at any one time. This effect will remain until dismissed or until you lose consciousness."
  },
  {
    "featureName": "Most Peaceful Words",
    "featureCost": 1,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You can use the Arcane Power of Expanded Serenity to sway your opponents.",
    "featureBenDesc": "As a Partial Action if you are using Greatest Peace, you may decrease your Charge Count by 1 to speak and inspire Serenity in a targeted Living opponent. The ability lasts as long as your current Greatest Peace effect. When using this ability, the opponent must succeed at a Spiritual Defense Check against your Use Magic roll or else immediatly break from combat and move away. If attacked the opponent will defend, but not deal combat damage. An opponent in Blood Rage is no longer Enraged.",
    "featurePrereq": ["Greatest Peace"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": "This ability may only affect targets that are able to hear your words."
  },
  {
    "featureName": "Master Sorcerer",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have become a Master Sorcerer.",
    "featureBenDesc": "Your Sorcerer bonus die increases from 1d6 to 1d8.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Novice Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Sorcery",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You have mastered the ability to Bind and control Arcane Energy using the strength of your emotions and instincts.",
    "featureBenDesc": "You may learn and use Superior Arcane Powers. Your Sorcery bonus die to Charge Count has increase from 1d8 to 1d10.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Master Sorcerer"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Superior Empower Weapon",
    "featureCost": 2,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Sorcery",
    "featureDesc": "You can use Sorcery to bind Arcane Energy into a mundane weapon and temporarily cause it to become an item of Arcane Power.",
    "featureBenDesc": "When used on a Mundane Weapon, your Empower Weapon ability Arcane Enhancement bonus die has increased from +1d8 to +1d10.",
    "featurePrereq": ["Advanced Empower Weapon", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Master Evoker",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Evocation",
    "featureDesc": "You have advanced in your ability to wield Arcane Energy as a destructive force.",
    "featureBenDesc": "When using Arcane Magic in combat to deal damage, you gain an additional +1d10 to your Combat check roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Evoker", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },
  {
    "featureName": "Master Invoker",
    "featureCost": 4,
    "featureClass": "Arcanist",
    "featurePath": "Sorcery",
    "featurePathTree": "Invocation",
    "featureDesc": "You have mastered the ability to use your thoughts and emotions to bind Arcane Energy in order to effect the thoughts and emotions of others.",
    "featureBenDesc": "When using Arcane Magic to affect the Mental or Spiritual states of others, gain +1d10 to your Use Magic roll.",
    "hasFeaturePrereq": true,
    "featurePrereq": ["Invoker", "Superior Sorcery"],
    "hasFeatureNumBonus": false,
    "featureNumBonus": 0,
    "featureBonusType": "",
    "hasFeatureBonusDie": false,
    "featureBonusDieType": 0,
    "featureBonuseDieNum": 0,
    "hasIncreaseDieType": false,
    "hasIncreaseDieNum": false,
    "dieTypeIncreaseAmount": 0,
    "dieNumIncreaseAmount": 0,
    "featureCanRepeat": false,
    "featureNote": ""
  },




]